TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:17 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0806013                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Thu Jun 25 17:41:16 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/drivers/adc/src/32b/f28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.2.3\bin\opt2000.exe C:\\Users\\a0220341\\AppData\\Local\\Te

    2530              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_12"), DW_AT_const_value(0x0c)
    2531              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_13"), DW_AT_const_value(0x0d)
    2532              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_14"), DW_AT_const_value(0x0e)
    2533              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_15"), DW_AT_const_value(0x0f)
    2534                      .dwendtag $C$DW$T$58
    2535              
    2536              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_SocFrc_e")
    2537                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2538                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2539              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    2540                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$59)
    2541              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2542                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$347)
    2543              
    2544              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2545                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2546              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Ext"), DW_AT_const_value(0x00)
    2547              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Int"), DW_AT_const_value(0x01)
    2548                      .dwendtag $C$DW$T$61
    2549              
    2550              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_TempSensorSrc_e")
    2551                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2552                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2553              $C$DW$350       .dwtag  DW_TAG_TI_far_type
    2554                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$62)
    2555              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2556                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$350)
    2557              
    2558              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2559                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2560              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Int"), DW_AT_const_value(0x00)
    2561              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Ext"), DW_AT_const_value(0x08)
    2562                      .dwendtag $C$DW$T$64
    2563              
    2564              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_VoltageRefSrc_e")
    2565                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2566                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2567              $C$DW$353       .dwtag  DW_TAG_TI_far_type
    2568                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$65)
    2569              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2570                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$353)
    2571              
    2572              $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    2573                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    2574              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_1"), DW_AT_const_value(0x00)
    2575              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_2"), DW_AT_const_value(0x01)
    2576                      .dwendtag $C$DW$T$67
    2577              
    2578              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_DivideSelect_e")
    2579                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2580                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2581              $C$DW$356       .dwtag  DW_TAG_TI_far_type
    2582                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$68)
    2583              $C$DW$T$69      .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:17 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0806013                         PAGE   50

    2584                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$356)
    2585              
    2586              $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    2587                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    2588              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_NoIntTriggersSOC"), DW_AT_const_value(0x00)
    2589              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int1TriggersSOC"), DW_AT_const_value(0x01)
    2590              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int2TriggersSOC"), DW_AT_const_value(0x02)
    2591                      .dwendtag $C$DW$T$74
    2592              
    2593              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_IntTriggerSOC_e")
    2594                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2595                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2596              $C$DW$360       .dwtag  DW_TAG_TI_far_type
    2597                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$75)
    2598              $C$DW$T$76      .dwtag  DW_TAG_const_type
    2599                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$360)
    2600              
    2601              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2602                      .dwattr $C$DW$T$27, DW_AT_name("_ADC_Obj_")
    2603                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x6650)
    2604              $C$DW$361       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$21)
    2606                      .dwattr $C$DW$361, DW_AT_name("ADCRESULT")
    2607                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCRESULT")
    2608                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2610              $C$DW$362       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$22)
    2612                      .dwattr $C$DW$362, DW_AT_name("resvd_1")
    2613                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_resvd_1")
    2614                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2615                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$363       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    2618                      .dwattr $C$DW$363, DW_AT_name("ADCCTL1")
    2619                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ADCCTL1")
    2620                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2621                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2622              $C$DW$364       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    2624                      .dwattr $C$DW$364, DW_AT_name("ADCCTL2")
    2625                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_ADCCTL2")
    2626                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2627                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2628              $C$DW$365       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    2630                      .dwattr $C$DW$365, DW_AT_name("rsvd_2")
    2631                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd_2")
    2632                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2633                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2634              $C$DW$366       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2636                      .dwattr $C$DW$366, DW_AT_name("ADCINTFLG")
    2637                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCINTFLG")
    2638                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:17 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0806013                         PAGE   51

    2639                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$367       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2642                      .dwattr $C$DW$367, DW_AT_name("ADCINTFLGCLR")
    2643                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2644                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2645                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$368       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2648                      .dwattr $C$DW$368, DW_AT_name("ADCINTOVF")
    2649                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCINTOVF")
    2650                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2651                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$369       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2654                      .dwattr $C$DW$369, DW_AT_name("ADCINTOVFCLR")
    2655                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2656                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2657                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2658              $C$DW$370       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$24)
    2660                      .dwattr $C$DW$370, DW_AT_name("INTSELxNy")
    2661                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_INTSELxNy")
    2662                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2663                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2664              $C$DW$371       .dwtag  DW_TAG_member
    2665                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$25)
    2666                      .dwattr $C$DW$371, DW_AT_name("rsvd_3")
    2667                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd_3")
    2668                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2669                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2670              $C$DW$372       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2672                      .dwattr $C$DW$372, DW_AT_name("SOCPRICTRL")
    2673                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2674                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2675                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2676              $C$DW$373       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2678                      .dwattr $C$DW$373, DW_AT_name("rsvd_4")
    2679                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd_4")
    2680                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2681                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2682              $C$DW$374       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2684                      .dwattr $C$DW$374, DW_AT_name("ADCSAMPLEMODE")
    2685                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2686                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2687                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$375       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2690                      .dwattr $C$DW$375, DW_AT_name("rsvd_5")
    2691                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_rsvd_5")
    2692                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2693                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:17 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0806013                         PAGE   52

    2694              $C$DW$376       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2696                      .dwattr $C$DW$376, DW_AT_name("ADCINTSOCSEL1")
    2697                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2698                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2699                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2700              $C$DW$377       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2702                      .dwattr $C$DW$377, DW_AT_name("ADCINTSOCSEL2")
    2703                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2704                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2705                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2706              $C$DW$378       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    2708                      .dwattr $C$DW$378, DW_AT_name("rsvd_6")
    2709                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_6")
    2710                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2711                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$379       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    2714                      .dwattr $C$DW$379, DW_AT_name("ADCSOCFLG1")
    2715                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2716                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    2717                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2718              $C$DW$380       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    2720                      .dwattr $C$DW$380, DW_AT_name("rsvd_7")
    2721                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_7")
    2722                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2723                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2724              $C$DW$381       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    2726                      .dwattr $C$DW$381, DW_AT_name("ADCSOCFRC1")
    2727                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2728                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2729                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2730              $C$DW$382       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    2732                      .dwattr $C$DW$382, DW_AT_name("rsvd_8")
    2733                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd_8")
    2734                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2735                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2736              $C$DW$383       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    2738                      .dwattr $C$DW$383, DW_AT_name("ADCSOCOVF1")
    2739                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2740                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2741                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2742              $C$DW$384       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    2744                      .dwattr $C$DW$384, DW_AT_name("rsvd_9")
    2745                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_rsvd_9")
    2746                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2747                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2748              $C$DW$385       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:17 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0806013                         PAGE   53

    2749                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    2750                      .dwattr $C$DW$385, DW_AT_name("ADCSOCOVFCLR1")
    2751                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2752                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2753                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2754              $C$DW$386       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    2756                      .dwattr $C$DW$386, DW_AT_name("rsvd_10")
    2757                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd_10")
    2758                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2759                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2760              $C$DW$387       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    2762                      .dwattr $C$DW$387, DW_AT_name("ADCSOCxCTL")
    2763                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2764                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2765                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2766              $C$DW$388       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
    2768                      .dwattr $C$DW$388, DW_AT_name("rsvd_11")
    2769                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd_11")
    2770                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2771                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2772              $C$DW$389       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    2774                      .dwattr $C$DW$389, DW_AT_name("ADCREFTRIM")
    2775                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2776                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2777                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2778              $C$DW$390       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    2780                      .dwattr $C$DW$390, DW_AT_name("ADCOFFTRIM")
    2781                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2782                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2783                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2784              $C$DW$391       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$26)
    2786                      .dwattr $C$DW$391, DW_AT_name("resvd_12")
    2787                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_resvd_12")
    2788                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2789                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2790              $C$DW$392       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    2792                      .dwattr $C$DW$392, DW_AT_name("ADCREV")
    2793                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ADCREV")
    2794                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2795                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2796                      .dwendtag $C$DW$T$27
    2797              
    2798              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    2799                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    2800                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2801              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2802                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    2803                      .dwattr $C$DW$T$70, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:17 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0806013                         PAGE   54

    2804              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    2805                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2806                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2807              $C$DW$393       .dwtag  DW_TAG_TI_far_type
    2808                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$71)
    2809              $C$DW$T$78      .dwtag  DW_TAG_const_type
    2810                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$393)
    2811              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2812                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2813              $C$DW$394       .dwtag  DW_TAG_TI_far_type
    2814                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$3)
    2815              $C$DW$T$84      .dwtag  DW_TAG_const_type
    2816                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$394)
    2817              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2818                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2819                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2820                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2821              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2822                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2823                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2824                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2825              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2826                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2827                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2828                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2829              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2830                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2831                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2832                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2833              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2834                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2835                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2836                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2837              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2838                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2839                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2840                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2841              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2842                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2843                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2844              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    2845                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
