TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Fri Jun 26 10:57:42 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/ctrl/src/32b/ct
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6634              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6635              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6636              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6637              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6638              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6639              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6640              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6641              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6642              $C$DW$664       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6643              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6644              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6645                      .dwendtag $C$DW$T$162
    6646              
    6647              $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6648                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    6649                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    6650              
    6651              $C$DW$T$172     .dwtag  DW_TAG_enumeration_type
    6652                      .dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
    6653              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6654              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6655              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6656              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6657              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6658              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6659              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6660              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6661              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6662              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6663              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6664              $C$DW$678       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6665              $C$DW$679       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6666              $C$DW$680       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6667              $C$DW$681       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6668                      .dwendtag $C$DW$T$172
    6669              
    6670              $C$DW$T$173     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6671                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    6672                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    6673              
    6674              $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    6675                      .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    6676              $C$DW$682       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6677              $C$DW$683       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6678              $C$DW$684       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6679                      .dwendtag $C$DW$T$177
    6680              
    6681              $C$DW$T$178     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6682                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    6683                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    6684              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    6685                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$178)
    6686              $C$DW$T$179     .dwtag  DW_TAG_const_type
    6687                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$685)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  129

    6688              
    6689              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6690                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6691                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6692              $C$DW$686       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
    6694                      .dwattr $C$DW$686, DW_AT_name("ADCRESULT")
    6695                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCRESULT")
    6696                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6697                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6698              $C$DW$687       .dwtag  DW_TAG_member
    6699                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$25)
    6700                      .dwattr $C$DW$687, DW_AT_name("resvd_1")
    6701                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_resvd_1")
    6702                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6703                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6704              $C$DW$688       .dwtag  DW_TAG_member
    6705                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    6706                      .dwattr $C$DW$688, DW_AT_name("ADCCTL1")
    6707                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCCTL1")
    6708                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6709                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6710              $C$DW$689       .dwtag  DW_TAG_member
    6711                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$23)
    6712                      .dwattr $C$DW$689, DW_AT_name("ADCCTL2")
    6713                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ADCCTL2")
    6714                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6715                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6716              $C$DW$690       .dwtag  DW_TAG_member
    6717                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$26)
    6718                      .dwattr $C$DW$690, DW_AT_name("rsvd_2")
    6719                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_rsvd_2")
    6720                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6721                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6722              $C$DW$691       .dwtag  DW_TAG_member
    6723                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$23)
    6724                      .dwattr $C$DW$691, DW_AT_name("ADCINTFLG")
    6725                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_ADCINTFLG")
    6726                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6727                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6728              $C$DW$692       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    6730                      .dwattr $C$DW$692, DW_AT_name("ADCINTFLGCLR")
    6731                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6732                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6733                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6734              $C$DW$693       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    6736                      .dwattr $C$DW$693, DW_AT_name("ADCINTOVF")
    6737                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCINTOVF")
    6738                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6739                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6740              $C$DW$694       .dwtag  DW_TAG_member
    6741                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    6742                      .dwattr $C$DW$694, DW_AT_name("ADCINTOVFCLR")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  130

    6743                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6744                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6745                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6746              $C$DW$695       .dwtag  DW_TAG_member
    6747                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$27)
    6748                      .dwattr $C$DW$695, DW_AT_name("INTSELxNy")
    6749                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_INTSELxNy")
    6750                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6751                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6752              $C$DW$696       .dwtag  DW_TAG_member
    6753                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$28)
    6754                      .dwattr $C$DW$696, DW_AT_name("rsvd_3")
    6755                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_3")
    6756                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6757                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6758              $C$DW$697       .dwtag  DW_TAG_member
    6759                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    6760                      .dwattr $C$DW$697, DW_AT_name("SOCPRICTRL")
    6761                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6762                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6763                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6764              $C$DW$698       .dwtag  DW_TAG_member
    6765                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    6766                      .dwattr $C$DW$698, DW_AT_name("rsvd_4")
    6767                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_4")
    6768                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6769                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6770              $C$DW$699       .dwtag  DW_TAG_member
    6771                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    6772                      .dwattr $C$DW$699, DW_AT_name("ADCSAMPLEMODE")
    6773                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6774                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6775                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6776              $C$DW$700       .dwtag  DW_TAG_member
    6777                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    6778                      .dwattr $C$DW$700, DW_AT_name("rsvd_5")
    6779                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_5")
    6780                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6781                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6782              $C$DW$701       .dwtag  DW_TAG_member
    6783                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    6784                      .dwattr $C$DW$701, DW_AT_name("ADCINTSOCSEL1")
    6785                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6786                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6787                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6788              $C$DW$702       .dwtag  DW_TAG_member
    6789                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    6790                      .dwattr $C$DW$702, DW_AT_name("ADCINTSOCSEL2")
    6791                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6792                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6793                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6794              $C$DW$703       .dwtag  DW_TAG_member
    6795                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$26)
    6796                      .dwattr $C$DW$703, DW_AT_name("rsvd_6")
    6797                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_6")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  131

    6798                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6799                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6800              $C$DW$704       .dwtag  DW_TAG_member
    6801                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    6802                      .dwattr $C$DW$704, DW_AT_name("ADCSOCFLG1")
    6803                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6804                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6805                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6806              $C$DW$705       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$23)
    6808                      .dwattr $C$DW$705, DW_AT_name("rsvd_7")
    6809                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_7")
    6810                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6811                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6812              $C$DW$706       .dwtag  DW_TAG_member
    6813                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$23)
    6814                      .dwattr $C$DW$706, DW_AT_name("ADCSOCFRC1")
    6815                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6816                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6817                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6818              $C$DW$707       .dwtag  DW_TAG_member
    6819                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    6820                      .dwattr $C$DW$707, DW_AT_name("rsvd_8")
    6821                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_rsvd_8")
    6822                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6823                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6824              $C$DW$708       .dwtag  DW_TAG_member
    6825                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    6826                      .dwattr $C$DW$708, DW_AT_name("ADCSOCOVF1")
    6827                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6828                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6829                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6830              $C$DW$709       .dwtag  DW_TAG_member
    6831                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$23)
    6832                      .dwattr $C$DW$709, DW_AT_name("rsvd_9")
    6833                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_9")
    6834                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6835                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6836              $C$DW$710       .dwtag  DW_TAG_member
    6837                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    6838                      .dwattr $C$DW$710, DW_AT_name("ADCSOCOVFCLR1")
    6839                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6840                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6841                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6842              $C$DW$711       .dwtag  DW_TAG_member
    6843                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$23)
    6844                      .dwattr $C$DW$711, DW_AT_name("rsvd_10")
    6845                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_rsvd_10")
    6846                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6847                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6848              $C$DW$712       .dwtag  DW_TAG_member
    6849                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$24)
    6850                      .dwattr $C$DW$712, DW_AT_name("ADCSOCxCTL")
    6851                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6852                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  132

    6853                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6854              $C$DW$713       .dwtag  DW_TAG_member
    6855                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$24)
    6856                      .dwattr $C$DW$713, DW_AT_name("rsvd_11")
    6857                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_rsvd_11")
    6858                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6859                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6860              $C$DW$714       .dwtag  DW_TAG_member
    6861                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$23)
    6862                      .dwattr $C$DW$714, DW_AT_name("ADCREFTRIM")
    6863                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6864                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6865                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6866              $C$DW$715       .dwtag  DW_TAG_member
    6867                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    6868                      .dwattr $C$DW$715, DW_AT_name("ADCOFFTRIM")
    6869                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6870                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6871                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6872              $C$DW$716       .dwtag  DW_TAG_member
    6873                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$29)
    6874                      .dwattr $C$DW$716, DW_AT_name("resvd_12")
    6875                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_resvd_12")
    6876                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6877                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6878              $C$DW$717       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$23)
    6880                      .dwattr $C$DW$717, DW_AT_name("ADCREV")
    6881                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_ADCREV")
    6882                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6883                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6884                      .dwendtag $C$DW$T$30
    6885              
    6886              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    6887                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    6888                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    6889              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6890                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    6891                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    6892              
    6893              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6894                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    6895                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    6896              $C$DW$718       .dwtag  DW_TAG_member
    6897                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$31)
    6898                      .dwattr $C$DW$718, DW_AT_name("alpha_sf")
    6899                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_alpha_sf")
    6900                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6901                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6902              $C$DW$719       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$31)
    6904                      .dwattr $C$DW$719, DW_AT_name("beta_sf")
    6905                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_beta_sf")
    6906                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6907                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  133

    6908              $C$DW$720       .dwtag  DW_TAG_member
    6909                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$32)
    6910                      .dwattr $C$DW$720, DW_AT_name("numSensors")
    6911                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_numSensors")
    6912                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6913                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6914                      .dwendtag $C$DW$T$33
    6915              
    6916              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6917                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    6918                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6919              $C$DW$T$180     .dwtag  DW_TAG_pointer_type
    6920                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$44)
    6921                      .dwattr $C$DW$T$180, DW_AT_address_class(0x16)
    6922              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    6923                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    6924                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    6925              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6926                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    6927                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    6928              
    6929              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6930                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    6931                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    6932              $C$DW$721       .dwtag  DW_TAG_member
    6933                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$23)
    6934                      .dwattr $C$DW$721, DW_AT_name("XCLK")
    6935                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_XCLK")
    6936                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6937                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6938              $C$DW$722       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    6940                      .dwattr $C$DW$722, DW_AT_name("rsvd_1")
    6941                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_rsvd_1")
    6942                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6943                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6944              $C$DW$723       .dwtag  DW_TAG_member
    6945                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    6946                      .dwattr $C$DW$723, DW_AT_name("CLKCTL")
    6947                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_CLKCTL")
    6948                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6949                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6950              $C$DW$724       .dwtag  DW_TAG_member
    6951                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$34)
    6952                      .dwattr $C$DW$724, DW_AT_name("rsvd_2")
    6953                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_rsvd_2")
    6954                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6955                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6956              $C$DW$725       .dwtag  DW_TAG_member
    6957                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$23)
    6958                      .dwattr $C$DW$725, DW_AT_name("LOSPCP")
    6959                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_LOSPCP")
    6960                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6961                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6962              $C$DW$726       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  134

    6963                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$23)
    6964                      .dwattr $C$DW$726, DW_AT_name("PCLKCR0")
    6965                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_PCLKCR0")
    6966                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6967                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6968              $C$DW$727       .dwtag  DW_TAG_member
    6969                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$23)
    6970                      .dwattr $C$DW$727, DW_AT_name("PCLKCR1")
    6971                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_PCLKCR1")
    6972                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6973                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6974              $C$DW$728       .dwtag  DW_TAG_member
    6975                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$26)
    6976                      .dwattr $C$DW$728, DW_AT_name("rsvd_3")
    6977                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_rsvd_3")
    6978                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6979                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6980              $C$DW$729       .dwtag  DW_TAG_member
    6981                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$23)
    6982                      .dwattr $C$DW$729, DW_AT_name("PCLKCR3")
    6983                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_PCLKCR3")
    6984                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6985                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6986                      .dwendtag $C$DW$T$35
    6987              
    6988              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    6989                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    6990                      .dwattr $C$DW$T$91, DW_AT_address_class(0x16)
    6991              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6992                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    6993                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    6994              
    6995              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6996                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    6997                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6998              $C$DW$730       .dwtag  DW_TAG_member
    6999                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$32)
    7000                      .dwattr $C$DW$730, DW_AT_name("tmp")
    7001                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_tmp")
    7002                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7003                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7004                      .dwendtag $C$DW$T$36
    7005              
    7006              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    7007                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
    7008                      .dwattr $C$DW$T$93, DW_AT_address_class(0x16)
    7009              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7010                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    7011                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    7012              
    7013              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    7014                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    7015                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    7016              $C$DW$731       .dwtag  DW_TAG_member
    7017                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  135

    7018                      .dwattr $C$DW$731, DW_AT_name("version")
    7019                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_version")
    7020                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7021                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7022              $C$DW$732       .dwtag  DW_TAG_member
    7023                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$39)
    7024                      .dwattr $C$DW$732, DW_AT_name("state")
    7025                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_state")
    7026                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7027                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7028              $C$DW$733       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$39)
    7030                      .dwattr $C$DW$733, DW_AT_name("prevState")
    7031                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_prevState")
    7032                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7033                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7034              $C$DW$734       .dwtag  DW_TAG_member
    7035                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$41)
    7036                      .dwattr $C$DW$734, DW_AT_name("errorCode")
    7037                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_errorCode")
    7038                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7039                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7040              $C$DW$735       .dwtag  DW_TAG_member
    7041                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$43)
    7042                      .dwattr $C$DW$735, DW_AT_name("clarkeHandle_I")
    7043                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7044                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7045                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7046              $C$DW$736       .dwtag  DW_TAG_member
    7047                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$44)
    7048                      .dwattr $C$DW$736, DW_AT_name("clarke_I")
    7049                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_clarke_I")
    7050                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7051                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7052              $C$DW$737       .dwtag  DW_TAG_member
    7053                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$43)
    7054                      .dwattr $C$DW$737, DW_AT_name("clarkeHandle_V")
    7055                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7056                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7057                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7058              $C$DW$738       .dwtag  DW_TAG_member
    7059                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$44)
    7060                      .dwattr $C$DW$738, DW_AT_name("clarke_V")
    7061                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_clarke_V")
    7062                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7063                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7064              $C$DW$739       .dwtag  DW_TAG_member
    7065                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$46)
    7066                      .dwattr $C$DW$739, DW_AT_name("estHandle")
    7067                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_estHandle")
    7068                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7069                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7070              $C$DW$740       .dwtag  DW_TAG_member
    7071                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$48)
    7072                      .dwattr $C$DW$740, DW_AT_name("parkHandle")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  136

    7073                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_parkHandle")
    7074                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7075                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7076              $C$DW$741       .dwtag  DW_TAG_member
    7077                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$49)
    7078                      .dwattr $C$DW$741, DW_AT_name("park")
    7079                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_park")
    7080                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7081                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7082              $C$DW$742       .dwtag  DW_TAG_member
    7083                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$51)
    7084                      .dwattr $C$DW$742, DW_AT_name("pidHandle_Id")
    7085                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_pidHandle_Id")
    7086                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7087                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7088              $C$DW$743       .dwtag  DW_TAG_member
    7089                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$52)
    7090                      .dwattr $C$DW$743, DW_AT_name("pid_Id")
    7091                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pid_Id")
    7092                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7093                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7094              $C$DW$744       .dwtag  DW_TAG_member
    7095                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$51)
    7096                      .dwattr $C$DW$744, DW_AT_name("pidHandle_Iq")
    7097                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7098                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7099                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7100              $C$DW$745       .dwtag  DW_TAG_member
    7101                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$52)
    7102                      .dwattr $C$DW$745, DW_AT_name("pid_Iq")
    7103                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_pid_Iq")
    7104                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7105                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7106              $C$DW$746       .dwtag  DW_TAG_member
    7107                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$51)
    7108                      .dwattr $C$DW$746, DW_AT_name("pidHandle_spd")
    7109                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_pidHandle_spd")
    7110                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7111                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7112              $C$DW$747       .dwtag  DW_TAG_member
    7113                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$52)
    7114                      .dwattr $C$DW$747, DW_AT_name("pid_spd")
    7115                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_pid_spd")
    7116                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7117                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7118              $C$DW$748       .dwtag  DW_TAG_member
    7119                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$54)
    7120                      .dwattr $C$DW$748, DW_AT_name("iparkHandle")
    7121                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_iparkHandle")
    7122                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7123                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7124              $C$DW$749       .dwtag  DW_TAG_member
    7125                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$55)
    7126                      .dwattr $C$DW$749, DW_AT_name("ipark")
    7127                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_ipark")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  137

    7128                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7129                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7130              $C$DW$750       .dwtag  DW_TAG_member
    7131                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$57)
    7132                      .dwattr $C$DW$750, DW_AT_name("svgenHandle")
    7133                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_svgenHandle")
    7134                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7135                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7136              $C$DW$751       .dwtag  DW_TAG_member
    7137                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$58)
    7138                      .dwattr $C$DW$751, DW_AT_name("svgen")
    7139                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_svgen")
    7140                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7141                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7142              $C$DW$752       .dwtag  DW_TAG_member
    7143                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$60)
    7144                      .dwattr $C$DW$752, DW_AT_name("trajHandle_Id")
    7145                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_trajHandle_Id")
    7146                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7147                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7148              $C$DW$753       .dwtag  DW_TAG_member
    7149                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$61)
    7150                      .dwattr $C$DW$753, DW_AT_name("traj_Id")
    7151                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_traj_Id")
    7152                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7153                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7154              $C$DW$754       .dwtag  DW_TAG_member
    7155                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$60)
    7156                      .dwattr $C$DW$754, DW_AT_name("trajHandle_spd")
    7157                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_trajHandle_spd")
    7158                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7159                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7160              $C$DW$755       .dwtag  DW_TAG_member
    7161                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$61)
    7162                      .dwattr $C$DW$755, DW_AT_name("traj_spd")
    7163                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_traj_spd")
    7164                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7165                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7166              $C$DW$756       .dwtag  DW_TAG_member
    7167                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$60)
    7168                      .dwattr $C$DW$756, DW_AT_name("trajHandle_spdMax")
    7169                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7170                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7171                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7172              $C$DW$757       .dwtag  DW_TAG_member
    7173                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$61)
    7174                      .dwattr $C$DW$757, DW_AT_name("traj_spdMax")
    7175                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_traj_spdMax")
    7176                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7177                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7178              $C$DW$758       .dwtag  DW_TAG_member
    7179                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$62)
    7180                      .dwattr $C$DW$758, DW_AT_name("motorParams")
    7181                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_motorParams")
    7182                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  138

    7183                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7184              $C$DW$759       .dwtag  DW_TAG_member
    7185                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$65)
    7186                      .dwattr $C$DW$759, DW_AT_name("waitTimes")
    7187                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_waitTimes")
    7188                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7189                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7190              $C$DW$760       .dwtag  DW_TAG_member
    7191                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$64)
    7192                      .dwattr $C$DW$760, DW_AT_name("counter_state")
    7193                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_counter_state")
    7194                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7195                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7196              $C$DW$761       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$66)
    7198                      .dwattr $C$DW$761, DW_AT_name("numIsrTicksPerCtrlTick")
    7199                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7200                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7201                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7202              $C$DW$762       .dwtag  DW_TAG_member
    7203                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$66)
    7204                      .dwattr $C$DW$762, DW_AT_name("numCtrlTicksPerCurrentTick")
    7205                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7206                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7207                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7208              $C$DW$763       .dwtag  DW_TAG_member
    7209                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$66)
    7210                      .dwattr $C$DW$763, DW_AT_name("numCtrlTicksPerSpeedTick")
    7211                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7212                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7213                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7214              $C$DW$764       .dwtag  DW_TAG_member
    7215                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$66)
    7216                      .dwattr $C$DW$764, DW_AT_name("numCtrlTicksPerTrajTick")
    7217                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7218                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7219                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7220              $C$DW$765       .dwtag  DW_TAG_member
    7221                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$64)
    7222                      .dwattr $C$DW$765, DW_AT_name("ctrlFreq_Hz")
    7223                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7224                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7225                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7226              $C$DW$766       .dwtag  DW_TAG_member
    7227                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$64)
    7228                      .dwattr $C$DW$766, DW_AT_name("trajFreq_Hz")
    7229                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7230                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7231                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7232              $C$DW$767       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$31)
    7234                      .dwattr $C$DW$767, DW_AT_name("trajPeriod_sec")
    7235                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7236                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7237                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  139

    7238              $C$DW$768       .dwtag  DW_TAG_member
    7239                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$67)
    7240                      .dwattr $C$DW$768, DW_AT_name("ctrlPeriod_sec")
    7241                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7242                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7243                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7244              $C$DW$769       .dwtag  DW_TAG_member
    7245                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$31)
    7246                      .dwattr $C$DW$769, DW_AT_name("maxVsMag_pu")
    7247                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7248                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7249                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7250              $C$DW$770       .dwtag  DW_TAG_member
    7251                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$68)
    7252                      .dwattr $C$DW$770, DW_AT_name("Iab_in")
    7253                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Iab_in")
    7254                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7255                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7256              $C$DW$771       .dwtag  DW_TAG_member
    7257                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$68)
    7258                      .dwattr $C$DW$771, DW_AT_name("Iab_filt")
    7259                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Iab_filt")
    7260                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7261                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7262              $C$DW$772       .dwtag  DW_TAG_member
    7263                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$68)
    7264                      .dwattr $C$DW$772, DW_AT_name("Idq_in")
    7265                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Idq_in")
    7266                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7267                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7268              $C$DW$773       .dwtag  DW_TAG_member
    7269                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$68)
    7270                      .dwattr $C$DW$773, DW_AT_name("Vab_in")
    7271                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Vab_in")
    7272                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7273                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7274              $C$DW$774       .dwtag  DW_TAG_member
    7275                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    7276                      .dwattr $C$DW$774, DW_AT_name("spd_out")
    7277                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_spd_out")
    7278                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7279                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7280              $C$DW$775       .dwtag  DW_TAG_member
    7281                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$68)
    7282                      .dwattr $C$DW$775, DW_AT_name("Vab_out")
    7283                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Vab_out")
    7284                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7285                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7286              $C$DW$776       .dwtag  DW_TAG_member
    7287                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$68)
    7288                      .dwattr $C$DW$776, DW_AT_name("Vdq_out")
    7289                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Vdq_out")
    7290                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7291                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7292              $C$DW$777       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  140

    7293                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$67)
    7294                      .dwattr $C$DW$777, DW_AT_name("Rhf")
    7295                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Rhf")
    7296                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7297                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7298              $C$DW$778       .dwtag  DW_TAG_member
    7299                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$67)
    7300                      .dwattr $C$DW$778, DW_AT_name("Lhf")
    7301                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Lhf")
    7302                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7303                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7304              $C$DW$779       .dwtag  DW_TAG_member
    7305                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$67)
    7306                      .dwattr $C$DW$779, DW_AT_name("RoverL")
    7307                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_RoverL")
    7308                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7309                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7310              $C$DW$780       .dwtag  DW_TAG_member
    7311                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    7312                      .dwattr $C$DW$780, DW_AT_name("Kp_Id")
    7313                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Kp_Id")
    7314                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7315                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7316              $C$DW$781       .dwtag  DW_TAG_member
    7317                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    7318                      .dwattr $C$DW$781, DW_AT_name("Kp_Iq")
    7319                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kp_Iq")
    7320                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7321                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7322              $C$DW$782       .dwtag  DW_TAG_member
    7323                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    7324                      .dwattr $C$DW$782, DW_AT_name("Kp_spd")
    7325                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Kp_spd")
    7326                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7327                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7328              $C$DW$783       .dwtag  DW_TAG_member
    7329                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    7330                      .dwattr $C$DW$783, DW_AT_name("Ki_Id")
    7331                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Ki_Id")
    7332                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7333                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7334              $C$DW$784       .dwtag  DW_TAG_member
    7335                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    7336                      .dwattr $C$DW$784, DW_AT_name("Ki_Iq")
    7337                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ki_Iq")
    7338                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7339                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7340              $C$DW$785       .dwtag  DW_TAG_member
    7341                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$31)
    7342                      .dwattr $C$DW$785, DW_AT_name("Ki_spd")
    7343                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Ki_spd")
    7344                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7345                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7346              $C$DW$786       .dwtag  DW_TAG_member
    7347                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  141

    7348                      .dwattr $C$DW$786, DW_AT_name("Kd_Id")
    7349                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Kd_Id")
    7350                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7351                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7352              $C$DW$787       .dwtag  DW_TAG_member
    7353                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    7354                      .dwattr $C$DW$787, DW_AT_name("Kd_Iq")
    7355                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Kd_Iq")
    7356                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7357                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7358              $C$DW$788       .dwtag  DW_TAG_member
    7359                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$31)
    7360                      .dwattr $C$DW$788, DW_AT_name("Kd_spd")
    7361                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Kd_spd")
    7362                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7363                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7364              $C$DW$789       .dwtag  DW_TAG_member
    7365                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$31)
    7366                      .dwattr $C$DW$789, DW_AT_name("Ui_Id")
    7367                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Ui_Id")
    7368                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7369                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7370              $C$DW$790       .dwtag  DW_TAG_member
    7371                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$31)
    7372                      .dwattr $C$DW$790, DW_AT_name("Ui_Iq")
    7373                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ui_Iq")
    7374                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7375                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7376              $C$DW$791       .dwtag  DW_TAG_member
    7377                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$31)
    7378                      .dwattr $C$DW$791, DW_AT_name("Ui_spd")
    7379                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ui_spd")
    7380                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7381                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7382              $C$DW$792       .dwtag  DW_TAG_member
    7383                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$68)
    7384                      .dwattr $C$DW$792, DW_AT_name("Idq_ref")
    7385                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Idq_ref")
    7386                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7387                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7388              $C$DW$793       .dwtag  DW_TAG_member
    7389                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$31)
    7390                      .dwattr $C$DW$793, DW_AT_name("IdRated")
    7391                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_IdRated")
    7392                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7393                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7394              $C$DW$794       .dwtag  DW_TAG_member
    7395                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$31)
    7396                      .dwattr $C$DW$794, DW_AT_name("spd_ref")
    7397                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_spd_ref")
    7398                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7399                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7400              $C$DW$795       .dwtag  DW_TAG_member
    7401                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$31)
    7402                      .dwattr $C$DW$795, DW_AT_name("spd_max")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  142

    7403                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_spd_max")
    7404                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7405                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7406              $C$DW$796       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$66)
    7408                      .dwattr $C$DW$796, DW_AT_name("counter_current")
    7409                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_counter_current")
    7410                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7411                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7412              $C$DW$797       .dwtag  DW_TAG_member
    7413                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$66)
    7414                      .dwattr $C$DW$797, DW_AT_name("counter_isr")
    7415                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_counter_isr")
    7416                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7417                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7418              $C$DW$798       .dwtag  DW_TAG_member
    7419                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$66)
    7420                      .dwattr $C$DW$798, DW_AT_name("counter_speed")
    7421                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_counter_speed")
    7422                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7423                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7424              $C$DW$799       .dwtag  DW_TAG_member
    7425                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$66)
    7426                      .dwattr $C$DW$799, DW_AT_name("counter_traj")
    7427                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_counter_traj")
    7428                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7429                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7430              $C$DW$800       .dwtag  DW_TAG_member
    7431                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$69)
    7432                      .dwattr $C$DW$800, DW_AT_name("flag_enableCtrl")
    7433                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7434                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7435                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7436              $C$DW$801       .dwtag  DW_TAG_member
    7437                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$69)
    7438                      .dwattr $C$DW$801, DW_AT_name("flag_enableDcBusComp")
    7439                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7440                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7441                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7442              $C$DW$802       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$69)
    7444                      .dwattr $C$DW$802, DW_AT_name("flag_enablePowerWarp")
    7445                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7446                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7447                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7448              $C$DW$803       .dwtag  DW_TAG_member
    7449                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$69)
    7450                      .dwattr $C$DW$803, DW_AT_name("flag_enableOffset")
    7451                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_flag_enableOffset")
    7452                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7453                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7454              $C$DW$804       .dwtag  DW_TAG_member
    7455                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$69)
    7456                      .dwattr $C$DW$804, DW_AT_name("flag_enableSpeedCtrl")
    7457                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  143

    7458                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7459                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7460              $C$DW$805       .dwtag  DW_TAG_member
    7461                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$69)
    7462                      .dwattr $C$DW$805, DW_AT_name("flag_enableUserMotorParams")
    7463                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7464                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7465                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7466              $C$DW$806       .dwtag  DW_TAG_member
    7467                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$68)
    7468                      .dwattr $C$DW$806, DW_AT_name("Idq_offset_pu")
    7469                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7470                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7471                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7472              $C$DW$807       .dwtag  DW_TAG_member
    7473                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$68)
    7474                      .dwattr $C$DW$807, DW_AT_name("Vdq_offset_pu")
    7475                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7476                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7477                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7478              $C$DW$808       .dwtag  DW_TAG_member
    7479                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$31)
    7480                      .dwattr $C$DW$808, DW_AT_name("angle_pu")
    7481                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_angle_pu")
    7482                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7483                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7484              $C$DW$809       .dwtag  DW_TAG_member
    7485                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$31)
    7486                      .dwattr $C$DW$809, DW_AT_name("speed_ref_pu")
    7487                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_speed_ref_pu")
    7488                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7489                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7490              $C$DW$810       .dwtag  DW_TAG_member
    7491                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$31)
    7492                      .dwattr $C$DW$810, DW_AT_name("speed_fb_pu")
    7493                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_speed_fb_pu")
    7494                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7495                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7496              $C$DW$811       .dwtag  DW_TAG_member
    7497                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$31)
    7498                      .dwattr $C$DW$811, DW_AT_name("speed_outMax_pu")
    7499                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7500                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7501                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7502              $C$DW$812       .dwtag  DW_TAG_member
    7503                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$69)
    7504                      .dwattr $C$DW$812, DW_AT_name("flag_enableCurrentCtrl")
    7505                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7506                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7507                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7508                      .dwendtag $C$DW$T$70
    7509              
    7510              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7511                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$70)
    7512                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  144

    7513              $C$DW$T$167     .dwtag  DW_TAG_pointer_type
    7514                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
    7515                      .dwattr $C$DW$T$167, DW_AT_address_class(0x16)
    7516              $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7517                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
    7518                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    7519              $C$DW$813       .dwtag  DW_TAG_TI_far_type
    7520                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$168)
    7521              $C$DW$T$182     .dwtag  DW_TAG_const_type
    7522                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$813)
    7523              
    7524              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7525                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    7526                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    7527              $C$DW$814       .dwtag  DW_TAG_member
    7528                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$22)
    7529                      .dwattr $C$DW$814, DW_AT_name("rsvd")
    7530                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_rsvd")
    7531                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7532                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7533              $C$DW$815       .dwtag  DW_TAG_member
    7534                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$72)
    7535                      .dwattr $C$DW$815, DW_AT_name("targetProc")
    7536                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_targetProc")
    7537                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7538                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7539              $C$DW$816       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$22)
    7541                      .dwattr $C$DW$816, DW_AT_name("major")
    7542                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_major")
    7543                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7544                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7545              $C$DW$817       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$22)
    7547                      .dwattr $C$DW$817, DW_AT_name("minor")
    7548                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_minor")
    7549                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7550                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7551                      .dwendtag $C$DW$T$73
    7552              
    7553              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7554                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    7555                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    7556              
    7557              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7558                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    7559                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    7560              $C$DW$818       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$75)
    7562                      .dwattr $C$DW$818, DW_AT_name("spiHandle")
    7563                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_spiHandle")
    7564                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7565                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7566              $C$DW$819       .dwtag  DW_TAG_member
    7567                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$77)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  145

    7568                      .dwattr $C$DW$819, DW_AT_name("gpioHandle")
    7569                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_gpioHandle")
    7570                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7571                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7572              $C$DW$820       .dwtag  DW_TAG_member
    7573                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$79)
    7574                      .dwattr $C$DW$820, DW_AT_name("gpioNumber")
    7575                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_gpioNumber")
    7576                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7577                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7578              $C$DW$821       .dwtag  DW_TAG_member
    7579                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$69)
    7580                      .dwattr $C$DW$821, DW_AT_name("RxTimeOut")
    7581                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_RxTimeOut")
    7582                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7583                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7584              $C$DW$822       .dwtag  DW_TAG_member
    7585                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$69)
    7586                      .dwattr $C$DW$822, DW_AT_name("enableTimeOut")
    7587                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_enableTimeOut")
    7588                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7589                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7590                      .dwendtag $C$DW$T$80
    7591              
    7592              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    7593                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$80)
    7594                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    7595              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    7596                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$80)
    7597                      .dwattr $C$DW$T$120, DW_AT_address_class(0x16)
    7598              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    7599                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    7600                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    7601              
    7602              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7603                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7604                      .dwattr $C$DW$T$19, DW_AT_declaration
    7605                      .dwendtag $C$DW$T$19
    7606              
    7607              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    7608                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    7609                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    7610              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7611                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    7612                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    7613              
    7614              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    7615                      .dwattr $C$DW$T$81, DW_AT_name("_FILTER_FO_")
    7616                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    7617              $C$DW$823       .dwtag  DW_TAG_member
    7618                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$31)
    7619                      .dwattr $C$DW$823, DW_AT_name("a1")
    7620                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_a1")
    7621                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7622                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  146

    7623              $C$DW$824       .dwtag  DW_TAG_member
    7624                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$31)
    7625                      .dwattr $C$DW$824, DW_AT_name("b0")
    7626                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_b0")
    7627                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7628                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7629              $C$DW$825       .dwtag  DW_TAG_member
    7630                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$31)
    7631                      .dwattr $C$DW$825, DW_AT_name("b1")
    7632                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_b1")
    7633                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7634                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7635              $C$DW$826       .dwtag  DW_TAG_member
    7636                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$31)
    7637                      .dwattr $C$DW$826, DW_AT_name("x1")
    7638                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_x1")
    7639                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7640                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7641              $C$DW$827       .dwtag  DW_TAG_member
    7642                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$31)
    7643                      .dwattr $C$DW$827, DW_AT_name("y1")
    7644                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_y1")
    7645                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7646                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7647                      .dwendtag $C$DW$T$81
    7648              
    7649              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7650                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$81)
    7651                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    7652              $C$DW$T$184     .dwtag  DW_TAG_pointer_type
    7653                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$133)
    7654                      .dwattr $C$DW$T$184, DW_AT_address_class(0x16)
    7655              
    7656              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7657                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    7658                      .dwattr $C$DW$T$20, DW_AT_declaration
    7659                      .dwendtag $C$DW$T$20
    7660              
    7661              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    7662                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$20)
    7663                      .dwattr $C$DW$T$134, DW_AT_address_class(0x16)
    7664              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7665                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    7666                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    7667              
    7668              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    7669                      .dwattr $C$DW$T$82, DW_AT_name("_FLASH_Obj_")
    7670                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    7671              $C$DW$828       .dwtag  DW_TAG_member
    7672                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$23)
    7673                      .dwattr $C$DW$828, DW_AT_name("FOPT")
    7674                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FOPT")
    7675                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7676                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7677              $C$DW$829       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  147

    7678                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$23)
    7679                      .dwattr $C$DW$829, DW_AT_name("rsvd_1")
    7680                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_rsvd_1")
    7681                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7682                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7683              $C$DW$830       .dwtag  DW_TAG_member
    7684                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$23)
    7685                      .dwattr $C$DW$830, DW_AT_name("FPWR")
    7686                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_FPWR")
    7687                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7688                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7689              $C$DW$831       .dwtag  DW_TAG_member
    7690                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$23)
    7691                      .dwattr $C$DW$831, DW_AT_name("FSTATUS")
    7692                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_FSTATUS")
    7693                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7694                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7695              $C$DW$832       .dwtag  DW_TAG_member
    7696                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$23)
    7697                      .dwattr $C$DW$832, DW_AT_name("FSTDBYWAIT")
    7698                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7699                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7700                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7701              $C$DW$833       .dwtag  DW_TAG_member
    7702                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$23)
    7703                      .dwattr $C$DW$833, DW_AT_name("FACTIVEWAIT")
    7704                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7705                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7706                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7707              $C$DW$834       .dwtag  DW_TAG_member
    7708                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$23)
    7709                      .dwattr $C$DW$834, DW_AT_name("FBANKWAIT")
    7710                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_FBANKWAIT")
    7711                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7712                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    7713              $C$DW$835       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$23)
    7715                      .dwattr $C$DW$835, DW_AT_name("FOTPWAIT")
    7716                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_FOTPWAIT")
    7717                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7718                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7719                      .dwendtag $C$DW$T$82
    7720              
    7721              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    7722                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$82)
    7723                      .dwattr $C$DW$T$95, DW_AT_address_class(0x16)
    7724              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7725                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    7726                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    7727              
    7728              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    7729                      .dwattr $C$DW$T$86, DW_AT_name("_GPIO_Obj_")
    7730                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x6a)
    7731              $C$DW$836       .dwtag  DW_TAG_member
    7732                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$83)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  148

    7733                      .dwattr $C$DW$836, DW_AT_name("GPACTRL")
    7734                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_GPACTRL")
    7735                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7736                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7737              $C$DW$837       .dwtag  DW_TAG_member
    7738                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$83)
    7739                      .dwattr $C$DW$837, DW_AT_name("GPAQSEL1")
    7740                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_GPAQSEL1")
    7741                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7742                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    7743              $C$DW$838       .dwtag  DW_TAG_member
    7744                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$83)
    7745                      .dwattr $C$DW$838, DW_AT_name("GPAQSEL2")
    7746                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_GPAQSEL2")
    7747                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7748                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7749              $C$DW$839       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$83)
    7751                      .dwattr $C$DW$839, DW_AT_name("GPAMUX1")
    7752                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_GPAMUX1")
    7753                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7754                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7755              $C$DW$840       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$83)
    7757                      .dwattr $C$DW$840, DW_AT_name("GPAMUX2")
    7758                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_GPAMUX2")
    7759                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7760                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7761              $C$DW$841       .dwtag  DW_TAG_member
    7762                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$83)
    7763                      .dwattr $C$DW$841, DW_AT_name("GPADIR")
    7764                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_GPADIR")
    7765                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7766                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7767              $C$DW$842       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$83)
    7769                      .dwattr $C$DW$842, DW_AT_name("GPAPUD")
    7770                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_GPAPUD")
    7771                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7772                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7773              $C$DW$843       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$26)
    7775                      .dwattr $C$DW$843, DW_AT_name("rsvd_1")
    7776                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_rsvd_1")
    7777                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7778                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7779              $C$DW$844       .dwtag  DW_TAG_member
    7780                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$83)
    7781                      .dwattr $C$DW$844, DW_AT_name("GPBCTRL")
    7782                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_GPBCTRL")
    7783                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7784                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7785              $C$DW$845       .dwtag  DW_TAG_member
    7786                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$83)
    7787                      .dwattr $C$DW$845, DW_AT_name("GPBQSEL1")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:44 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0704010                         PAGE  149

    7788                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_GPBQSEL1")
    7789                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7790                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7791              $C$DW$846       .dwtag  DW_TAG_member
    7792                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$26)
    7793                      .dwattr $C$DW$846, DW_AT_name("rsvd_2")
    7794                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_rsvd_2")
    7795                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7796                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7797              $C$DW$847       .dwtag  DW_TAG_member
    7798                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$83)
    7799                      .dwattr $C$DW$847, DW_AT_name("GPBMUX1")
    7800                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_GPBMUX1")
    7801                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7802                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7803              $C$DW$848       .dwtag  DW_TAG_member
    7804                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$26)
    7805                      .dwattr $C$DW$848, DW_AT_name("rsvd_3")
    7806                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_rsvd_3")
    7807                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7808                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7809              $C$DW$849       .dwtag  DW_TAG_member
    7810                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$83)
    7811                      .dwattr $C$DW$849, DW_AT_name("GPBDIR")
    7812                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_GPBDIR")
    7813                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7814                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    7815              $C$DW$850       .dwtag  DW_TAG_member
    7816                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$83)
    7817                      .dwattr $C$DW$850, DW_AT_name("GPBPUD")
    7818                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_GPBPUD")
