TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0269210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Thu Jun 25 17:41:28 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/drivers/flash/src/32b/f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.2.3\bin\opt2000.exe C:\\Users\\a0220341\\AppData\\Local\\Te

    1044              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_1"), DW_AT_const_value(0x01)
    1045              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_2"), DW_AT_const_value(0x02)
    1046              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_3"), DW_AT_const_value(0x03)
    1047              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_4"), DW_AT_const_value(0x04)
    1048              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_5"), DW_AT_const_value(0x05)
    1049              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_6"), DW_AT_const_value(0x06)
    1050              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_7"), DW_AT_const_value(0x07)
    1051              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_8"), DW_AT_const_value(0x08)
    1052              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_9"), DW_AT_const_value(0x09)
    1053              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_10"), DW_AT_const_value(0x0a
    1054              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_11"), DW_AT_const_value(0x0b
    1055              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_12"), DW_AT_const_value(0x0c
    1056              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_13"), DW_AT_const_value(0x0d
    1057              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_14"), DW_AT_const_value(0x0e
    1058              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_15"), DW_AT_const_value(0x0f
    1059                      .dwendtag $C$DW$T$40
    1060              
    1061              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_NumRandomWaitStates_e")
    1062                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1063                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1064              $C$DW$125       .dwtag  DW_TAG_TI_far_type
    1065                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$41)
    1066              $C$DW$T$42      .dwtag  DW_TAG_const_type
    1067                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$125)
    1068              
    1069              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1070                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1071              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_1"), DW_AT_const_value(0x01)
    1072              $C$DW$127       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_2"), DW_AT_const_value(0x02)
    1073              $C$DW$128       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_3"), DW_AT_const_value(0x03)
    1074              $C$DW$129       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_4"), DW_AT_const_value(0x04)
    1075              $C$DW$130       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_5"), DW_AT_const_value(0x05)
    1076              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_6"), DW_AT_const_value(0x06)
    1077              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_7"), DW_AT_const_value(0x07)
    1078              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_8"), DW_AT_const_value(0x08)
    1079              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_9"), DW_AT_const_value(0x09)
    1080              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_10"), DW_AT_const_value(0x0a)
    1081              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_11"), DW_AT_const_value(0x0b)
    1082              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_12"), DW_AT_const_value(0x0c)
    1083              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_13"), DW_AT_const_value(0x0d)
    1084              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_14"), DW_AT_const_value(0x0e)
    1085              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_15"), DW_AT_const_value(0x0f)
    1086                      .dwendtag $C$DW$T$43
    1087              
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0269210                         PAGE   21

    1088              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_NumOtpWaitStates_e")
    1089                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1090                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1091              $C$DW$141       .dwtag  DW_TAG_TI_far_type
    1092                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$44)
    1093              $C$DW$T$45      .dwtag  DW_TAG_const_type
    1094                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$141)
    1095              
    1096              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1097                      .dwattr $C$DW$T$21, DW_AT_name("_FLASH_Obj_")
    1098                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    1099              $C$DW$142       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1101                      .dwattr $C$DW$142, DW_AT_name("FOPT")
    1102                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_FOPT")
    1103                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$143       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1107                      .dwattr $C$DW$143, DW_AT_name("rsvd_1")
    1108                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd_1")
    1109                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1110                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$144       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1113                      .dwattr $C$DW$144, DW_AT_name("FPWR")
    1114                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_FPWR")
    1115                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1116                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$145       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1119                      .dwattr $C$DW$145, DW_AT_name("FSTATUS")
    1120                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_FSTATUS")
    1121                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1122                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$146       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1125                      .dwattr $C$DW$146, DW_AT_name("FSTDBYWAIT")
    1126                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1127                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1128                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$147       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    1131                      .dwattr $C$DW$147, DW_AT_name("FACTIVEWAIT")
    1132                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1133                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1134                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$148       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1137                      .dwattr $C$DW$148, DW_AT_name("FBANKWAIT")
    1138                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_FBANKWAIT")
    1139                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1140                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$149       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0269210                         PAGE   22

    1143                      .dwattr $C$DW$149, DW_AT_name("FOTPWAIT")
    1144                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_FOTPWAIT")
    1145                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1146                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1147                      .dwendtag $C$DW$T$21
    1148              
    1149              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Obj")
    1150                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$21)
    1151                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1152              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    1153                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    1154                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
    1155              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    1156                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1157                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1158              $C$DW$150       .dwtag  DW_TAG_TI_far_type
    1159                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$25)
    1160              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1161                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$150)
    1162              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1163                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1164              $C$DW$151       .dwtag  DW_TAG_TI_far_type
    1165                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$3)
    1166              $C$DW$T$53      .dwtag  DW_TAG_const_type
    1167                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$151)
    1168              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1169                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1170                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1171                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1172              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1173                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1174                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1175                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1176              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1177                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1178                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1179                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1180              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1181                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1182                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1183                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1184              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1185                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1186                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1187                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1188              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1189                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1190                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1191                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1192              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1193                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1194                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1195              $C$DW$152       .dwtag  DW_TAG_TI_far_type
    1196                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1197              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
