TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Fri Jun 26 10:57:48 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/hal/boards/boos
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_reset")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_reset")

    9253                      .dwattr $C$DW$T$312, DW_AT_byte_size(0x01)
    9254              $C$DW$1668      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
    9255              $C$DW$1669      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
    9256                      .dwendtag $C$DW$T$312
    9257              
    9258              $C$DW$T$313     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
    9259                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$312)
    9260                      .dwattr $C$DW$T$313, DW_AT_language(DW_LANG_C)
    9261              $C$DW$1670      .dwtag  DW_TAG_TI_far_type
    9262                      .dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$313)
    9263              $C$DW$T$314     .dwtag  DW_TAG_const_type
    9264                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$1670)
    9265              
    9266              $C$DW$T$315     .dwtag  DW_TAG_enumeration_type
    9267                      .dwattr $C$DW$T$315, DW_AT_byte_size(0x01)
    9268              $C$DW$1671      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
    9269              $C$DW$1672      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
    9270                      .dwendtag $C$DW$T$315
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  178

    9271              
    9272              $C$DW$T$316     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
    9273                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$T$315)
    9274                      .dwattr $C$DW$T$316, DW_AT_language(DW_LANG_C)
    9275              $C$DW$1673      .dwtag  DW_TAG_TI_far_type
    9276                      .dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$316)
    9277              $C$DW$T$317     .dwtag  DW_TAG_const_type
    9278                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$1673)
    9279              
    9280              $C$DW$T$318     .dwtag  DW_TAG_enumeration_type
    9281                      .dwattr $C$DW$T$318, DW_AT_byte_size(0x01)
    9282              $C$DW$1674      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    9283              $C$DW$1675      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    9284              $C$DW$1676      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    9285                      .dwendtag $C$DW$T$318
    9286              
    9287              $C$DW$T$319     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    9288                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$318)
    9289                      .dwattr $C$DW$T$319, DW_AT_language(DW_LANG_C)
    9290              $C$DW$1677      .dwtag  DW_TAG_TI_far_type
    9291                      .dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$319)
    9292              $C$DW$T$320     .dwtag  DW_TAG_const_type
    9293                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$1677)
    9294              
    9295              $C$DW$T$321     .dwtag  DW_TAG_enumeration_type
    9296                      .dwattr $C$DW$T$321, DW_AT_byte_size(0x01)
    9297              $C$DW$1678      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
    9298              $C$DW$1679      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
    9299              $C$DW$1680      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
    9300                      .dwendtag $C$DW$T$321
    9301              
    9302              $C$DW$T$322     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
    9303                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
    9304                      .dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
    9305              $C$DW$1681      .dwtag  DW_TAG_TI_far_type
    9306                      .dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$322)
    9307              $C$DW$T$323     .dwtag  DW_TAG_const_type
    9308                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$1681)
    9309              
    9310              $C$DW$T$324     .dwtag  DW_TAG_enumeration_type
    9311                      .dwattr $C$DW$T$324, DW_AT_byte_size(0x01)
    9312              $C$DW$1682      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9313              $C$DW$1683      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9314                      .dwendtag $C$DW$T$324
    9315              
    9316              $C$DW$T$325     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9317                      .dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$324)
    9318                      .dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
    9319              
    9320              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    9321                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    9322                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    9323              $C$DW$1684      .dwtag  DW_TAG_member
    9324                      .dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$23)
    9325                      .dwattr $C$DW$1684, DW_AT_name("ADCRESULT")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  179

    9326                      .dwattr $C$DW$1684, DW_AT_TI_symbol_name("_ADCRESULT")
    9327                      .dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9328                      .dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
    9329              $C$DW$1685      .dwtag  DW_TAG_member
    9330                      .dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$24)
    9331                      .dwattr $C$DW$1685, DW_AT_name("resvd_1")
    9332                      .dwattr $C$DW$1685, DW_AT_TI_symbol_name("_resvd_1")
    9333                      .dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9334                      .dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
    9335              $C$DW$1686      .dwtag  DW_TAG_member
    9336                      .dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$22)
    9337                      .dwattr $C$DW$1686, DW_AT_name("ADCCTL1")
    9338                      .dwattr $C$DW$1686, DW_AT_TI_symbol_name("_ADCCTL1")
    9339                      .dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9340                      .dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
    9341              $C$DW$1687      .dwtag  DW_TAG_member
    9342                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$22)
    9343                      .dwattr $C$DW$1687, DW_AT_name("ADCCTL2")
    9344                      .dwattr $C$DW$1687, DW_AT_TI_symbol_name("_ADCCTL2")
    9345                      .dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9346                      .dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
    9347              $C$DW$1688      .dwtag  DW_TAG_member
    9348                      .dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$25)
    9349                      .dwattr $C$DW$1688, DW_AT_name("rsvd_2")
    9350                      .dwattr $C$DW$1688, DW_AT_TI_symbol_name("_rsvd_2")
    9351                      .dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9352                      .dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
    9353              $C$DW$1689      .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$22)
    9355                      .dwattr $C$DW$1689, DW_AT_name("ADCINTFLG")
    9356                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_ADCINTFLG")
    9357                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9358                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
    9359              $C$DW$1690      .dwtag  DW_TAG_member
    9360                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$22)
    9361                      .dwattr $C$DW$1690, DW_AT_name("ADCINTFLGCLR")
    9362                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9363                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9364                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
    9365              $C$DW$1691      .dwtag  DW_TAG_member
    9366                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$22)
    9367                      .dwattr $C$DW$1691, DW_AT_name("ADCINTOVF")
    9368                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_ADCINTOVF")
    9369                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9370                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
    9371              $C$DW$1692      .dwtag  DW_TAG_member
    9372                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$22)
    9373                      .dwattr $C$DW$1692, DW_AT_name("ADCINTOVFCLR")
    9374                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9375                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9376                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
    9377              $C$DW$1693      .dwtag  DW_TAG_member
    9378                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$26)
    9379                      .dwattr $C$DW$1693, DW_AT_name("INTSELxNy")
    9380                      .dwattr $C$DW$1693, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  180

    9381                      .dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9382                      .dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
    9383              $C$DW$1694      .dwtag  DW_TAG_member
    9384                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$27)
    9385                      .dwattr $C$DW$1694, DW_AT_name("rsvd_3")
    9386                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_rsvd_3")
    9387                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9388                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
    9389              $C$DW$1695      .dwtag  DW_TAG_member
    9390                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$22)
    9391                      .dwattr $C$DW$1695, DW_AT_name("SOCPRICTRL")
    9392                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9393                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9394                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
    9395              $C$DW$1696      .dwtag  DW_TAG_member
    9396                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$22)
    9397                      .dwattr $C$DW$1696, DW_AT_name("rsvd_4")
    9398                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_rsvd_4")
    9399                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9400                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
    9401              $C$DW$1697      .dwtag  DW_TAG_member
    9402                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$22)
    9403                      .dwattr $C$DW$1697, DW_AT_name("ADCSAMPLEMODE")
    9404                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9405                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9406                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
    9407              $C$DW$1698      .dwtag  DW_TAG_member
    9408                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$22)
    9409                      .dwattr $C$DW$1698, DW_AT_name("rsvd_5")
    9410                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_rsvd_5")
    9411                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9412                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
    9413              $C$DW$1699      .dwtag  DW_TAG_member
    9414                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$22)
    9415                      .dwattr $C$DW$1699, DW_AT_name("ADCINTSOCSEL1")
    9416                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9417                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9418                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
    9419              $C$DW$1700      .dwtag  DW_TAG_member
    9420                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$22)
    9421                      .dwattr $C$DW$1700, DW_AT_name("ADCINTSOCSEL2")
    9422                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9423                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9424                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
    9425              $C$DW$1701      .dwtag  DW_TAG_member
    9426                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$25)
    9427                      .dwattr $C$DW$1701, DW_AT_name("rsvd_6")
    9428                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_rsvd_6")
    9429                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9430                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
    9431              $C$DW$1702      .dwtag  DW_TAG_member
    9432                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$22)
    9433                      .dwattr $C$DW$1702, DW_AT_name("ADCSOCFLG1")
    9434                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9435                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  181

    9436                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
    9437              $C$DW$1703      .dwtag  DW_TAG_member
    9438                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$22)
    9439                      .dwattr $C$DW$1703, DW_AT_name("rsvd_7")
    9440                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_rsvd_7")
    9441                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9442                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
    9443              $C$DW$1704      .dwtag  DW_TAG_member
    9444                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$22)
    9445                      .dwattr $C$DW$1704, DW_AT_name("ADCSOCFRC1")
    9446                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9447                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9448                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
    9449              $C$DW$1705      .dwtag  DW_TAG_member
    9450                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$22)
    9451                      .dwattr $C$DW$1705, DW_AT_name("rsvd_8")
    9452                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_rsvd_8")
    9453                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9454                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
    9455              $C$DW$1706      .dwtag  DW_TAG_member
    9456                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$22)
    9457                      .dwattr $C$DW$1706, DW_AT_name("ADCSOCOVF1")
    9458                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9459                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9460                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
    9461              $C$DW$1707      .dwtag  DW_TAG_member
    9462                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$22)
    9463                      .dwattr $C$DW$1707, DW_AT_name("rsvd_9")
    9464                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_rsvd_9")
    9465                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9466                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
    9467              $C$DW$1708      .dwtag  DW_TAG_member
    9468                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$22)
    9469                      .dwattr $C$DW$1708, DW_AT_name("ADCSOCOVFCLR1")
    9470                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9471                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9472                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
    9473              $C$DW$1709      .dwtag  DW_TAG_member
    9474                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$22)
    9475                      .dwattr $C$DW$1709, DW_AT_name("rsvd_10")
    9476                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_rsvd_10")
    9477                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9478                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
    9479              $C$DW$1710      .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$23)
    9481                      .dwattr $C$DW$1710, DW_AT_name("ADCSOCxCTL")
    9482                      .dwattr $C$DW$1710, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9483                      .dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9484                      .dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
    9485              $C$DW$1711      .dwtag  DW_TAG_member
    9486                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$23)
    9487                      .dwattr $C$DW$1711, DW_AT_name("rsvd_11")
    9488                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_rsvd_11")
    9489                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9490                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  182

    9491              $C$DW$1712      .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$22)
    9493                      .dwattr $C$DW$1712, DW_AT_name("ADCREFTRIM")
    9494                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9495                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9496                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
    9497              $C$DW$1713      .dwtag  DW_TAG_member
    9498                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$22)
    9499                      .dwattr $C$DW$1713, DW_AT_name("ADCOFFTRIM")
    9500                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9501                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9502                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
    9503              $C$DW$1714      .dwtag  DW_TAG_member
    9504                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$28)
    9505                      .dwattr $C$DW$1714, DW_AT_name("resvd_12")
    9506                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_resvd_12")
    9507                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9508                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
    9509              $C$DW$1715      .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$22)
    9511                      .dwattr $C$DW$1715, DW_AT_name("ADCREV")
    9512                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_ADCREV")
    9513                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9514                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
    9515                      .dwendtag $C$DW$T$29
    9516              
    9517              $C$DW$T$327     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9518                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$29)
    9519                      .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
    9520              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9521                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
    9522                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    9523              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9524                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9525                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    9526              
    9527              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    9528                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    9529                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    9530              $C$DW$1716      .dwtag  DW_TAG_member
    9531                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$22)
    9532                      .dwattr $C$DW$1716, DW_AT_name("XCLK")
    9533                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_XCLK")
    9534                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9535                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
    9536              $C$DW$1717      .dwtag  DW_TAG_member
    9537                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$22)
    9538                      .dwattr $C$DW$1717, DW_AT_name("rsvd_1")
    9539                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_rsvd_1")
    9540                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9541                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
    9542              $C$DW$1718      .dwtag  DW_TAG_member
    9543                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$22)
    9544                      .dwattr $C$DW$1718, DW_AT_name("CLKCTL")
    9545                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_CLKCTL")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  183

    9546                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9547                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
    9548              $C$DW$1719      .dwtag  DW_TAG_member
    9549                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$30)
    9550                      .dwattr $C$DW$1719, DW_AT_name("rsvd_2")
    9551                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_rsvd_2")
    9552                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9553                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
    9554              $C$DW$1720      .dwtag  DW_TAG_member
    9555                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$22)
    9556                      .dwattr $C$DW$1720, DW_AT_name("LOSPCP")
    9557                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_LOSPCP")
    9558                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9559                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
    9560              $C$DW$1721      .dwtag  DW_TAG_member
    9561                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$22)
    9562                      .dwattr $C$DW$1721, DW_AT_name("PCLKCR0")
    9563                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_PCLKCR0")
    9564                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9565                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
    9566              $C$DW$1722      .dwtag  DW_TAG_member
    9567                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$22)
    9568                      .dwattr $C$DW$1722, DW_AT_name("PCLKCR1")
    9569                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_PCLKCR1")
    9570                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9571                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
    9572              $C$DW$1723      .dwtag  DW_TAG_member
    9573                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$25)
    9574                      .dwattr $C$DW$1723, DW_AT_name("rsvd_3")
    9575                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_rsvd_3")
    9576                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9577                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
    9578              $C$DW$1724      .dwtag  DW_TAG_member
    9579                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$22)
    9580                      .dwattr $C$DW$1724, DW_AT_name("PCLKCR3")
    9581                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_PCLKCR3")
    9582                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9583                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
    9584                      .dwendtag $C$DW$T$31
    9585              
    9586              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    9587                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
    9588                      .dwattr $C$DW$T$81, DW_AT_address_class(0x16)
    9589              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9590                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    9591                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9592              
    9593              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    9594                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    9595                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    9596              $C$DW$1725      .dwtag  DW_TAG_member
    9597                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$32)
    9598                      .dwattr $C$DW$1725, DW_AT_name("tmp")
    9599                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_tmp")
    9600                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  184

    9601                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
    9602                      .dwendtag $C$DW$T$33
    9603              
    9604              $C$DW$T$336     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    9605                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$33)
    9606                      .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
    9607              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9608                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    9609                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    9610              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9611                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    9612                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9613              
    9614              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9615                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
    9616                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    9617              $C$DW$1726      .dwtag  DW_TAG_member
    9618                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$35)
    9619                      .dwattr $C$DW$1726, DW_AT_name("spiHandle")
    9620                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_spiHandle")
    9621                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9622                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
    9623              $C$DW$1727      .dwtag  DW_TAG_member
    9624                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$37)
    9625                      .dwattr $C$DW$1727, DW_AT_name("gpioHandle")
    9626                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_gpioHandle")
    9627                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9628                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
    9629              $C$DW$1728      .dwtag  DW_TAG_member
    9630                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$39)
    9631                      .dwattr $C$DW$1728, DW_AT_name("gpioNumber")
    9632                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_gpioNumber")
    9633                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9634                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
    9635              $C$DW$1729      .dwtag  DW_TAG_member
    9636                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$40)
    9637                      .dwattr $C$DW$1729, DW_AT_name("RxTimeOut")
    9638                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_RxTimeOut")
    9639                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9640                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
    9641              $C$DW$1730      .dwtag  DW_TAG_member
    9642                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$40)
    9643                      .dwattr $C$DW$1730, DW_AT_name("enableTimeOut")
    9644                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_enableTimeOut")
    9645                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9646                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
    9647                      .dwendtag $C$DW$T$41
    9648              
    9649              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    9650                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$41)
    9651                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9652              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    9653                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$41)
    9654                      .dwattr $C$DW$T$110, DW_AT_address_class(0x16)
    9655              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  185

    9656                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    9657                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    9658              
    9659              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    9660                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9661                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
    9662              $C$DW$1731      .dwtag  DW_TAG_member
    9663                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$43)
    9664                      .dwattr $C$DW$1731, DW_AT_name("DRV8301_CURRENT")
    9665                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9666                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9667                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
    9668              $C$DW$1732      .dwtag  DW_TAG_member
    9669                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$45)
    9670                      .dwattr $C$DW$1732, DW_AT_name("DRV8301_RESET")
    9671                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9672                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9673                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
    9674              $C$DW$1733      .dwtag  DW_TAG_member
    9675                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$47)
    9676                      .dwattr $C$DW$1733, DW_AT_name("PWM_MODE")
    9677                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_PWM_MODE")
    9678                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9679                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
    9680              $C$DW$1734      .dwtag  DW_TAG_member
    9681                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$49)
    9682                      .dwattr $C$DW$1734, DW_AT_name("OC_MODE")
    9683                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_OC_MODE")
    9684                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9685                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
    9686              $C$DW$1735      .dwtag  DW_TAG_member
    9687                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$51)
    9688                      .dwattr $C$DW$1735, DW_AT_name("OC_ADJ_SET")
    9689                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9690                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9691                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
    9692                      .dwendtag $C$DW$T$52
    9693              
    9694              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9695                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
    9696                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    9697              
    9698              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    9699                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9700                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    9701              $C$DW$1736      .dwtag  DW_TAG_member
    9702                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$54)
    9703                      .dwattr $C$DW$1736, DW_AT_name("OCTW_SET")
    9704                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_OCTW_SET")
    9705                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9706                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
    9707              $C$DW$1737      .dwtag  DW_TAG_member
    9708                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$56)
    9709                      .dwattr $C$DW$1737, DW_AT_name("GAIN")
    9710                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_GAIN")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  186

    9711                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9712                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
    9713              $C$DW$1738      .dwtag  DW_TAG_member
    9714                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$58)
    9715                      .dwattr $C$DW$1738, DW_AT_name("DC_CAL_CH1p2")
    9716                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9717                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9718                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
    9719              $C$DW$1739      .dwtag  DW_TAG_member
    9720                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$60)
    9721                      .dwattr $C$DW$1739, DW_AT_name("OC_TOFF")
    9722                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_OC_TOFF")
    9723                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9724                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
    9725                      .dwendtag $C$DW$T$61
    9726              
    9727              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9728                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
    9729                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    9730              
    9731              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    9732                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9733                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
    9734              $C$DW$1740      .dwtag  DW_TAG_member
    9735                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$40)
    9736                      .dwattr $C$DW$1740, DW_AT_name("FAULT")
    9737                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_FAULT")
    9738                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9739                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
    9740              $C$DW$1741      .dwtag  DW_TAG_member
    9741                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$40)
    9742                      .dwattr $C$DW$1741, DW_AT_name("GVDD_UV")
    9743                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_GVDD_UV")
    9744                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9745                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
    9746              $C$DW$1742      .dwtag  DW_TAG_member
    9747                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$40)
    9748                      .dwattr $C$DW$1742, DW_AT_name("PVDD_UV")
    9749                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_PVDD_UV")
    9750                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9751                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
    9752              $C$DW$1743      .dwtag  DW_TAG_member
    9753                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$40)
    9754                      .dwattr $C$DW$1743, DW_AT_name("OTSD")
    9755                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_OTSD")
    9756                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9757                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
    9758              $C$DW$1744      .dwtag  DW_TAG_member
    9759                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$40)
    9760                      .dwattr $C$DW$1744, DW_AT_name("OTW")
    9761                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_OTW")
    9762                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9763                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
    9764              $C$DW$1745      .dwtag  DW_TAG_member
    9765                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  187

    9766                      .dwattr $C$DW$1745, DW_AT_name("FETHA_OC")
    9767                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_FETHA_OC")
    9768                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9769                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
    9770              $C$DW$1746      .dwtag  DW_TAG_member
    9771                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$40)
    9772                      .dwattr $C$DW$1746, DW_AT_name("FETLA_OC")
    9773                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_FETLA_OC")
    9774                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9775                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
    9776              $C$DW$1747      .dwtag  DW_TAG_member
    9777                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$40)
    9778                      .dwattr $C$DW$1747, DW_AT_name("FETHB_OC")
    9779                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_FETHB_OC")
    9780                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9781                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
    9782              $C$DW$1748      .dwtag  DW_TAG_member
    9783                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$40)
    9784                      .dwattr $C$DW$1748, DW_AT_name("FETLB_OC")
    9785                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_FETLB_OC")
    9786                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9787                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
    9788              $C$DW$1749      .dwtag  DW_TAG_member
    9789                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$40)
    9790                      .dwattr $C$DW$1749, DW_AT_name("FETHC_OC")
    9791                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_FETHC_OC")
    9792                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    9793                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
    9794              $C$DW$1750      .dwtag  DW_TAG_member
    9795                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$40)
    9796                      .dwattr $C$DW$1750, DW_AT_name("FETLC_OC")
    9797                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_FETLC_OC")
    9798                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9799                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
    9800                      .dwendtag $C$DW$T$62
    9801              
    9802              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    9803                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
    9804                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    9805              
    9806              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    9807                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    9808                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
    9809              $C$DW$1751      .dwtag  DW_TAG_member
    9810                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$40)
    9811                      .dwattr $C$DW$1751, DW_AT_name("GVDD_OV")
    9812                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_GVDD_OV")
    9813                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9814                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
    9815              $C$DW$1752      .dwtag  DW_TAG_member
    9816                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$21)
    9817                      .dwattr $C$DW$1752, DW_AT_name("DeviceID")
    9818                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_DeviceID")
    9819                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9820                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  188

    9821                      .dwendtag $C$DW$T$63
    9822              
    9823              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    9824                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    9825                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    9826              
    9827              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    9828                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    9829                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
    9830              $C$DW$1753      .dwtag  DW_TAG_member
    9831                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$64)
    9832                      .dwattr $C$DW$1753, DW_AT_name("Stat_Reg_1")
    9833                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_Stat_Reg_1")
    9834                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9835                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
    9836              $C$DW$1754      .dwtag  DW_TAG_member
    9837                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$65)
    9838                      .dwattr $C$DW$1754, DW_AT_name("Stat_Reg_2")
    9839                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_Stat_Reg_2")
    9840                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9841                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
    9842              $C$DW$1755      .dwtag  DW_TAG_member
    9843                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$66)
    9844                      .dwattr $C$DW$1755, DW_AT_name("Ctrl_Reg_1")
    9845                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    9846                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9847                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
    9848              $C$DW$1756      .dwtag  DW_TAG_member
    9849                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$67)
    9850                      .dwattr $C$DW$1756, DW_AT_name("Ctrl_Reg_2")
    9851                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    9852                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9853                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
    9854              $C$DW$1757      .dwtag  DW_TAG_member
    9855                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$40)
    9856                      .dwattr $C$DW$1757, DW_AT_name("SndCmd")
    9857                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_SndCmd")
    9858                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9859                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
    9860              $C$DW$1758      .dwtag  DW_TAG_member
    9861                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$40)
    9862                      .dwattr $C$DW$1758, DW_AT_name("RcvCmd")
    9863                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_RcvCmd")
    9864                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    9865                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
    9866                      .dwendtag $C$DW$T$68
    9867              
    9868              $C$DW$T$343     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    9869                      .dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$68)
    9870                      .dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
    9871              $C$DW$T$344     .dwtag  DW_TAG_pointer_type
    9872                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
    9873                      .dwattr $C$DW$T$344, DW_AT_address_class(0x16)
    9874              $C$DW$1759      .dwtag  DW_TAG_TI_far_type
    9875                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$344)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  189

    9876              $C$DW$T$345     .dwtag  DW_TAG_const_type
    9877                      .dwattr $C$DW$T$345, DW_AT_type(*$C$DW$1759)
    9878              
    9879              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    9880                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
    9881                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    9882              $C$DW$1760      .dwtag  DW_TAG_member
    9883                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$69)
    9884                      .dwattr $C$DW$1760, DW_AT_name("a1")
    9885                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_a1")
    9886                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9887                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
    9888              $C$DW$1761      .dwtag  DW_TAG_member
    9889                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$69)
    9890                      .dwattr $C$DW$1761, DW_AT_name("b0")
    9891                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_b0")
    9892                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9893                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
    9894              $C$DW$1762      .dwtag  DW_TAG_member
    9895                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$69)
    9896                      .dwattr $C$DW$1762, DW_AT_name("b1")
    9897                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_b1")
    9898                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9899                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
    9900              $C$DW$1763      .dwtag  DW_TAG_member
    9901                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$69)
    9902                      .dwattr $C$DW$1763, DW_AT_name("x1")
    9903                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_x1")
    9904                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9905                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
    9906              $C$DW$1764      .dwtag  DW_TAG_member
    9907                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$69)
    9908                      .dwattr $C$DW$1764, DW_AT_name("y1")
    9909                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_y1")
    9910                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9911                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
    9912                      .dwendtag $C$DW$T$70
    9913              
    9914              $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9915                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$70)
    9916                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    9917              
    9918              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9919                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    9920                      .dwattr $C$DW$T$19, DW_AT_declaration
    9921                      .dwendtag $C$DW$T$19
    9922              
    9923              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    9924                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$19)
    9925                      .dwattr $C$DW$T$117, DW_AT_address_class(0x16)
    9926              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9927                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    9928                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    9929              
    9930              $C$DW$T$71      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  190

    9931                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
    9932                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
    9933              $C$DW$1765      .dwtag  DW_TAG_member
    9934                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$22)
    9935                      .dwattr $C$DW$1765, DW_AT_name("FOPT")
    9936                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_FOPT")
    9937                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9938                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
    9939              $C$DW$1766      .dwtag  DW_TAG_member
    9940                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$22)
    9941                      .dwattr $C$DW$1766, DW_AT_name("rsvd_1")
    9942                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_rsvd_1")
    9943                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9944                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
    9945              $C$DW$1767      .dwtag  DW_TAG_member
    9946                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$22)
    9947                      .dwattr $C$DW$1767, DW_AT_name("FPWR")
    9948                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_FPWR")
    9949                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9950                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
    9951              $C$DW$1768      .dwtag  DW_TAG_member
    9952                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$22)
    9953                      .dwattr $C$DW$1768, DW_AT_name("FSTATUS")
    9954                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_FSTATUS")
    9955                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9956                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
    9957              $C$DW$1769      .dwtag  DW_TAG_member
    9958                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$22)
    9959                      .dwattr $C$DW$1769, DW_AT_name("FSTDBYWAIT")
    9960                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9961                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9962                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
    9963              $C$DW$1770      .dwtag  DW_TAG_member
    9964                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$22)
    9965                      .dwattr $C$DW$1770, DW_AT_name("FACTIVEWAIT")
    9966                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9967                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9968                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
    9969              $C$DW$1771      .dwtag  DW_TAG_member
    9970                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$22)
    9971                      .dwattr $C$DW$1771, DW_AT_name("FBANKWAIT")
    9972                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_FBANKWAIT")
    9973                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9974                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
    9975              $C$DW$1772      .dwtag  DW_TAG_member
    9976                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$22)
    9977                      .dwattr $C$DW$1772, DW_AT_name("FOTPWAIT")
    9978                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_FOTPWAIT")
    9979                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9980                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
    9981                      .dwendtag $C$DW$T$71
    9982              
    9983              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    9984                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$71)
    9985                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  191

    9986              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    9987                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9988                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    9989              
    9990              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    9991                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
    9992                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
    9993              $C$DW$1773      .dwtag  DW_TAG_member
    9994                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$73)
    9995                      .dwattr $C$DW$1773, DW_AT_name("GPACTRL")
    9996                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_GPACTRL")
    9997                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9998                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
    9999              $C$DW$1774      .dwtag  DW_TAG_member
   10000                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$73)
   10001                      .dwattr $C$DW$1774, DW_AT_name("GPAQSEL1")
   10002                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_GPAQSEL1")
   10003                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10004                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   10005              $C$DW$1775      .dwtag  DW_TAG_member
   10006                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$73)
   10007                      .dwattr $C$DW$1775, DW_AT_name("GPAQSEL2")
   10008                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_GPAQSEL2")
   10009                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10010                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   10011              $C$DW$1776      .dwtag  DW_TAG_member
   10012                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$73)
   10013                      .dwattr $C$DW$1776, DW_AT_name("GPAMUX1")
   10014                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_GPAMUX1")
   10015                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10016                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   10017              $C$DW$1777      .dwtag  DW_TAG_member
   10018                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$73)
   10019                      .dwattr $C$DW$1777, DW_AT_name("GPAMUX2")
   10020                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_GPAMUX2")
   10021                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10022                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   10023              $C$DW$1778      .dwtag  DW_TAG_member
   10024                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$73)
   10025                      .dwattr $C$DW$1778, DW_AT_name("GPADIR")
   10026                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_GPADIR")
   10027                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10028                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   10029              $C$DW$1779      .dwtag  DW_TAG_member
   10030                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$73)
   10031                      .dwattr $C$DW$1779, DW_AT_name("GPAPUD")
   10032                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_GPAPUD")
   10033                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10034                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   10035              $C$DW$1780      .dwtag  DW_TAG_member
   10036                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$25)
   10037                      .dwattr $C$DW$1780, DW_AT_name("rsvd_1")
   10038                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_rsvd_1")
   10039                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10040                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  192

   10041              $C$DW$1781      .dwtag  DW_TAG_member
   10042                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$73)
   10043                      .dwattr $C$DW$1781, DW_AT_name("GPBCTRL")
   10044                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_GPBCTRL")
   10045                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10046                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   10047              $C$DW$1782      .dwtag  DW_TAG_member
   10048                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$73)
   10049                      .dwattr $C$DW$1782, DW_AT_name("GPBQSEL1")
   10050                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_GPBQSEL1")
   10051                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10052                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   10053              $C$DW$1783      .dwtag  DW_TAG_member
   10054                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$25)
   10055                      .dwattr $C$DW$1783, DW_AT_name("rsvd_2")
   10056                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_rsvd_2")
   10057                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10058                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   10059              $C$DW$1784      .dwtag  DW_TAG_member
   10060                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$73)
   10061                      .dwattr $C$DW$1784, DW_AT_name("GPBMUX1")
   10062                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_GPBMUX1")
   10063                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10064                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   10065              $C$DW$1785      .dwtag  DW_TAG_member
   10066                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$25)
   10067                      .dwattr $C$DW$1785, DW_AT_name("rsvd_3")
   10068                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_rsvd_3")
   10069                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10070                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   10071              $C$DW$1786      .dwtag  DW_TAG_member
   10072                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$73)
   10073                      .dwattr $C$DW$1786, DW_AT_name("GPBDIR")
   10074                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_GPBDIR")
   10075                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10076                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   10077              $C$DW$1787      .dwtag  DW_TAG_member
   10078                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$73)
   10079                      .dwattr $C$DW$1787, DW_AT_name("GPBPUD")
   10080                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_GPBPUD")
   10081                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10082                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   10083              $C$DW$1788      .dwtag  DW_TAG_member
   10084                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$74)
   10085                      .dwattr $C$DW$1788, DW_AT_name("rsvd_4")
   10086                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_rsvd_4")
   10087                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10088                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   10089              $C$DW$1789      .dwtag  DW_TAG_member
   10090                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$73)
   10091                      .dwattr $C$DW$1789, DW_AT_name("AIOMUX1")
   10092                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_AIOMUX1")
   10093                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10094                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   10095              $C$DW$1790      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  193

   10096                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$25)
   10097                      .dwattr $C$DW$1790, DW_AT_name("rsvd_5")
   10098                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_rsvd_5")
   10099                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10100                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   10101              $C$DW$1791      .dwtag  DW_TAG_member
   10102                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$73)
   10103                      .dwattr $C$DW$1791, DW_AT_name("AIODIR")
   10104                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_AIODIR")
   10105                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10106                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   10107              $C$DW$1792      .dwtag  DW_TAG_member
   10108                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$75)
   10109                      .dwattr $C$DW$1792, DW_AT_name("rsvd_6")
   10110                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_rsvd_6")
   10111                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10112                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   10113              $C$DW$1793      .dwtag  DW_TAG_member
   10114                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$73)
   10115                      .dwattr $C$DW$1793, DW_AT_name("GPADAT")
   10116                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_GPADAT")
   10117                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10118                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   10119              $C$DW$1794      .dwtag  DW_TAG_member
   10120                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$73)
   10121                      .dwattr $C$DW$1794, DW_AT_name("GPASET")
   10122                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_GPASET")
   10123                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10124                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   10125              $C$DW$1795      .dwtag  DW_TAG_member
   10126                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$73)
   10127                      .dwattr $C$DW$1795, DW_AT_name("GPACLEAR")
   10128                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_GPACLEAR")
   10129                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10130                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   10131              $C$DW$1796      .dwtag  DW_TAG_member
   10132                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$73)
   10133                      .dwattr $C$DW$1796, DW_AT_name("GPATOGGLE")
   10134                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_GPATOGGLE")
   10135                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10136                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   10137              $C$DW$1797      .dwtag  DW_TAG_member
   10138                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$73)
   10139                      .dwattr $C$DW$1797, DW_AT_name("GPBDAT")
   10140                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_GPBDAT")
   10141                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10142                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   10143              $C$DW$1798      .dwtag  DW_TAG_member
   10144                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$73)
   10145                      .dwattr $C$DW$1798, DW_AT_name("GPBSET")
   10146                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_GPBSET")
   10147                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10148                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   10149              $C$DW$1799      .dwtag  DW_TAG_member
   10150                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  194

   10151                      .dwattr $C$DW$1799, DW_AT_name("GPBCLEAR")
   10152                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_GPBCLEAR")
   10153                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10154                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   10155              $C$DW$1800      .dwtag  DW_TAG_member
   10156                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$73)
   10157                      .dwattr $C$DW$1800, DW_AT_name("GPBTOGGLE")
   10158                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10159                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10160                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   10161              $C$DW$1801      .dwtag  DW_TAG_member
   10162                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$30)
   10163                      .dwattr $C$DW$1801, DW_AT_name("rsvd_7")
   10164                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_rsvd_7")
   10165                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10166                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   10167              $C$DW$1802      .dwtag  DW_TAG_member
   10168                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$73)
   10169                      .dwattr $C$DW$1802, DW_AT_name("AIODAT")
   10170                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_AIODAT")
   10171                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10172                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   10173              $C$DW$1803      .dwtag  DW_TAG_member
   10174                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$73)
   10175                      .dwattr $C$DW$1803, DW_AT_name("AIOSET")
   10176                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_AIOSET")
   10177                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10178                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   10179              $C$DW$1804      .dwtag  DW_TAG_member
   10180                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$73)
   10181                      .dwattr $C$DW$1804, DW_AT_name("AIOCLEAR")
   10182                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_AIOCLEAR")
   10183                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10184                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   10185              $C$DW$1805      .dwtag  DW_TAG_member
   10186                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$73)
   10187                      .dwattr $C$DW$1805, DW_AT_name("AIOTOGGLE")
   10188                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10189                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10190                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   10191              $C$DW$1806      .dwtag  DW_TAG_member
   10192                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$27)
   10193                      .dwattr $C$DW$1806, DW_AT_name("GPIOXINTnSEL")
   10194                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10195                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10196                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   10197              $C$DW$1807      .dwtag  DW_TAG_member
   10198                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$26)
   10199                      .dwattr $C$DW$1807, DW_AT_name("rsvd_8")
   10200                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_rsvd_8")
   10201                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10202                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   10203              $C$DW$1808      .dwtag  DW_TAG_member
   10204                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$73)
   10205                      .dwattr $C$DW$1808, DW_AT_name("GPIOLPMSEL")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  195

   10206                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10207                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10208                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   10209                      .dwendtag $C$DW$T$76
   10210              
   10211              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   10212                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
   10213                      .dwattr $C$DW$T$36, DW_AT_address_class(0x16)
   10214              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10215                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   10216                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   10217              
   10218              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   10219                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   10220                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0e)
   10221              $C$DW$1809      .dwtag  DW_TAG_member
   10222                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$77)
   10223                      .dwattr $C$DW$1809, DW_AT_name("I")
   10224                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_I")
   10225                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10226                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   10227              $C$DW$1810      .dwtag  DW_TAG_member
   10228                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$77)
   10229                      .dwattr $C$DW$1810, DW_AT_name("V")
   10230                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_V")
   10231                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10232                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   10233              $C$DW$1811      .dwtag  DW_TAG_member
   10234                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$69)
   10235                      .dwattr $C$DW$1811, DW_AT_name("dcBus")
   10236                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_dcBus")
   10237                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10238                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   10239                      .dwendtag $C$DW$T$78
   10240              
   10241              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10242                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$78)
   10243                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
   10244              
   10245              $C$DW$T$113     .dwtag  DW_TAG_structure_type
   10246                      .dwattr $C$DW$T$113, DW_AT_name("_HAL_Obj_")
   10247                      .dwattr $C$DW$T$113, DW_AT_byte_size(0xc2)
   10248              $C$DW$1812      .dwtag  DW_TAG_member
   10249                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$80)
   10250                      .dwattr $C$DW$1812, DW_AT_name("adcHandle")
   10251                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_adcHandle")
   10252                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10253                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   10254              $C$DW$1813      .dwtag  DW_TAG_member
   10255                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$82)
   10256                      .dwattr $C$DW$1813, DW_AT_name("clkHandle")
   10257                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_clkHandle")
   10258                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10259                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   10260              $C$DW$1814      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  196

   10261                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$84)
   10262                      .dwattr $C$DW$1814, DW_AT_name("cpuHandle")
   10263                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_cpuHandle")
   10264                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10265                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   10266              $C$DW$1815      .dwtag  DW_TAG_member
   10267                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$86)
   10268                      .dwattr $C$DW$1815, DW_AT_name("flashHandle")
   10269                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_flashHandle")
   10270                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10271                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   10272              $C$DW$1816      .dwtag  DW_TAG_member
   10273                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$37)
   10274                      .dwattr $C$DW$1816, DW_AT_name("gpioHandle")
   10275                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_gpioHandle")
   10276                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10277                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   10278              $C$DW$1817      .dwtag  DW_TAG_member
   10279                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$89)
   10280                      .dwattr $C$DW$1817, DW_AT_name("offsetHandle_I")
   10281                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_offsetHandle_I")
   10282                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10283                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   10284              $C$DW$1818      .dwtag  DW_TAG_member
   10285                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$91)
   10286                      .dwattr $C$DW$1818, DW_AT_name("offset_I")
   10287                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_offset_I")
   10288                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10289                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10290              $C$DW$1819      .dwtag  DW_TAG_member
   10291                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$89)
   10292                      .dwattr $C$DW$1819, DW_AT_name("offsetHandle_V")
   10293                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_offsetHandle_V")
   10294                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10295                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10296              $C$DW$1820      .dwtag  DW_TAG_member
   10297                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$91)
   10298                      .dwattr $C$DW$1820, DW_AT_name("offset_V")
   10299                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_offset_V")
   10300                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10301                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10302              $C$DW$1821      .dwtag  DW_TAG_member
   10303                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$93)
   10304                      .dwattr $C$DW$1821, DW_AT_name("oscHandle")
   10305                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_oscHandle")
   10306                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10307                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10308              $C$DW$1822      .dwtag  DW_TAG_member
   10309                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$95)
   10310                      .dwattr $C$DW$1822, DW_AT_name("pieHandle")
   10311                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_pieHandle")
   10312                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10313                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10314              $C$DW$1823      .dwtag  DW_TAG_member
   10315                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$97)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  197

   10316                      .dwattr $C$DW$1823, DW_AT_name("pllHandle")
   10317                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_pllHandle")
   10318                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10319                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   10320              $C$DW$1824      .dwtag  DW_TAG_member
   10321                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$100)
   10322                      .dwattr $C$DW$1824, DW_AT_name("pwmHandle")
   10323                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_pwmHandle")
   10324                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   10325                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   10326              $C$DW$1825      .dwtag  DW_TAG_member
   10327                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$100)
   10328                      .dwattr $C$DW$1825, DW_AT_name("pwmDacHandle")
   10329                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_pwmDacHandle")
   10330                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   10331                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10332              $C$DW$1826      .dwtag  DW_TAG_member
   10333                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$102)
   10334                      .dwattr $C$DW$1826, DW_AT_name("pwrHandle")
   10335                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_pwrHandle")
   10336                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   10337                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10338              $C$DW$1827      .dwtag  DW_TAG_member
   10339                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$105)
   10340                      .dwattr $C$DW$1827, DW_AT_name("timerHandle")
   10341                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_timerHandle")
   10342                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   10343                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10344              $C$DW$1828      .dwtag  DW_TAG_member
   10345                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$107)
   10346                      .dwattr $C$DW$1828, DW_AT_name("wdogHandle")
   10347                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_wdogHandle")
   10348                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   10349                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10350              $C$DW$1829      .dwtag  DW_TAG_member
   10351                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$108)
   10352                      .dwattr $C$DW$1829, DW_AT_name("adcBias")
   10353                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_adcBias")
   10354                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   10355                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10356              $C$DW$1830      .dwtag  DW_TAG_member
   10357                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$69)
   10358                      .dwattr $C$DW$1830, DW_AT_name("current_sf")
   10359                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_current_sf")
   10360                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
   10361                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10362              $C$DW$1831      .dwtag  DW_TAG_member
   10363                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$69)
   10364                      .dwattr $C$DW$1831, DW_AT_name("voltage_sf")
   10365                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_voltage_sf")
   10366                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
   10367                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10368              $C$DW$1832      .dwtag  DW_TAG_member
   10369                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$32)
   10370                      .dwattr $C$DW$1832, DW_AT_name("numCurrentSensors")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  198

   10371                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_numCurrentSensors")
   10372                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   10373                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10374              $C$DW$1833      .dwtag  DW_TAG_member
   10375                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$32)
   10376                      .dwattr $C$DW$1833, DW_AT_name("numVoltageSensors")
   10377                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_numVoltageSensors")
   10378                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
   10379                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10380              $C$DW$1834      .dwtag  DW_TAG_member
   10381                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$35)
   10382                      .dwattr $C$DW$1834, DW_AT_name("spiAHandle")
   10383                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_spiAHandle")
   10384                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   10385                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10386              $C$DW$1835      .dwtag  DW_TAG_member
   10387                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$109)
   10388                      .dwattr $C$DW$1835, DW_AT_name("spiA")
   10389                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_spiA")
   10390                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
   10391                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10392              $C$DW$1836      .dwtag  DW_TAG_member
   10393                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$111)
   10394                      .dwattr $C$DW$1836, DW_AT_name("drv8301Handle")
   10395                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_drv8301Handle")
   10396                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
   10397                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10398              $C$DW$1837      .dwtag  DW_TAG_member
   10399                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$112)
   10400                      .dwattr $C$DW$1837, DW_AT_name("drv8301")
   10401                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_drv8301")
   10402                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
   10403                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10404                      .dwendtag $C$DW$T$113
   10405              
   10406              $C$DW$T$354     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   10407                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$113)
   10408                      .dwattr $C$DW$T$354, DW_AT_language(DW_LANG_C)
   10409              $C$DW$T$355     .dwtag  DW_TAG_pointer_type
   10410                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$354)
   10411                      .dwattr $C$DW$T$355, DW_AT_address_class(0x16)
   10412              $C$DW$T$356     .dwtag  DW_TAG_pointer_type
   10413                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$113)
   10414                      .dwattr $C$DW$T$356, DW_AT_address_class(0x16)
   10415              $C$DW$T$357     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   10416                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$356)
   10417                      .dwattr $C$DW$T$357, DW_AT_language(DW_LANG_C)
   10418              $C$DW$1838      .dwtag  DW_TAG_TI_far_type
   10419                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$357)
   10420              $C$DW$T$358     .dwtag  DW_TAG_const_type
   10421                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$1838)
   10422              
   10423              $C$DW$T$115     .dwtag  DW_TAG_structure_type
   10424                      .dwattr $C$DW$T$115, DW_AT_name("_MATH_vec3_")
   10425                      .dwattr $C$DW$T$115, DW_AT_byte_size(0x06)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 10:57:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0913611                         PAGE  199

   10426              $C$DW$1839      .dwtag  DW_TAG_member
   10427                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$114)
   10428                      .dwattr $C$DW$1839, DW_AT_name("value")
   10429                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_value")
   10430                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10431                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10432                      .dwendtag $C$DW$T$115
   10433              
   10434              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   10435                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$115)
   10436                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
   10437              
   10438              $C$DW$T$119     .dwtag  DW_TAG_structure_type
   10439                      .dwattr $C$DW$T$119, DW_AT_name("_OFFSET_")
   10440                      .dwattr $C$DW$T$119, DW_AT_byte_size(0x10)
   10441              $C$DW$1840      .dwtag  DW_TAG_member
   10442                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$69)
   10443                      .dwattr $C$DW$1840, DW_AT_name("value")
   10444                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_value")
   10445                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10446                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10447              $C$DW$1841      .dwtag  DW_TAG_member
   10448                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$69)
   10449                      .dwattr $C$DW$1841, DW_AT_name("bias")
   10450                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_bias")
   10451                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10452                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10453              $C$DW$1842      .dwtag  DW_TAG_member
