TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:37 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0844411                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Thu Jun 25 17:41:37 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/offset/src/32b/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("FILTER_FO_setNumCoeffs")

     439                      .dwattr $C$DW$48, DW_AT_location[DW_OP_reg12]
     440              
     441              ;***************************************************************
     442              ;* FNAME: _OFFSET_getBeta               FR SIZE:   6           *
     443              ;*                                                             *
     444              ;* FUNCTION ENVIRONMENT                                        *
     445              ;*                                                             *
     446              ;* FUNCTION PROPERTIES                                         *
     447              ;*                            2 Parameter,  4 Auto,  0 SOE     *
     448              ;***************************************************************
     449              
     450              _OFFSET_getBeta:
     451              ;* AR4   assigned to _handle
     452              $C$DW$49        .dwtag  DW_TAG_variable, DW_AT_name("handle")
     453                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_handle")
     454                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$36)
     455                      .dwattr $C$DW$49, DW_AT_location[DW_OP_reg12]
     456              $C$DW$50        .dwtag  DW_TAG_variable, DW_AT_name("b0")
     457                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_b0")
     458                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     459                      .dwattr $C$DW$50, DW_AT_location[DW_OP_breg20 -4]
     460              $C$DW$51        .dwtag  DW_TAG_variable, DW_AT_name("b1")
     461                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_b1")
     462                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     463                      .dwattr $C$DW$51, DW_AT_location[DW_OP_breg20 -6]
     464                      .dwcfi  cfa_offset, -2
     465                      .dwcfi  save_reg_to_mem, 26, 0
     466                      .dwcfi  save_reg_to_reg, 78, 26
     467 00000038 FE06          ADDB      SP,#6                 ; [CPU_U] 
     468                      .dwcfi  cfa_offset, -8
     469                      .dwpsn  file "D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/offset/src/32b/offset.c",line 6
     470 00000039 5DAD          MOVZ      AR5,SP                ; [CPU_U] |64| 
     471 0000003a D00E          MOVB      XAR0,#14              ; [CPU_] |64| 
     472 0000003b DD86          SUBB      XAR5,#6               ; [CPU_U] |64| 
     473 0000003c A042          MOVL      *-SP[2],XAR5          ; [CPU_] |64| 
     474 0000003d 8A94          MOVL      XAR4,*+XAR4[AR0]      ; [CPU_] |64| 
     475 0000003e 5DAD          MOVZ      AR5,SP                ; [CPU_U] |64| 
     476 0000003f DD84          SUBB      XAR5,#4               ; [CPU_U] |64| 
     477              $C$DW$52        .dwtag  DW_TAG_TI_branch
     478                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     479                      .dwattr $C$DW$52, DW_AT_name("_FILTER_FO_getNumCoeffs")
     480                      .dwattr $C$DW$52, DW_AT_TI_call
     481 00000040 7640!         LCR       #_FILTER_FO_getNumCoeffs ; [CPU_] |64| 
         00000041 0000 
     482                      ; call occurs [#_FILTER_FO_getNumCoeffs] ; [] |64| 
     483                      .dwpsn  file "D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/offset/src/32b/offset.c",line 6
     484 00000042 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |66| 
     485 00000043 FE86          SUBB      SP,#6                 ; [CPU_U] 
     486                      .dwcfi  cfa_offset, -2
     487              $C$DW$53        .dwtag  DW_TAG_TI_branch
     488                      .dwattr $C$DW$53, DW_AT_low_pc(0x00)
     489                      .dwattr $C$DW$53, DW_AT_TI_return
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:37 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0844411                         PAGE   10

     490 00000044 0006          LRETR     ; [CPU_] 
     491                      ; return occurs ; [] 
     492                      .dwattr $C$DW$47, DW_AT_TI_end_file("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/offset/s
     493                      .dwattr $C$DW$47, DW_AT_TI_end_line(0x43)
     494                      .dwattr $C$DW$47, DW_AT_TI_end_column(0x01)
     495                      .dwendentry
     496                      .dwendtag $C$DW$47
     497              
     498              ;**************************************************************
     499              ;* UNDEFINED EXTERNAL REFERENCES                              *
     500              ;**************************************************************
     501                      .global _FILTER_FO_setNumCoeffs
     502                      .global _FILTER_FO_setInitialConditions
     503                      .global _FILTER_FO_getNumCoeffs
     504                      .global _FILTER_FO_setDenCoeffs
     505                      .global _FILTER_FO_init
     506              
     507              ;***************************************************************
     508              ;* TYPE INFORMATION                                            *
     509              ;***************************************************************
     510              
     511              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     512                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_")
     513                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
     514              $C$DW$54        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     516                      .dwattr $C$DW$54, DW_AT_name("a1")
     517                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_a1")
     518                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     520              $C$DW$55        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     522                      .dwattr $C$DW$55, DW_AT_name("b0")
     523                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_b0")
     524                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     525                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     526              $C$DW$56        .dwtag  DW_TAG_member
     527                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     528                      .dwattr $C$DW$56, DW_AT_name("b1")
     529                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_b1")
     530                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     531                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     532              $C$DW$57        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     534                      .dwattr $C$DW$57, DW_AT_name("x1")
     535                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_x1")
     536                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     537                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     538              $C$DW$58        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     540                      .dwattr $C$DW$58, DW_AT_name("y1")
     541                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_y1")
     542                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     543                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     544                      .dwendtag $C$DW$T$22
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:37 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0844411                         PAGE   11

     545              
     546              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
     547                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     548                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     549              
     550              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     551                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
     552                      .dwattr $C$DW$T$19, DW_AT_declaration
     553                      .dwendtag $C$DW$T$19
     554              
     555              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     556                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
     558              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
     559                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     560                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     561              
     562              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     563                      .dwattr $C$DW$T$26, DW_AT_name("_OFFSET_")
     564                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     565              $C$DW$59        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     567                      .dwattr $C$DW$59, DW_AT_name("value")
     568                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_value")
     569                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     571              $C$DW$60        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     573                      .dwattr $C$DW$60, DW_AT_name("bias")
     574                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bias")
     575                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     576                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     577              $C$DW$61        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$23)
     579                      .dwattr $C$DW$61, DW_AT_name("filter")
     580                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_filter")
     581                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     582                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     583              $C$DW$62        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
     585                      .dwattr $C$DW$62, DW_AT_name("filterHandle")
     586                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_filterHandle")
     587                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     588                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     589                      .dwendtag $C$DW$T$26
     590              
     591              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
     592                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
     593                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     594              
     595              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     596                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
     597                      .dwattr $C$DW$T$20, DW_AT_declaration
     598                      .dwendtag $C$DW$T$20
     599              
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:37 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0844411                         PAGE   12

     600              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
     601                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$20)
     602                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
     603              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
     604                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     605                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     606              $C$DW$63        .dwtag  DW_TAG_TI_far_type
     607                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$35)
     608              $C$DW$T$36      .dwtag  DW_TAG_const_type
     609                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$63)
     610              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     611                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
     612              $C$DW$64        .dwtag  DW_TAG_TI_far_type
     613                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$3)
     614              $C$DW$T$40      .dwtag  DW_TAG_const_type
     615                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$64)
     616              $C$DW$T$4       .dwtag  DW_TAG_base_type
     617                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     618                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     619                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     620              $C$DW$T$5       .dwtag  DW_TAG_base_type
     621                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     622                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     623                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     624              $C$DW$T$6       .dwtag  DW_TAG_base_type
     625                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     626                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     627                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     628              $C$DW$T$7       .dwtag  DW_TAG_base_type
     629                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     630                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     631                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     632              $C$DW$T$8       .dwtag  DW_TAG_base_type
     633                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     634                      .dwattr $C$DW$T$8, DW_AT_name("short")
     635                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     636              $C$DW$T$9       .dwtag  DW_TAG_base_type
     637                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     638                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     639                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     640              $C$DW$T$10      .dwtag  DW_TAG_base_type
