TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Thu Jun 25 17:41:42 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/drivers/pie/src/32b/f28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.2.3\bin\opt2000.exe C:\\Users\\a0220341\\AppData\\Local\\Te

    2053              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT5"), DW_AT_const_value(0x05)
    2054              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT6"), DW_AT_const_value(0x06)
    2055              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT7"), DW_AT_const_value(0x07)
    2056              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT8"), DW_AT_const_value(0x08)
    2057              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT9"), DW_AT_const_value(0x09)
    2058              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT10"), DW_AT_const_value(0x0a)
    2059              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT11"), DW_AT_const_value(0x0b)
    2060              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT12"), DW_AT_const_value(0x0c)
    2061              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT1"), DW_AT_const_value(0x0d)
    2062              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT2"), DW_AT_const_value(0x0e)
    2063              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_DATALOG"), DW_AT_const_value(0x0f
    2064              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_RTOSINT"), DW_AT_const_value(0x10
    2065              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_EMUINT"), DW_AT_const_value(0x11)
    2066              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_NMI"), DW_AT_const_value(0x12)
    2067              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_ILLEGAL"), DW_AT_const_value(0x13
    2068              $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER1"), DW_AT_const_value(0x14)
    2069              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER2"), DW_AT_const_value(0x15)
    2070              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER3"), DW_AT_const_value(0x16)
    2071              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER4"), DW_AT_const_value(0x17)
    2072              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER5"), DW_AT_const_value(0x18)
    2073              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER6"), DW_AT_const_value(0x19)
    2074              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER7"), DW_AT_const_value(0x1a)
    2075              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER8"), DW_AT_const_value(0x1b)
    2076              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER9"), DW_AT_const_value(0x1c)
    2077              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER10"), DW_AT_const_value(0x1d)
    2078              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER11"), DW_AT_const_value(0x1e)
    2079              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER12"), DW_AT_const_value(0x1f)
    2080                      .dwendtag $C$DW$T$52
    2081              
    2082              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_SystemInterrupts_e")
    2083                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2084                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2085              $C$DW$275       .dwtag  DW_TAG_TI_far_type
    2086                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$53)
    2087              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2088                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$275)
    2089              
    2090              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2091                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2092              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_FallingEdge"), DW_AT_const_value(0x
    2093              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingEdge"), DW_AT_const_value(0x0
    2094              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge"), DW_AT_const
    2095                      .dwendtag $C$DW$T$55
    2096              
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   40

    2097              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_ExtIntPolarity_e")
    2098                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2099                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2100              $C$DW$279       .dwtag  DW_TAG_TI_far_type
    2101                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$56)
    2102              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2103                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$279)
    2104              
    2105              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2106                      .dwattr $C$DW$T$21, DW_AT_name("_PIE_IERIFR_t")
    2107                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    2108              $C$DW$280       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2110                      .dwattr $C$DW$280, DW_AT_name("IER")
    2111                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_IER")
    2112                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$281       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2116                      .dwattr $C$DW$281, DW_AT_name("IFR")
    2117                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_IFR")
    2118                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2119                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2120                      .dwendtag $C$DW$T$21
    2121              
    2122              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
    2123                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2124                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2125              $C$DW$282       .dwtag  DW_TAG_TI_far_type
    2126                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
    2127              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
    2128                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$282)
    2129              
    2130              $C$DW$T$24      .dwtag  DW_TAG_array_type
    2131                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2132                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2133                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    2134              $C$DW$283       .dwtag  DW_TAG_subrange_type
    2135                      .dwattr $C$DW$283, DW_AT_upper_bound(0x0b)
    2136                      .dwendtag $C$DW$T$24
    2137              
    2138              
    2139              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2140                      .dwattr $C$DW$T$33, DW_AT_name("_PIE_Obj_")
    2141                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x639c)
    2142              $C$DW$284       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    2144                      .dwattr $C$DW$284, DW_AT_name("PIECTRL")
    2145                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_PIECTRL")
    2146                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2148              $C$DW$285       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    2150                      .dwattr $C$DW$285, DW_AT_name("PIEACK")
    2151                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_PIEACK")
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   41

    2152                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2153                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$286       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$24)
    2156                      .dwattr $C$DW$286, DW_AT_name("PIEIER_PIEIFR")
    2157                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2158                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2159                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$287       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$25)
    2162                      .dwattr $C$DW$287, DW_AT_name("rsvd_1")
    2163                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_rsvd_1")
    2164                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2165                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$288       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$29)
    2168                      .dwattr $C$DW$288, DW_AT_name("Reset")
    2169                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_Reset")
    2170                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2171                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2172              $C$DW$289       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$29)
    2174                      .dwattr $C$DW$289, DW_AT_name("INT1")
    2175                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_INT1")
    2176                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2177                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$290       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$29)
    2180                      .dwattr $C$DW$290, DW_AT_name("INT2")
    2181                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_INT2")
    2182                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2183                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2184              $C$DW$291       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$29)
    2186                      .dwattr $C$DW$291, DW_AT_name("INT3")
    2187                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_INT3")
    2188                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2189                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2190              $C$DW$292       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    2192                      .dwattr $C$DW$292, DW_AT_name("INT4")
    2193                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_INT4")
    2194                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2195                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2196              $C$DW$293       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$29)
    2198                      .dwattr $C$DW$293, DW_AT_name("INT5")
    2199                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_INT5")
    2200                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2201                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2202              $C$DW$294       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$29)
    2204                      .dwattr $C$DW$294, DW_AT_name("INT6")
    2205                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_INT6")
    2206                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   42

    2207                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$295       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
    2210                      .dwattr $C$DW$295, DW_AT_name("INT7")
    2211                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_INT7")
    2212                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2213                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2214              $C$DW$296       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$29)
    2216                      .dwattr $C$DW$296, DW_AT_name("INT8")
    2217                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_INT8")
    2218                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2219                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2220              $C$DW$297       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    2222                      .dwattr $C$DW$297, DW_AT_name("INT9")
    2223                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_INT9")
    2224                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2225                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2226              $C$DW$298       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$29)
    2228                      .dwattr $C$DW$298, DW_AT_name("INT10")
    2229                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_INT10")
    2230                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2231                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2232              $C$DW$299       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
    2234                      .dwattr $C$DW$299, DW_AT_name("INT11")
    2235                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_INT11")
    2236                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2237                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2238              $C$DW$300       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$29)
    2240                      .dwattr $C$DW$300, DW_AT_name("INT12")
    2241                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_INT12")
    2242                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2243                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2244              $C$DW$301       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$29)
    2246                      .dwattr $C$DW$301, DW_AT_name("TINT1")
    2247                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_TINT1")
    2248                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2249                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$302       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$29)
    2252                      .dwattr $C$DW$302, DW_AT_name("TINT2")
    2253                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_TINT2")
    2254                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2255                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$303       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$29)
    2258                      .dwattr $C$DW$303, DW_AT_name("DATALOG")
    2259                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_DATALOG")
    2260                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2261                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   43

    2262              $C$DW$304       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$29)
    2264                      .dwattr $C$DW$304, DW_AT_name("RTOSINT")
    2265                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_RTOSINT")
    2266                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2267                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$305       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$29)
    2270                      .dwattr $C$DW$305, DW_AT_name("EMUINT")
    2271                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_EMUINT")
    2272                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2273                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2274              $C$DW$306       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$29)
    2276                      .dwattr $C$DW$306, DW_AT_name("NMI")
    2277                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_NMI")
    2278                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2279                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2280              $C$DW$307       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$29)
    2282                      .dwattr $C$DW$307, DW_AT_name("ILLEGAL")
    2283                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_ILLEGAL")
    2284                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2285                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2286              $C$DW$308       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$29)
    2288                      .dwattr $C$DW$308, DW_AT_name("USER1")
    2289                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_USER1")
    2290                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2291                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2292              $C$DW$309       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$29)
    2294                      .dwattr $C$DW$309, DW_AT_name("USER2")
    2295                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_USER2")
    2296                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2297                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$310       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
    2300                      .dwattr $C$DW$310, DW_AT_name("USER3")
    2301                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_USER3")
    2302                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2303                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2304              $C$DW$311       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$29)
    2306                      .dwattr $C$DW$311, DW_AT_name("USER4")
    2307                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_USER4")
    2308                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2309                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$312       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$29)
    2312                      .dwattr $C$DW$312, DW_AT_name("USER5")
    2313                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_USER5")
    2314                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2315                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$313       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   44

    2317                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$29)
    2318                      .dwattr $C$DW$313, DW_AT_name("USER6")
    2319                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_USER6")
    2320                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2321                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$314       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$29)
    2324                      .dwattr $C$DW$314, DW_AT_name("USER7")
    2325                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_USER7")
    2326                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2327                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$315       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$29)
    2330                      .dwattr $C$DW$315, DW_AT_name("USER8")
    2331                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_USER8")
    2332                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2333                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2334              $C$DW$316       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$29)
    2336                      .dwattr $C$DW$316, DW_AT_name("USER9")
    2337                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_USER9")
    2338                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2339                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$317       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$29)
    2342                      .dwattr $C$DW$317, DW_AT_name("USER10")
    2343                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_USER10")
    2344                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2345                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$318       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$29)
    2348                      .dwattr $C$DW$318, DW_AT_name("USER11")
    2349                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_USER11")
    2350                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2351                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$319       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$29)
    2354                      .dwattr $C$DW$319, DW_AT_name("USER12")
    2355                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_USER12")
    2356                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2357                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$320       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$29)
    2360                      .dwattr $C$DW$320, DW_AT_name("ADCINT1_HP")
    2361                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_ADCINT1_HP")
    2362                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2363                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$321       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$29)
    2366                      .dwattr $C$DW$321, DW_AT_name("ADCINT2_HP")
    2367                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_ADCINT2_HP")
    2368                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2369                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$322       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   45

    2372                      .dwattr $C$DW$322, DW_AT_name("rsvd1_3")
    2373                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_rsvd1_3")
    2374                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2375                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$323       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$29)
    2378                      .dwattr $C$DW$323, DW_AT_name("XINT1")
    2379                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_XINT1")
    2380                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2381                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$324       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$29)
    2384                      .dwattr $C$DW$324, DW_AT_name("XINT2")
    2385                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_XINT2")
    2386                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2387                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$325       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$29)
    2390                      .dwattr $C$DW$325, DW_AT_name("ADCINT9")
    2391                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_ADCINT9")
    2392                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2393                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2394              $C$DW$326       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$29)
    2396                      .dwattr $C$DW$326, DW_AT_name("TINT0")
    2397                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_TINT0")
    2398                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2399                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$327       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$29)
    2402                      .dwattr $C$DW$327, DW_AT_name("WAKEINT")
    2403                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_WAKEINT")
    2404                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2405                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$328       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
    2408                      .dwattr $C$DW$328, DW_AT_name("EPWM1_TZINT")
    2409                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    2410                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2411                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$329       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$29)
    2414                      .dwattr $C$DW$329, DW_AT_name("EPWM2_TZINT")
    2415                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    2416                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2417                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$330       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$29)
    2420                      .dwattr $C$DW$330, DW_AT_name("EPWM3_TZINT")
    2421                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    2422                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2423                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$331       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$29)
    2426                      .dwattr $C$DW$331, DW_AT_name("EPWM4_TZINT")
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   46

    2427                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    2428                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2429                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2430              $C$DW$332       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$29)
    2432                      .dwattr $C$DW$332, DW_AT_name("rsvd2_5")
    2433                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_rsvd2_5")
    2434                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2435                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2436              $C$DW$333       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$29)
    2438                      .dwattr $C$DW$333, DW_AT_name("rsvd2_6")
    2439                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_rsvd2_6")
    2440                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2441                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$334       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$29)
    2444                      .dwattr $C$DW$334, DW_AT_name("rsvd2_7")
    2445                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_rsvd2_7")
    2446                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2447                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$335       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$29)
    2450                      .dwattr $C$DW$335, DW_AT_name("rsvd2_8")
    2451                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_rsvd2_8")
    2452                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2453                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$336       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
    2456                      .dwattr $C$DW$336, DW_AT_name("EPWM1_INT")
    2457                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_EPWM1_INT")
    2458                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2459                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2460              $C$DW$337       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
    2462                      .dwattr $C$DW$337, DW_AT_name("EPWM2_INT")
    2463                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_EPWM2_INT")
    2464                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2465                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$338       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$29)
    2468                      .dwattr $C$DW$338, DW_AT_name("EPWM3_INT")
    2469                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_EPWM3_INT")
    2470                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2471                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$339       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$29)
    2474                      .dwattr $C$DW$339, DW_AT_name("EPWM4_INT")
    2475                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_EPWM4_INT")
    2476                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2477                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$340       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
    2480                      .dwattr $C$DW$340, DW_AT_name("rsvd3_5")
    2481                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_rsvd3_5")
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   47

    2482                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2483                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$341       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$29)
    2486                      .dwattr $C$DW$341, DW_AT_name("rsvd3_6")
    2487                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_rsvd3_6")
    2488                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2489                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2490              $C$DW$342       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
    2492                      .dwattr $C$DW$342, DW_AT_name("rsvd3_7")
    2493                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_rsvd3_7")
    2494                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2495                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$343       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$29)
    2498                      .dwattr $C$DW$343, DW_AT_name("rsvd3_8")
    2499                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_rsvd3_8")
    2500                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2501                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2502              $C$DW$344       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
    2504                      .dwattr $C$DW$344, DW_AT_name("ECAP1_INT")
    2505                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_ECAP1_INT")
    2506                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2507                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2508              $C$DW$345       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$29)
    2510                      .dwattr $C$DW$345, DW_AT_name("rsvd4_2")
    2511                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_rsvd4_2")
    2512                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2513                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2514              $C$DW$346       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$29)
    2516                      .dwattr $C$DW$346, DW_AT_name("rsvd4_3")
    2517                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_rsvd4_3")
    2518                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2519                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2520              $C$DW$347       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$29)
    2522                      .dwattr $C$DW$347, DW_AT_name("rsvd4_4")
    2523                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd4_4")
    2524                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2525                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2526              $C$DW$348       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$29)
    2528                      .dwattr $C$DW$348, DW_AT_name("rsvd4_5")
    2529                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_rsvd4_5")
    2530                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2531                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2532              $C$DW$349       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$29)
    2534                      .dwattr $C$DW$349, DW_AT_name("rsvd4_6")
    2535                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_rsvd4_6")
    2536                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   48

    2537                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2538              $C$DW$350       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    2540                      .dwattr $C$DW$350, DW_AT_name("rsvd4_7")
    2541                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_rsvd4_7")
    2542                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2543                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2544              $C$DW$351       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
    2546                      .dwattr $C$DW$351, DW_AT_name("rsvd4_8")
    2547                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_rsvd4_8")
    2548                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2549                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$352       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
    2552                      .dwattr $C$DW$352, DW_AT_name("rsvd5_1")
    2553                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_rsvd5_1")
    2554                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2555                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2556              $C$DW$353       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
    2558                      .dwattr $C$DW$353, DW_AT_name("rsvd5_2")
    2559                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_rsvd5_2")
    2560                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2561                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2562              $C$DW$354       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
    2564                      .dwattr $C$DW$354, DW_AT_name("rsvd5_3")
    2565                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_rsvd5_3")
    2566                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2567                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2568              $C$DW$355       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
    2570                      .dwattr $C$DW$355, DW_AT_name("rsvd5_4")
    2571                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_rsvd5_4")
    2572                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2573                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2574              $C$DW$356       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
    2576                      .dwattr $C$DW$356, DW_AT_name("rsvd5_5")
    2577                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_rsvd5_5")
    2578                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2579                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$357       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    2582                      .dwattr $C$DW$357, DW_AT_name("rsvd5_6")
    2583                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_rsvd5_6")
    2584                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2585                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$358       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    2588                      .dwattr $C$DW$358, DW_AT_name("rsvd5_7")
    2589                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_rsvd5_7")
    2590                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2591                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   49

    2592              $C$DW$359       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    2594                      .dwattr $C$DW$359, DW_AT_name("rsvd5_8")
    2595                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_rsvd5_8")
    2596                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2597                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2598              $C$DW$360       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
    2600                      .dwattr $C$DW$360, DW_AT_name("SPIRXINTA")
    2601                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_SPIRXINTA")
    2602                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2603                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2604              $C$DW$361       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    2606                      .dwattr $C$DW$361, DW_AT_name("SPITXINTA")
    2607                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_SPITXINTA")
    2608                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2609                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2610              $C$DW$362       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    2612                      .dwattr $C$DW$362, DW_AT_name("rsvd6_3")
    2613                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_rsvd6_3")
    2614                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2615                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$363       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$29)
    2618                      .dwattr $C$DW$363, DW_AT_name("rsvd6_4")
    2619                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_rsvd6_4")
    2620                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2621                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2622              $C$DW$364       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
    2624                      .dwattr $C$DW$364, DW_AT_name("rsvd6_5")
    2625                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd6_5")
    2626                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2627                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2628              $C$DW$365       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    2630                      .dwattr $C$DW$365, DW_AT_name("rsvd6_6")
    2631                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd6_6")
    2632                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2633                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2634              $C$DW$366       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$29)
    2636                      .dwattr $C$DW$366, DW_AT_name("rsvd6_7")
    2637                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_rsvd6_7")
    2638                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2639                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$367       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$29)
    2642                      .dwattr $C$DW$367, DW_AT_name("rsvd6_8")
    2643                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd6_8")
    2644                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2645                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$368       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   50

    2647                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$29)
    2648                      .dwattr $C$DW$368, DW_AT_name("rsvd7_1")
    2649                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd7_1")
    2650                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2651                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$369       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$29)
    2654                      .dwattr $C$DW$369, DW_AT_name("rsvd7_2")
    2655                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd7_2")
    2656                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2657                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2658              $C$DW$370       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    2660                      .dwattr $C$DW$370, DW_AT_name("rsvd7_3")
    2661                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd7_3")
    2662                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2663                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2664              $C$DW$371       .dwtag  DW_TAG_member
    2665                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$29)
    2666                      .dwattr $C$DW$371, DW_AT_name("rsvd7_4")
    2667                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd7_4")
    2668                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2669                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2670              $C$DW$372       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$29)
    2672                      .dwattr $C$DW$372, DW_AT_name("rsvd7_5")
    2673                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd7_5")
    2674                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2675                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2676              $C$DW$373       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$29)
    2678                      .dwattr $C$DW$373, DW_AT_name("rsvd7_6")
    2679                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd7_6")
    2680                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2681                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2682              $C$DW$374       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$29)
    2684                      .dwattr $C$DW$374, DW_AT_name("rsvd7_7")
    2685                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd7_7")
    2686                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2687                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$375       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$29)
    2690                      .dwattr $C$DW$375, DW_AT_name("rsvd7_8")
    2691                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_rsvd7_8")
    2692                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2693                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2694              $C$DW$376       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
    2696                      .dwattr $C$DW$376, DW_AT_name("I2CINT1A")
    2697                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_I2CINT1A")
    2698                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2699                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2700              $C$DW$377       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   51

    2702                      .dwattr $C$DW$377, DW_AT_name("I2CINT2A")
    2703                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_I2CINT2A")
    2704                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2705                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2706              $C$DW$378       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$29)
    2708                      .dwattr $C$DW$378, DW_AT_name("rsvd8_3")
    2709                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd8_3")
    2710                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2711                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$379       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$29)
    2714                      .dwattr $C$DW$379, DW_AT_name("rsvd8_4")
    2715                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_rsvd8_4")
    2716                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2717                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2718              $C$DW$380       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$29)
    2720                      .dwattr $C$DW$380, DW_AT_name("rsvd8_5")
    2721                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd8_5")
    2722                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2723                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2724              $C$DW$381       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$29)
    2726                      .dwattr $C$DW$381, DW_AT_name("rsvd8_6")
    2727                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd8_6")
    2728                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2729                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2730              $C$DW$382       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
    2732                      .dwattr $C$DW$382, DW_AT_name("rsvd8_7")
    2733                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd8_7")
    2734                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2735                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2736              $C$DW$383       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$29)
    2738                      .dwattr $C$DW$383, DW_AT_name("rsvd8_8")
    2739                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd8_8")
    2740                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2741                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2742              $C$DW$384       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$29)
    2744                      .dwattr $C$DW$384, DW_AT_name("SCIRXINTA")
    2745                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_SCIRXINTA")
    2746                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2747                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2748              $C$DW$385       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    2750                      .dwattr $C$DW$385, DW_AT_name("SCITXINTA")
    2751                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_SCITXINTA")
    2752                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2753                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2754              $C$DW$386       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$29)
    2756                      .dwattr $C$DW$386, DW_AT_name("rsvd9_3")
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   52

    2757                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd9_3")
    2758                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2759                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2760              $C$DW$387       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
    2762                      .dwattr $C$DW$387, DW_AT_name("rsvd9_4")
    2763                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd9_4")
    2764                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2765                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2766              $C$DW$388       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$29)
    2768                      .dwattr $C$DW$388, DW_AT_name("rsvd9_5")
    2769                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd9_5")
    2770                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2771                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2772              $C$DW$389       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    2774                      .dwattr $C$DW$389, DW_AT_name("rsvd9_6")
    2775                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd9_6")
    2776                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2777                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2778              $C$DW$390       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
    2780                      .dwattr $C$DW$390, DW_AT_name("rsvd9_7")
    2781                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_rsvd9_7")
    2782                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2783                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2784              $C$DW$391       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
    2786                      .dwattr $C$DW$391, DW_AT_name("rsvd9_8")
    2787                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd9_8")
    2788                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2789                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2790              $C$DW$392       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
    2792                      .dwattr $C$DW$392, DW_AT_name("ADCINT1")
    2793                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ADCINT1")
    2794                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2795                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2796              $C$DW$393       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
    2798                      .dwattr $C$DW$393, DW_AT_name("ADCINT2")
    2799                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_ADCINT2")
    2800                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2801                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2802              $C$DW$394       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    2804                      .dwattr $C$DW$394, DW_AT_name("ADCINT3")
    2805                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_ADCINT3")
    2806                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2807                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2808              $C$DW$395       .dwtag  DW_TAG_member
    2809                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
    2810                      .dwattr $C$DW$395, DW_AT_name("ADCINT4")
    2811                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_ADCINT4")
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   53

    2812                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2813                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2814              $C$DW$396       .dwtag  DW_TAG_member
    2815                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
    2816                      .dwattr $C$DW$396, DW_AT_name("ADCINT5")
    2817                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_ADCINT5")
    2818                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2819                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2820              $C$DW$397       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
    2822                      .dwattr $C$DW$397, DW_AT_name("ADCINT6")
    2823                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_ADCINT6")
    2824                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2825                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2826              $C$DW$398       .dwtag  DW_TAG_member
    2827                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$29)
    2828                      .dwattr $C$DW$398, DW_AT_name("ADCINT7")
    2829                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_ADCINT7")
    2830                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2831                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2832              $C$DW$399       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$29)
    2834                      .dwattr $C$DW$399, DW_AT_name("ADCINT8")
    2835                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_ADCINT8")
    2836                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2837                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2838              $C$DW$400       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$29)
    2840                      .dwattr $C$DW$400, DW_AT_name("rsvd11_1")
    2841                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd11_1")
    2842                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2843                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2844              $C$DW$401       .dwtag  DW_TAG_member
    2845                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$29)
    2846                      .dwattr $C$DW$401, DW_AT_name("rsvd11_2")
    2847                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd11_2")
    2848                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    2849                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2850              $C$DW$402       .dwtag  DW_TAG_member
    2851                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$29)
    2852                      .dwattr $C$DW$402, DW_AT_name("rsvd11_3")
    2853                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd11_3")
    2854                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2855                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2856              $C$DW$403       .dwtag  DW_TAG_member
    2857                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$29)
    2858                      .dwattr $C$DW$403, DW_AT_name("rsvd11_4")
    2859                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_rsvd11_4")
    2860                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    2861                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    2862              $C$DW$404       .dwtag  DW_TAG_member
    2863                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$29)
    2864                      .dwattr $C$DW$404, DW_AT_name("rsvd11_5")
    2865                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_rsvd11_5")
    2866                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   54

    2867                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    2868              $C$DW$405       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$29)
    2870                      .dwattr $C$DW$405, DW_AT_name("rsvd11_6")
    2871                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd11_6")
    2872                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    2873                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    2874              $C$DW$406       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$29)
    2876                      .dwattr $C$DW$406, DW_AT_name("rsvd11_7")
    2877                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_rsvd11_7")
    2878                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    2879                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    2880              $C$DW$407       .dwtag  DW_TAG_member
    2881                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$29)
    2882                      .dwattr $C$DW$407, DW_AT_name("rsvd11_8")
    2883                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_rsvd11_8")
    2884                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    2885                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2886              $C$DW$408       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$29)
    2888                      .dwattr $C$DW$408, DW_AT_name("XINT3")
    2889                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_XINT3")
    2890                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2891                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2892              $C$DW$409       .dwtag  DW_TAG_member
    2893                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$29)
    2894                      .dwattr $C$DW$409, DW_AT_name("rsvd12_2")
    2895                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_rsvd12_2")
    2896                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    2897                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2898              $C$DW$410       .dwtag  DW_TAG_member
    2899                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$29)
    2900                      .dwattr $C$DW$410, DW_AT_name("rsvd12_3")
    2901                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_rsvd12_3")
    2902                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2903                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    2904              $C$DW$411       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$29)
    2906                      .dwattr $C$DW$411, DW_AT_name("rsvd12_4")
    2907                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_rsvd12_4")
    2908                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2909                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2910              $C$DW$412       .dwtag  DW_TAG_member
    2911                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$29)
    2912                      .dwattr $C$DW$412, DW_AT_name("rsvd12_5")
    2913                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_rsvd12_5")
    2914                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2915                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2916              $C$DW$413       .dwtag  DW_TAG_member
    2917                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$29)
    2918                      .dwattr $C$DW$413, DW_AT_name("rsvd12_6")
    2919                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_rsvd12_6")
    2920                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    2921                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   55

    2922              $C$DW$414       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$29)
    2924                      .dwattr $C$DW$414, DW_AT_name("rsvd12_7")
    2925                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_rsvd12_7")
    2926                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2927                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2928              $C$DW$415       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$29)
    2930                      .dwattr $C$DW$415, DW_AT_name("rsvd12_8")
    2931                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_rsvd12_8")
    2932                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    2933                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2934              $C$DW$416       .dwtag  DW_TAG_member
    2935                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$30)
    2936                      .dwattr $C$DW$416, DW_AT_name("rsvd13")
    2937                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_rsvd13")
    2938                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2939                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2940              $C$DW$417       .dwtag  DW_TAG_member
    2941                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$31)
    2942                      .dwattr $C$DW$417, DW_AT_name("XINTnCR")
    2943                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_XINTnCR")
    2944                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
    2945                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2946              $C$DW$418       .dwtag  DW_TAG_member
    2947                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$32)
    2948                      .dwattr $C$DW$418, DW_AT_name("rsvd14")
    2949                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_rsvd14")
    2950                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    2951                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2952              $C$DW$419       .dwtag  DW_TAG_member
    2953                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$31)
    2954                      .dwattr $C$DW$419, DW_AT_name("XINTnCTR")
    2955                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_XINTnCTR")
    2956                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    2957                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2958                      .dwendtag $C$DW$T$33
    2959              
    2960              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Obj")
    2961                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$33)
    2962                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2963              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    2964                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$33)
    2965                      .dwattr $C$DW$T$61, DW_AT_address_class(0x16)
    2966              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Handle")
    2967                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2968                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2969              $C$DW$420       .dwtag  DW_TAG_TI_far_type
    2970                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$62)
    2971              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2972                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$420)
    2973              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2974                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2975              $C$DW$421       .dwtag  DW_TAG_TI_far_type
    2976                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$3)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:42 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0994810                         PAGE   56

    2977              $C$DW$T$69      .dwtag  DW_TAG_const_type
    2978                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$421)
    2979              
    2980              $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2981                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2982              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2983                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2984                      .dwattr $C$DW$T$27, DW_AT_address_class(0x16)
    2985              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IntVec_t")
    2986                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2987                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2988              $C$DW$422       .dwtag  DW_TAG_TI_far_type
    2989                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$28)
    2990              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    2991                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$422)
    2992              $C$DW$423       .dwtag  DW_TAG_TI_far_type
    2993                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$28)
    2994              $C$DW$T$70      .dwtag  DW_TAG_const_type
    2995                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$423)
    2996              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2997                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    2998                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    2999              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3000                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3001                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3002                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3003              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3004                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3005                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3006                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3007              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3008                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
