TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Fri Jun 26 14:41:45 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/solutions/instaspin_foc
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5219              $C$DW$685       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_4"), DW_AT_const_value(0x04)
    5220              $C$DW$686       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    5221              $C$DW$687       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    5222              $C$DW$688       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    5223              $C$DW$689       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    5224              $C$DW$690       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    5225              $C$DW$691       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    5226              $C$DW$692       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    5227              $C$DW$693       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    5228              $C$DW$694       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    5229              $C$DW$695       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    5230              $C$DW$696       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    5231                      .dwendtag $C$DW$T$218
    5232              
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  105

    5233              $C$DW$T$219     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    5234                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    5235                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    5236              
    5237              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    5238                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    5239              $C$DW$697       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    5240              $C$DW$698       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    5241              $C$DW$699       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    5242              $C$DW$700       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    5243              $C$DW$701       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    5244              $C$DW$702       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    5245              $C$DW$703       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    5246              $C$DW$704       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    5247              $C$DW$705       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    5248              $C$DW$706       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    5249              $C$DW$707       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    5250              $C$DW$708       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    5251                      .dwendtag $C$DW$T$221
    5252              
    5253              $C$DW$T$222     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    5254                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    5255                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    5256              
    5257              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    5258                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    5259              $C$DW$709       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    5260              $C$DW$710       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    5261              $C$DW$711       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    5262                      .dwendtag $C$DW$T$224
    5263              
    5264              $C$DW$T$225     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    5265                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    5266                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    5267              
    5268              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    5269                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    5270              $C$DW$712       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    5271              $C$DW$713       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    5272                      .dwendtag $C$DW$T$227
    5273              
    5274              $C$DW$T$228     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    5275                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    5276                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    5277              
    5278              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5279                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x2e)
    5280              $C$DW$714       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$22)
    5282                      .dwattr $C$DW$714, DW_AT_name("Valpha")
    5283                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_Valpha")
    5284                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5285                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5286              $C$DW$715       .dwtag  DW_TAG_member
    5287                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  106

    5288                      .dwattr $C$DW$715, DW_AT_name("Ealpha")
    5289                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_Ealpha")
    5290                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5291                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5292              $C$DW$716       .dwtag  DW_TAG_member
    5293                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$22)
    5294                      .dwattr $C$DW$716, DW_AT_name("Zalpha")
    5295                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_Zalpha")
    5296                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5297                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5298              $C$DW$717       .dwtag  DW_TAG_member
    5299                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$22)
    5300                      .dwattr $C$DW$717, DW_AT_name("Gsmopos")
    5301                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Gsmopos")
    5302                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5303                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5304              $C$DW$718       .dwtag  DW_TAG_member
    5305                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$22)
    5306                      .dwattr $C$DW$718, DW_AT_name("EstIalpha")
    5307                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_EstIalpha")
    5308                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5309                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5310              $C$DW$719       .dwtag  DW_TAG_member
    5311                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$22)
    5312                      .dwattr $C$DW$719, DW_AT_name("Fsmopos")
    5313                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_Fsmopos")
    5314                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5315                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5316              $C$DW$720       .dwtag  DW_TAG_member
    5317                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$22)
    5318                      .dwattr $C$DW$720, DW_AT_name("Vbeta")
    5319                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_Vbeta")
    5320                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5321                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5322              $C$DW$721       .dwtag  DW_TAG_member
    5323                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$22)
    5324                      .dwattr $C$DW$721, DW_AT_name("Ebeta")
    5325                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_Ebeta")
    5326                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5327                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5328              $C$DW$722       .dwtag  DW_TAG_member
    5329                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$22)
    5330                      .dwattr $C$DW$722, DW_AT_name("Zbeta")
    5331                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_Zbeta")
    5332                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5333                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5334              $C$DW$723       .dwtag  DW_TAG_member
    5335                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$22)
    5336                      .dwattr $C$DW$723, DW_AT_name("EstIbeta")
    5337                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_EstIbeta")
    5338                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5339                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5340              $C$DW$724       .dwtag  DW_TAG_member
    5341                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$22)
    5342                      .dwattr $C$DW$724, DW_AT_name("Ialpha")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  107

    5343                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Ialpha")
    5344                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5345                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5346              $C$DW$725       .dwtag  DW_TAG_member
    5347                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$22)
    5348                      .dwattr $C$DW$725, DW_AT_name("IalphaError")
    5349                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_IalphaError")
    5350                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5351                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5352              $C$DW$726       .dwtag  DW_TAG_member
    5353                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$22)
    5354                      .dwattr $C$DW$726, DW_AT_name("Kslide")
    5355                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Kslide")
    5356                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5357                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5358              $C$DW$727       .dwtag  DW_TAG_member
    5359                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$22)
    5360                      .dwattr $C$DW$727, DW_AT_name("Ibeta")
    5361                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_Ibeta")
    5362                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5363                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5364              $C$DW$728       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$22)
    5366                      .dwattr $C$DW$728, DW_AT_name("IbetaError")
    5367                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_IbetaError")
    5368                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5369                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5370              $C$DW$729       .dwtag  DW_TAG_member
    5371                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$22)
    5372                      .dwattr $C$DW$729, DW_AT_name("Kslf")
    5373                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_Kslf")
    5374                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5375                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5376              $C$DW$730       .dwtag  DW_TAG_member
    5377                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$22)
    5378                      .dwattr $C$DW$730, DW_AT_name("Theta")
    5379                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_Theta")
    5380                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5381                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5382              $C$DW$731       .dwtag  DW_TAG_member
    5383                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$22)
    5384                      .dwattr $C$DW$731, DW_AT_name("E0")
    5385                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_E0")
    5386                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5387                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5388              $C$DW$732       .dwtag  DW_TAG_member
    5389                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$22)
    5390                      .dwattr $C$DW$732, DW_AT_name("smoFreq")
    5391                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_smoFreq")
    5392                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5393                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5394              $C$DW$733       .dwtag  DW_TAG_member
    5395                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$22)
    5396                      .dwattr $C$DW$733, DW_AT_name("smoShift")
    5397                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_smoShift")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  108

    5398                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5399                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5400              $C$DW$734       .dwtag  DW_TAG_member
    5401                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$22)
    5402                      .dwattr $C$DW$734, DW_AT_name("runSpeed")
    5403                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_runSpeed")
    5404                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5405                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5406              $C$DW$735       .dwtag  DW_TAG_member
    5407                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$22)
    5408                      .dwattr $C$DW$735, DW_AT_name("cmdSpeed")
    5409                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_cmdSpeed")
    5410                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5411                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5412              $C$DW$736       .dwtag  DW_TAG_member
    5413                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$22)
    5414                      .dwattr $C$DW$736, DW_AT_name("base_wTs")
    5415                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_base_wTs")
    5416                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5417                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5418                      .dwendtag $C$DW$T$23
    5419              
    5420              $C$DW$T$231     .dwtag  DW_TAG_typedef, DW_AT_name("ESMOPOS")
    5421                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$23)
    5422                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    5423              $C$DW$737       .dwtag  DW_TAG_TI_far_type
    5424                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$231)
    5425              $C$DW$T$232     .dwtag  DW_TAG_volatile_type
    5426                      .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$737)
    5427              
    5428              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5429                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    5430              $C$DW$738       .dwtag  DW_TAG_member
    5431                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$16)
    5432                      .dwattr $C$DW$738, DW_AT_name("Rs")
    5433                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Rs")
    5434                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5435                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5436              $C$DW$739       .dwtag  DW_TAG_member
    5437                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$16)
    5438                      .dwattr $C$DW$739, DW_AT_name("Ls")
    5439                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_Ls")
    5440                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5441                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5442              $C$DW$740       .dwtag  DW_TAG_member
    5443                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$16)
    5444                      .dwattr $C$DW$740, DW_AT_name("Ib")
    5445                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_Ib")
    5446                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5447                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5448              $C$DW$741       .dwtag  DW_TAG_member
    5449                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$16)
    5450                      .dwattr $C$DW$741, DW_AT_name("Vb")
    5451                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Vb")
    5452                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  109

    5453                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5454              $C$DW$742       .dwtag  DW_TAG_member
    5455                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$16)
    5456                      .dwattr $C$DW$742, DW_AT_name("Ts")
    5457                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Ts")
    5458                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5459                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5460              $C$DW$743       .dwtag  DW_TAG_member
    5461                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$16)
    5462                      .dwattr $C$DW$743, DW_AT_name("Fsmopos")
    5463                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Fsmopos")
    5464                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5465                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5466              $C$DW$744       .dwtag  DW_TAG_member
    5467                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$16)
    5468                      .dwattr $C$DW$744, DW_AT_name("Gsmopos")
    5469                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Gsmopos")
    5470                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5471                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5472                      .dwendtag $C$DW$T$24
    5473              
    5474              $C$DW$T$233     .dwtag  DW_TAG_typedef, DW_AT_name("SMOPOS_CONST")
    5475                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$24)
    5476                      .dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
    5477              
    5478              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5479                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    5480              $C$DW$745       .dwtag  DW_TAG_member
    5481                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$22)
    5482                      .dwattr $C$DW$745, DW_AT_name("Ref")
    5483                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Ref")
    5484                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5485                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5486              $C$DW$746       .dwtag  DW_TAG_member
    5487                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$22)
    5488                      .dwattr $C$DW$746, DW_AT_name("Fbk")
    5489                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Fbk")
    5490                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5491                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    5492              $C$DW$747       .dwtag  DW_TAG_member
    5493                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$22)
    5494                      .dwattr $C$DW$747, DW_AT_name("Out")
    5495                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_Out")
    5496                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5497                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5498              $C$DW$748       .dwtag  DW_TAG_member
    5499                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$22)
    5500                      .dwattr $C$DW$748, DW_AT_name("Kp")
    5501                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_Kp")
    5502                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5503                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5504              $C$DW$749       .dwtag  DW_TAG_member
    5505                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$22)
    5506                      .dwattr $C$DW$749, DW_AT_name("Ki")
    5507                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_Ki")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  110

    5508                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5509                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5510              $C$DW$750       .dwtag  DW_TAG_member
    5511                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$22)
    5512                      .dwattr $C$DW$750, DW_AT_name("Umax")
    5513                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_Umax")
    5514                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5515                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5516              $C$DW$751       .dwtag  DW_TAG_member
    5517                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$22)
    5518                      .dwattr $C$DW$751, DW_AT_name("Umin")
    5519                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Umin")
    5520                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5521                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5522              $C$DW$752       .dwtag  DW_TAG_member
    5523                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$22)
    5524                      .dwattr $C$DW$752, DW_AT_name("up")
    5525                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_up")
    5526                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5527                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5528              $C$DW$753       .dwtag  DW_TAG_member
    5529                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$22)
    5530                      .dwattr $C$DW$753, DW_AT_name("ui")
    5531                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_ui")
    5532                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5533                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5534              $C$DW$754       .dwtag  DW_TAG_member
    5535                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$22)
    5536                      .dwattr $C$DW$754, DW_AT_name("v1")
    5537                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_v1")
    5538                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5539                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5540              $C$DW$755       .dwtag  DW_TAG_member
    5541                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$22)
    5542                      .dwattr $C$DW$755, DW_AT_name("i1")
    5543                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_i1")
    5544                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5545                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5546              $C$DW$756       .dwtag  DW_TAG_member
    5547                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$22)
    5548                      .dwattr $C$DW$756, DW_AT_name("w1")
    5549                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_w1")
    5550                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5551                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5552                      .dwendtag $C$DW$T$25
    5553              
    5554              $C$DW$T$235     .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
    5555                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$25)
    5556                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    5557              $C$DW$757       .dwtag  DW_TAG_TI_far_type
    5558                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$235)
    5559              $C$DW$T$236     .dwtag  DW_TAG_volatile_type
    5560                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$757)
    5561              
    5562              $C$DW$T$26      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  111

    5563                      .dwattr $C$DW$T$26, DW_AT_name("U3_0")
    5564                      .dwattr $C$DW$T$26, DW_AT_declaration
    5565                      .dwendtag $C$DW$T$26
    5566              
    5567              
    5568              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5569                      .dwattr $C$DW$T$27, DW_AT_name("S3_1")
    5570                      .dwattr $C$DW$T$27, DW_AT_declaration
    5571                      .dwendtag $C$DW$T$27
    5572              
    5573              
    5574              $C$DW$T$28      .dwtag  DW_TAG_union_type
    5575                      .dwattr $C$DW$T$28, DW_AT_name("U4_2")
    5576                      .dwattr $C$DW$T$28, DW_AT_declaration
    5577                      .dwendtag $C$DW$T$28
    5578              
    5579              
    5580              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5581                      .dwattr $C$DW$T$29, DW_AT_name("S4_3")
    5582                      .dwattr $C$DW$T$29, DW_AT_declaration
    5583                      .dwendtag $C$DW$T$29
    5584              
    5585              
    5586              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5587                      .dwattr $C$DW$T$38, DW_AT_name("_ADC_Obj_")
    5588                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x6650)
    5589              $C$DW$758       .dwtag  DW_TAG_member
    5590                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$32)
    5591                      .dwattr $C$DW$758, DW_AT_name("ADCRESULT")
    5592                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_ADCRESULT")
    5593                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5594                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5595              $C$DW$759       .dwtag  DW_TAG_member
    5596                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$33)
    5597                      .dwattr $C$DW$759, DW_AT_name("resvd_1")
    5598                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_resvd_1")
    5599                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5600                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5601              $C$DW$760       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$31)
    5603                      .dwattr $C$DW$760, DW_AT_name("ADCCTL1")
    5604                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_ADCCTL1")
    5605                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5606                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5607              $C$DW$761       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$31)
    5609                      .dwattr $C$DW$761, DW_AT_name("ADCCTL2")
    5610                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ADCCTL2")
    5611                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5612                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5613              $C$DW$762       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$34)
    5615                      .dwattr $C$DW$762, DW_AT_name("rsvd_2")
    5616                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_rsvd_2")
    5617                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  112

    5618                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5619              $C$DW$763       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$31)
    5621                      .dwattr $C$DW$763, DW_AT_name("ADCINTFLG")
    5622                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_ADCINTFLG")
    5623                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5624                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5625              $C$DW$764       .dwtag  DW_TAG_member
    5626                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$31)
    5627                      .dwattr $C$DW$764, DW_AT_name("ADCINTFLGCLR")
    5628                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5629                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5630                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5631              $C$DW$765       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$31)
    5633                      .dwattr $C$DW$765, DW_AT_name("ADCINTOVF")
    5634                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_ADCINTOVF")
    5635                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5636                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5637              $C$DW$766       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$31)
    5639                      .dwattr $C$DW$766, DW_AT_name("ADCINTOVFCLR")
    5640                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5641                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5642                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5643              $C$DW$767       .dwtag  DW_TAG_member
    5644                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$35)
    5645                      .dwattr $C$DW$767, DW_AT_name("INTSELxNy")
    5646                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_INTSELxNy")
    5647                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5648                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5649              $C$DW$768       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$36)
    5651                      .dwattr $C$DW$768, DW_AT_name("rsvd_3")
    5652                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_rsvd_3")
    5653                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5654                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5655              $C$DW$769       .dwtag  DW_TAG_member
    5656                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$31)
    5657                      .dwattr $C$DW$769, DW_AT_name("SOCPRICTRL")
    5658                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5659                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5660                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5661              $C$DW$770       .dwtag  DW_TAG_member
    5662                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$31)
    5663                      .dwattr $C$DW$770, DW_AT_name("rsvd_4")
    5664                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_rsvd_4")
    5665                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5666                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5667              $C$DW$771       .dwtag  DW_TAG_member
    5668                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$31)
    5669                      .dwattr $C$DW$771, DW_AT_name("ADCSAMPLEMODE")
    5670                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5671                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5672                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  113

    5673              $C$DW$772       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$31)
    5675                      .dwattr $C$DW$772, DW_AT_name("rsvd_5")
    5676                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_rsvd_5")
    5677                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5678                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5679              $C$DW$773       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    5681                      .dwattr $C$DW$773, DW_AT_name("ADCINTSOCSEL1")
    5682                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5683                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5684                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5685              $C$DW$774       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    5687                      .dwattr $C$DW$774, DW_AT_name("ADCINTSOCSEL2")
    5688                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5689                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5690                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5691              $C$DW$775       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$34)
    5693                      .dwattr $C$DW$775, DW_AT_name("rsvd_6")
    5694                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_rsvd_6")
    5695                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5696                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5697              $C$DW$776       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$31)
    5699                      .dwattr $C$DW$776, DW_AT_name("ADCSOCFLG1")
    5700                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5701                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5702                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5703              $C$DW$777       .dwtag  DW_TAG_member
    5704                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    5705                      .dwattr $C$DW$777, DW_AT_name("rsvd_7")
    5706                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_rsvd_7")
    5707                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5708                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5709              $C$DW$778       .dwtag  DW_TAG_member
    5710                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$31)
    5711                      .dwattr $C$DW$778, DW_AT_name("ADCSOCFRC1")
    5712                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5713                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5714                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5715              $C$DW$779       .dwtag  DW_TAG_member
    5716                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    5717                      .dwattr $C$DW$779, DW_AT_name("rsvd_8")
    5718                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_rsvd_8")
    5719                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5720                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5721              $C$DW$780       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    5723                      .dwattr $C$DW$780, DW_AT_name("ADCSOCOVF1")
    5724                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5725                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5726                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    5727              $C$DW$781       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  114

    5728                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    5729                      .dwattr $C$DW$781, DW_AT_name("rsvd_9")
    5730                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_rsvd_9")
    5731                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5732                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5733              $C$DW$782       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    5735                      .dwattr $C$DW$782, DW_AT_name("ADCSOCOVFCLR1")
    5736                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5737                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5738                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    5739              $C$DW$783       .dwtag  DW_TAG_member
    5740                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    5741                      .dwattr $C$DW$783, DW_AT_name("rsvd_10")
    5742                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_rsvd_10")
    5743                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5744                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5745              $C$DW$784       .dwtag  DW_TAG_member
    5746                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$32)
    5747                      .dwattr $C$DW$784, DW_AT_name("ADCSOCxCTL")
    5748                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5749                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5750                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5751              $C$DW$785       .dwtag  DW_TAG_member
    5752                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$32)
    5753                      .dwattr $C$DW$785, DW_AT_name("rsvd_11")
    5754                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_rsvd_11")
    5755                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5756                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5757              $C$DW$786       .dwtag  DW_TAG_member
    5758                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    5759                      .dwattr $C$DW$786, DW_AT_name("ADCREFTRIM")
    5760                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5761                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5762                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5763              $C$DW$787       .dwtag  DW_TAG_member
    5764                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    5765                      .dwattr $C$DW$787, DW_AT_name("ADCOFFTRIM")
    5766                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5767                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5768                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5769              $C$DW$788       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$37)
    5771                      .dwattr $C$DW$788, DW_AT_name("resvd_12")
    5772                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_resvd_12")
    5773                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5774                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    5775              $C$DW$789       .dwtag  DW_TAG_member
    5776                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$31)
    5777                      .dwattr $C$DW$789, DW_AT_name("ADCREV")
    5778                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_ADCREV")
    5779                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5780                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    5781                      .dwendtag $C$DW$T$38
    5782              
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  115

    5783              $C$DW$T$238     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    5784                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$38)
    5785                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    5786              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    5787                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$38)
    5788                      .dwattr $C$DW$T$123, DW_AT_address_class(0x16)
    5789              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    5790                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    5791                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    5792              
    5793              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5794                      .dwattr $C$DW$T$40, DW_AT_name("_CLARKE_Obj_")
    5795                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x06)
    5796              $C$DW$790       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$22)
    5798                      .dwattr $C$DW$790, DW_AT_name("alpha_sf")
    5799                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_alpha_sf")
    5800                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5801                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    5802              $C$DW$791       .dwtag  DW_TAG_member
    5803                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$22)
    5804                      .dwattr $C$DW$791, DW_AT_name("beta_sf")
    5805                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_beta_sf")
    5806                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5807                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    5808              $C$DW$792       .dwtag  DW_TAG_member
    5809                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$39)
    5810                      .dwattr $C$DW$792, DW_AT_name("numSensors")
    5811                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_numSensors")
    5812                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5813                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    5814                      .dwendtag $C$DW$T$40
    5815              
    5816              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    5817                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$40)
    5818                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    5819              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    5820                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$40)
    5821                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    5822              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    5823                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    5824                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5825              $C$DW$793       .dwtag  DW_TAG_TI_far_type
    5826                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$50)
    5827              $C$DW$T$239     .dwtag  DW_TAG_const_type
    5828                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$793)
    5829              
    5830              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5831                      .dwattr $C$DW$T$42, DW_AT_name("_CLK_Obj_")
    5832                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x11)
    5833              $C$DW$794       .dwtag  DW_TAG_member
    5834                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$31)
    5835                      .dwattr $C$DW$794, DW_AT_name("XCLK")
    5836                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_XCLK")
    5837                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  116

    5838                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    5839              $C$DW$795       .dwtag  DW_TAG_member
    5840                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$31)
    5841                      .dwattr $C$DW$795, DW_AT_name("rsvd_1")
    5842                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_rsvd_1")
    5843                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5844                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    5845              $C$DW$796       .dwtag  DW_TAG_member
    5846                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$31)
    5847                      .dwattr $C$DW$796, DW_AT_name("CLKCTL")
    5848                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_CLKCTL")
    5849                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5850                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    5851              $C$DW$797       .dwtag  DW_TAG_member
    5852                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$41)
    5853                      .dwattr $C$DW$797, DW_AT_name("rsvd_2")
    5854                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_rsvd_2")
    5855                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5856                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    5857              $C$DW$798       .dwtag  DW_TAG_member
    5858                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$31)
    5859                      .dwattr $C$DW$798, DW_AT_name("LOSPCP")
    5860                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_LOSPCP")
    5861                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5862                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    5863              $C$DW$799       .dwtag  DW_TAG_member
    5864                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$31)
    5865                      .dwattr $C$DW$799, DW_AT_name("PCLKCR0")
    5866                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_PCLKCR0")
    5867                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5868                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    5869              $C$DW$800       .dwtag  DW_TAG_member
    5870                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$31)
    5871                      .dwattr $C$DW$800, DW_AT_name("PCLKCR1")
    5872                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_PCLKCR1")
    5873                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5874                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    5875              $C$DW$801       .dwtag  DW_TAG_member
    5876                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$34)
    5877                      .dwattr $C$DW$801, DW_AT_name("rsvd_3")
    5878                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_rsvd_3")
    5879                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5880                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    5881              $C$DW$802       .dwtag  DW_TAG_member
    5882                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$31)
    5883                      .dwattr $C$DW$802, DW_AT_name("PCLKCR3")
    5884                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_PCLKCR3")
    5885                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5886                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    5887                      .dwendtag $C$DW$T$42
    5888              
    5889              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    5890                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$42)
    5891                      .dwattr $C$DW$T$125, DW_AT_address_class(0x16)
    5892              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  117

    5893                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    5894                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    5895              
    5896              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    5897                      .dwattr $C$DW$T$43, DW_AT_name("_CPU_Obj_")
    5898                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    5899              $C$DW$803       .dwtag  DW_TAG_member
    5900                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$39)
    5901                      .dwattr $C$DW$803, DW_AT_name("tmp")
    5902                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_tmp")
    5903                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5904                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    5905                      .dwendtag $C$DW$T$43
    5906              
    5907              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    5908                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$43)
    5909                      .dwattr $C$DW$T$127, DW_AT_address_class(0x16)
    5910              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5911                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    5912                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    5913              
    5914              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    5915                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    5916                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x108)
    5917              $C$DW$804       .dwtag  DW_TAG_member
    5918                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$44)
    5919                      .dwattr $C$DW$804, DW_AT_name("version")
    5920                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_version")
    5921                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5922                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    5923              $C$DW$805       .dwtag  DW_TAG_member
    5924                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$46)
    5925                      .dwattr $C$DW$805, DW_AT_name("state")
    5926                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_state")
    5927                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5928                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    5929              $C$DW$806       .dwtag  DW_TAG_member
    5930                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$46)
    5931                      .dwattr $C$DW$806, DW_AT_name("prevState")
    5932                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_prevState")
    5933                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5934                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    5935              $C$DW$807       .dwtag  DW_TAG_member
    5936                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$48)
    5937                      .dwattr $C$DW$807, DW_AT_name("errorCode")
    5938                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_errorCode")
    5939                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5940                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    5941              $C$DW$808       .dwtag  DW_TAG_member
    5942                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$50)
    5943                      .dwattr $C$DW$808, DW_AT_name("clarkeHandle_I")
    5944                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5945                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5946                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    5947              $C$DW$809       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  118

    5948                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$51)
    5949                      .dwattr $C$DW$809, DW_AT_name("clarke_I")
    5950                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_clarke_I")
    5951                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5952                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    5953              $C$DW$810       .dwtag  DW_TAG_member
    5954                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$50)
    5955                      .dwattr $C$DW$810, DW_AT_name("clarkeHandle_V")
    5956                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5957                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5958                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    5959              $C$DW$811       .dwtag  DW_TAG_member
    5960                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$51)
    5961                      .dwattr $C$DW$811, DW_AT_name("clarke_V")
    5962                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_clarke_V")
    5963                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5964                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    5965              $C$DW$812       .dwtag  DW_TAG_member
    5966                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$53)
    5967                      .dwattr $C$DW$812, DW_AT_name("estHandle")
    5968                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_estHandle")
    5969                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5970                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    5971              $C$DW$813       .dwtag  DW_TAG_member
    5972                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$55)
    5973                      .dwattr $C$DW$813, DW_AT_name("parkHandle")
    5974                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_parkHandle")
    5975                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5976                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    5977              $C$DW$814       .dwtag  DW_TAG_member
    5978                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$56)
    5979                      .dwattr $C$DW$814, DW_AT_name("park")
    5980                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_park")
    5981                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5982                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    5983              $C$DW$815       .dwtag  DW_TAG_member
    5984                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$58)
    5985                      .dwattr $C$DW$815, DW_AT_name("pidHandle_Id")
    5986                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_pidHandle_Id")
    5987                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5988                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    5989              $C$DW$816       .dwtag  DW_TAG_member
    5990                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$59)
    5991                      .dwattr $C$DW$816, DW_AT_name("pid_Id")
    5992                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_pid_Id")
    5993                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5994                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    5995              $C$DW$817       .dwtag  DW_TAG_member
    5996                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$58)
    5997                      .dwattr $C$DW$817, DW_AT_name("pidHandle_Iq")
    5998                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5999                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6000                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6001              $C$DW$818       .dwtag  DW_TAG_member
    6002                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  119

    6003                      .dwattr $C$DW$818, DW_AT_name("pid_Iq")
    6004                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_pid_Iq")
    6005                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6006                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6007              $C$DW$819       .dwtag  DW_TAG_member
    6008                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$58)
    6009                      .dwattr $C$DW$819, DW_AT_name("pidHandle_spd")
    6010                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_pidHandle_spd")
    6011                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6012                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6013              $C$DW$820       .dwtag  DW_TAG_member
    6014                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$59)
    6015                      .dwattr $C$DW$820, DW_AT_name("pid_spd")
    6016                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_pid_spd")
    6017                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6018                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6019              $C$DW$821       .dwtag  DW_TAG_member
    6020                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$61)
    6021                      .dwattr $C$DW$821, DW_AT_name("iparkHandle")
    6022                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_iparkHandle")
    6023                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6024                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6025              $C$DW$822       .dwtag  DW_TAG_member
    6026                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$62)
    6027                      .dwattr $C$DW$822, DW_AT_name("ipark")
    6028                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_ipark")
    6029                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6030                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6031              $C$DW$823       .dwtag  DW_TAG_member
    6032                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$64)
    6033                      .dwattr $C$DW$823, DW_AT_name("svgenHandle")
    6034                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_svgenHandle")
    6035                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6036                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6037              $C$DW$824       .dwtag  DW_TAG_member
    6038                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$65)
    6039                      .dwattr $C$DW$824, DW_AT_name("svgen")
    6040                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_svgen")
    6041                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6042                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6043              $C$DW$825       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$67)
    6045                      .dwattr $C$DW$825, DW_AT_name("trajHandle_Id")
    6046                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_trajHandle_Id")
    6047                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6048                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6049              $C$DW$826       .dwtag  DW_TAG_member
    6050                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$68)
    6051                      .dwattr $C$DW$826, DW_AT_name("traj_Id")
    6052                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_traj_Id")
    6053                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6054                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6055              $C$DW$827       .dwtag  DW_TAG_member
    6056                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$67)
    6057                      .dwattr $C$DW$827, DW_AT_name("trajHandle_spd")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  120

    6058                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_trajHandle_spd")
    6059                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6060                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6061              $C$DW$828       .dwtag  DW_TAG_member
    6062                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$68)
    6063                      .dwattr $C$DW$828, DW_AT_name("traj_spd")
    6064                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_traj_spd")
    6065                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6066                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6067              $C$DW$829       .dwtag  DW_TAG_member
    6068                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$67)
    6069                      .dwattr $C$DW$829, DW_AT_name("trajHandle_spdMax")
    6070                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6071                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6072                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6073              $C$DW$830       .dwtag  DW_TAG_member
    6074                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$68)
    6075                      .dwattr $C$DW$830, DW_AT_name("traj_spdMax")
    6076                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_traj_spdMax")
    6077                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6078                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6079              $C$DW$831       .dwtag  DW_TAG_member
    6080                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$69)
    6081                      .dwattr $C$DW$831, DW_AT_name("motorParams")
    6082                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_motorParams")
    6083                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6084                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6085              $C$DW$832       .dwtag  DW_TAG_member
    6086                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$72)
    6087                      .dwattr $C$DW$832, DW_AT_name("waitTimes")
    6088                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_waitTimes")
    6089                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6090                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6091              $C$DW$833       .dwtag  DW_TAG_member
    6092                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$71)
    6093                      .dwattr $C$DW$833, DW_AT_name("counter_state")
    6094                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_counter_state")
    6095                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6096                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6097              $C$DW$834       .dwtag  DW_TAG_member
    6098                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$73)
    6099                      .dwattr $C$DW$834, DW_AT_name("numIsrTicksPerCtrlTick")
    6100                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6101                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6102                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6103              $C$DW$835       .dwtag  DW_TAG_member
    6104                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$73)
    6105                      .dwattr $C$DW$835, DW_AT_name("numCtrlTicksPerCurrentTick")
    6106                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6107                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6108                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6109              $C$DW$836       .dwtag  DW_TAG_member
    6110                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$73)
    6111                      .dwattr $C$DW$836, DW_AT_name("numCtrlTicksPerSpeedTick")
    6112                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  121

    6113                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6114                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    6115              $C$DW$837       .dwtag  DW_TAG_member
    6116                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$73)
    6117                      .dwattr $C$DW$837, DW_AT_name("numCtrlTicksPerTrajTick")
    6118                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6119                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6120                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    6121              $C$DW$838       .dwtag  DW_TAG_member
    6122                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$71)
    6123                      .dwattr $C$DW$838, DW_AT_name("ctrlFreq_Hz")
    6124                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6125                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6126                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    6127              $C$DW$839       .dwtag  DW_TAG_member
    6128                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$71)
    6129                      .dwattr $C$DW$839, DW_AT_name("trajFreq_Hz")
    6130                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6131                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6132                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    6133              $C$DW$840       .dwtag  DW_TAG_member
    6134                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$22)
    6135                      .dwattr $C$DW$840, DW_AT_name("trajPeriod_sec")
    6136                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6137                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6138                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    6139              $C$DW$841       .dwtag  DW_TAG_member
    6140                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$74)
    6141                      .dwattr $C$DW$841, DW_AT_name("ctrlPeriod_sec")
    6142                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6143                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6144                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    6145              $C$DW$842       .dwtag  DW_TAG_member
    6146                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$22)
    6147                      .dwattr $C$DW$842, DW_AT_name("maxVsMag_pu")
    6148                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6149                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6150                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    6151              $C$DW$843       .dwtag  DW_TAG_member
    6152                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$75)
    6153                      .dwattr $C$DW$843, DW_AT_name("Iab_in")
    6154                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_Iab_in")
    6155                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6156                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    6157              $C$DW$844       .dwtag  DW_TAG_member
    6158                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$75)
    6159                      .dwattr $C$DW$844, DW_AT_name("Iab_filt")
    6160                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_Iab_filt")
    6161                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6162                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    6163              $C$DW$845       .dwtag  DW_TAG_member
    6164                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$75)
    6165                      .dwattr $C$DW$845, DW_AT_name("Idq_in")
    6166                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_Idq_in")
    6167                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  122

    6168                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    6169              $C$DW$846       .dwtag  DW_TAG_member
    6170                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$75)
    6171                      .dwattr $C$DW$846, DW_AT_name("Vab_in")
    6172                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_Vab_in")
    6173                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6174                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    6175              $C$DW$847       .dwtag  DW_TAG_member
    6176                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$22)
    6177                      .dwattr $C$DW$847, DW_AT_name("spd_out")
    6178                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_spd_out")
    6179                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6180                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    6181              $C$DW$848       .dwtag  DW_TAG_member
    6182                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$75)
    6183                      .dwattr $C$DW$848, DW_AT_name("Vab_out")
    6184                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_Vab_out")
    6185                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6186                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    6187              $C$DW$849       .dwtag  DW_TAG_member
    6188                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$75)
    6189                      .dwattr $C$DW$849, DW_AT_name("Vdq_out")
    6190                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_Vdq_out")
    6191                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6192                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    6193              $C$DW$850       .dwtag  DW_TAG_member
    6194                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$74)
    6195                      .dwattr $C$DW$850, DW_AT_name("Rhf")
    6196                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_Rhf")
    6197                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6198                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    6199              $C$DW$851       .dwtag  DW_TAG_member
    6200                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$74)
    6201                      .dwattr $C$DW$851, DW_AT_name("Lhf")
    6202                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_Lhf")
    6203                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6204                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    6205              $C$DW$852       .dwtag  DW_TAG_member
    6206                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$74)
    6207                      .dwattr $C$DW$852, DW_AT_name("RoverL")
    6208                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_RoverL")
    6209                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6210                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    6211              $C$DW$853       .dwtag  DW_TAG_member
    6212                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$22)
    6213                      .dwattr $C$DW$853, DW_AT_name("Kp_Id")
    6214                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_Kp_Id")
    6215                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6216                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    6217              $C$DW$854       .dwtag  DW_TAG_member
    6218                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$22)
    6219                      .dwattr $C$DW$854, DW_AT_name("Kp_Iq")
    6220                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_Kp_Iq")
    6221                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6222                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  123

    6223              $C$DW$855       .dwtag  DW_TAG_member
    6224                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$22)
    6225                      .dwattr $C$DW$855, DW_AT_name("Kp_spd")
    6226                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_Kp_spd")
    6227                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6228                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    6229              $C$DW$856       .dwtag  DW_TAG_member
    6230                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$22)
    6231                      .dwattr $C$DW$856, DW_AT_name("Ki_Id")
    6232                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_Ki_Id")
    6233                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6234                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    6235              $C$DW$857       .dwtag  DW_TAG_member
    6236                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$22)
    6237                      .dwattr $C$DW$857, DW_AT_name("Ki_Iq")
    6238                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_Ki_Iq")
    6239                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6240                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    6241              $C$DW$858       .dwtag  DW_TAG_member
    6242                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$22)
    6243                      .dwattr $C$DW$858, DW_AT_name("Ki_spd")
    6244                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_Ki_spd")
    6245                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6246                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    6247              $C$DW$859       .dwtag  DW_TAG_member
    6248                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$22)
    6249                      .dwattr $C$DW$859, DW_AT_name("Kd_Id")
    6250                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_Kd_Id")
    6251                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6252                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    6253              $C$DW$860       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$22)
    6255                      .dwattr $C$DW$860, DW_AT_name("Kd_Iq")
    6256                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_Kd_Iq")
    6257                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6258                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    6259              $C$DW$861       .dwtag  DW_TAG_member
    6260                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$22)
    6261                      .dwattr $C$DW$861, DW_AT_name("Kd_spd")
    6262                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_Kd_spd")
    6263                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6264                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    6265              $C$DW$862       .dwtag  DW_TAG_member
    6266                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$22)
    6267                      .dwattr $C$DW$862, DW_AT_name("Ui_Id")
    6268                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_Ui_Id")
    6269                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6270                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    6271              $C$DW$863       .dwtag  DW_TAG_member
    6272                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$22)
    6273                      .dwattr $C$DW$863, DW_AT_name("Ui_Iq")
    6274                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_Ui_Iq")
    6275                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6276                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    6277              $C$DW$864       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  124

    6278                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$22)
    6279                      .dwattr $C$DW$864, DW_AT_name("Ui_spd")
    6280                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_Ui_spd")
    6281                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6282                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
    6283              $C$DW$865       .dwtag  DW_TAG_member
    6284                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$75)
    6285                      .dwattr $C$DW$865, DW_AT_name("Idq_ref")
    6286                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_Idq_ref")
    6287                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6288                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    6289              $C$DW$866       .dwtag  DW_TAG_member
    6290                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$22)
    6291                      .dwattr $C$DW$866, DW_AT_name("IdRated")
    6292                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_IdRated")
    6293                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6294                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    6295              $C$DW$867       .dwtag  DW_TAG_member
    6296                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$22)
    6297                      .dwattr $C$DW$867, DW_AT_name("spd_ref")
    6298                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_spd_ref")
    6299                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6300                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    6301              $C$DW$868       .dwtag  DW_TAG_member
    6302                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$22)
    6303                      .dwattr $C$DW$868, DW_AT_name("spd_max")
    6304                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_spd_max")
    6305                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6306                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    6307              $C$DW$869       .dwtag  DW_TAG_member
    6308                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$73)
    6309                      .dwattr $C$DW$869, DW_AT_name("counter_current")
    6310                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_counter_current")
    6311                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6312                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    6313              $C$DW$870       .dwtag  DW_TAG_member
    6314                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$73)
    6315                      .dwattr $C$DW$870, DW_AT_name("counter_isr")
    6316                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_counter_isr")
    6317                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6318                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    6319              $C$DW$871       .dwtag  DW_TAG_member
    6320                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$73)
    6321                      .dwattr $C$DW$871, DW_AT_name("counter_speed")
    6322                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_counter_speed")
    6323                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6324                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
    6325              $C$DW$872       .dwtag  DW_TAG_member
    6326                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$73)
    6327                      .dwattr $C$DW$872, DW_AT_name("counter_traj")
    6328                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_counter_traj")
    6329                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6330                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    6331              $C$DW$873       .dwtag  DW_TAG_member
    6332                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  125

    6333                      .dwattr $C$DW$873, DW_AT_name("flag_enableCtrl")
    6334                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6335                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6336                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    6337              $C$DW$874       .dwtag  DW_TAG_member
    6338                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$76)
    6339                      .dwattr $C$DW$874, DW_AT_name("flag_enableDcBusComp")
    6340                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6341                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6342                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    6343              $C$DW$875       .dwtag  DW_TAG_member
    6344                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$76)
    6345                      .dwattr $C$DW$875, DW_AT_name("flag_enablePowerWarp")
    6346                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6347                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6348                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    6349              $C$DW$876       .dwtag  DW_TAG_member
    6350                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$76)
    6351                      .dwattr $C$DW$876, DW_AT_name("flag_enableOffset")
    6352                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_flag_enableOffset")
    6353                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6354                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
    6355              $C$DW$877       .dwtag  DW_TAG_member
    6356                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$76)
    6357                      .dwattr $C$DW$877, DW_AT_name("flag_enableSpeedCtrl")
    6358                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6359                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6360                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    6361              $C$DW$878       .dwtag  DW_TAG_member
    6362                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$76)
    6363                      .dwattr $C$DW$878, DW_AT_name("flag_enableUserMotorParams")
    6364                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6365                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6366                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    6367              $C$DW$879       .dwtag  DW_TAG_member
    6368                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$75)
    6369                      .dwattr $C$DW$879, DW_AT_name("Idq_offset_pu")
    6370                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6371                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6372                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    6373              $C$DW$880       .dwtag  DW_TAG_member
    6374                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$75)
    6375                      .dwattr $C$DW$880, DW_AT_name("Vdq_offset_pu")
    6376                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6377                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6378                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    6379              $C$DW$881       .dwtag  DW_TAG_member
    6380                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$22)
    6381                      .dwattr $C$DW$881, DW_AT_name("angle_pu")
    6382                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_angle_pu")
    6383                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6384                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    6385              $C$DW$882       .dwtag  DW_TAG_member
    6386                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$22)
    6387                      .dwattr $C$DW$882, DW_AT_name("speed_ref_pu")
TMS320C2000 Assembler PC v6.2.3 Fri Jun 26 14:41:46 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0380810                         PAGE  126

    6388                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_speed_ref_pu")
    6389                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6390                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    6391              $C$DW$883       .dwtag  DW_TAG_member
    6392                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$22)
    6393                      .dwattr $C$DW$883, DW_AT_name("speed_fb_pu")
    6394                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_speed_fb_pu")
    6395                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6396                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    6397              $C$DW$884       .dwtag  DW_TAG_member
    6398                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$22)
    6399                      .dwattr $C$DW$884, DW_AT_name("speed_outMax_pu")
    6400                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6401                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6402                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    6403              $C$DW$885       .dwtag  DW_TAG_member
    6404                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$76)
    6405                      .dwattr $C$DW$885, DW_AT_name("flag_enableCurrentCtrl")
