TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0726011                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Thu Jun 25 17:41:48 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/drivers/spi/src/32b/f28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.2.3\bin\opt2000.exe C:\\Users\\a0220341\\AppData\\Local\\Te

    2487                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2488                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2489              $C$DW$240       .dwtag  DW_TAG_TI_far_type
    2490                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$53)
    2491              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2492                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$240)
    2493              
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0726011                         PAGE   47

    2494              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2495                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2496              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_Empty"), DW_AT_const_value(0x00)
    2497              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_1_Word"), DW_AT_const_value(0x01)
    2498              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_2_Words"), DW_AT_const_value(0x02)
    2499              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_3_Words"), DW_AT_const_value(0x03)
    2500              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_4_Words"), DW_AT_const_value(0x04)
    2501                      .dwendtag $C$DW$T$55
    2502              
    2503              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoLevel_e")
    2504                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2505                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2506              $C$DW$246       .dwtag  DW_TAG_TI_far_type
    2507                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$56)
    2508              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2509                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$246)
    2510              
    2511              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    2512                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    2513              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_SteInv_ActiveLow"), DW_AT_const_value(0x00)
    2514              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_SteInv_ActiveHigh"), DW_AT_const_value(0x02)
    2515                      .dwendtag $C$DW$T$58
    2516              
    2517              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_SteInv_e")
    2518                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2519                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2520              $C$DW$249       .dwtag  DW_TAG_TI_far_type
    2521                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$59)
    2522              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2523                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$249)
    2524              
    2525              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2526                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2527              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    2528              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    2529              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    2530                      .dwendtag $C$DW$T$61
    2531              
    2532              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    2533                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2534                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2535              $C$DW$253       .dwtag  DW_TAG_TI_far_type
    2536                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$62)
    2537              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2538                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$253)
    2539              
    2540              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2541                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2542              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TriWire_NormalFourWire"), DW_AT_const_value(0x00)
    2543              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TriWire_ThreeWire"), DW_AT_const_value(0x01)
    2544                      .dwendtag $C$DW$T$64
    2545              
    2546              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_TriWire_e")
    2547                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2548                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0726011                         PAGE   48

    2549              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    2550                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$65)
    2551              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2552                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$256)
    2553              
    2554              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2555                      .dwattr $C$DW$T$22, DW_AT_name("_SPI_Obj_")
    2556                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2557              $C$DW$257       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2559                      .dwattr $C$DW$257, DW_AT_name("SPICCR")
    2560                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_SPICCR")
    2561                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2563              $C$DW$258       .dwtag  DW_TAG_member
    2564                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2565                      .dwattr $C$DW$258, DW_AT_name("SPICTL")
    2566                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_SPICTL")
    2567                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2568                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2569              $C$DW$259       .dwtag  DW_TAG_member
    2570                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2571                      .dwattr $C$DW$259, DW_AT_name("SPIST")
    2572                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_SPIST")
    2573                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2574                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2575              $C$DW$260       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2577                      .dwattr $C$DW$260, DW_AT_name("rsvd_1")
    2578                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd_1")
    2579                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2580                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2581              $C$DW$261       .dwtag  DW_TAG_member
    2582                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2583                      .dwattr $C$DW$261, DW_AT_name("SPIBRR")
    2584                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_SPIBRR")
    2585                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2586                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2587              $C$DW$262       .dwtag  DW_TAG_member
    2588                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2589                      .dwattr $C$DW$262, DW_AT_name("rsvd_2")
    2590                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_2")
    2591                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2592                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2593              $C$DW$263       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2595                      .dwattr $C$DW$263, DW_AT_name("SPIEMU")
    2596                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_SPIEMU")
    2597                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2598                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2599              $C$DW$264       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2601                      .dwattr $C$DW$264, DW_AT_name("SPIRXBUF")
    2602                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_SPIRXBUF")
    2603                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0726011                         PAGE   49

    2604                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2605              $C$DW$265       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2607                      .dwattr $C$DW$265, DW_AT_name("SPITXBUF")
    2608                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_SPITXBUF")
    2609                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2610                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2611              $C$DW$266       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2613                      .dwattr $C$DW$266, DW_AT_name("SPIDAT")
    2614                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_SPIDAT")
    2615                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2616                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2617              $C$DW$267       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2619                      .dwattr $C$DW$267, DW_AT_name("SPIFFTX")
    2620                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_SPIFFTX")
    2621                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2622                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2623              $C$DW$268       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2625                      .dwattr $C$DW$268, DW_AT_name("SPIFFRX")
    2626                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_SPIFFRX")
    2627                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2628                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2629              $C$DW$269       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2631                      .dwattr $C$DW$269, DW_AT_name("SPIFFCT")
    2632                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_SPIFFCT")
    2633                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2634                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2635              $C$DW$270       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    2637                      .dwattr $C$DW$270, DW_AT_name("rsvd_3")
    2638                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd_3")
    2639                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2640                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2641              $C$DW$271       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2643                      .dwattr $C$DW$271, DW_AT_name("SPIPRI")
    2644                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_SPIPRI")
    2645                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2646                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2647                      .dwendtag $C$DW$T$22
    2648              
    2649              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
    2650                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    2651                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2652              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2653                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    2654                      .dwattr $C$DW$T$25, DW_AT_address_class(0x16)
    2655              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
    2656                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2657                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2658              $C$DW$272       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.3 Thu Jun 25 17:41:49 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0726011                         PAGE   50

    2659                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$26)
    2660              $C$DW$T$68      .dwtag  DW_TAG_const_type
    2661                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$272)
    2662              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2663                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2664              $C$DW$273       .dwtag  DW_TAG_TI_far_type
    2665                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$3)
    2666              $C$DW$T$74      .dwtag  DW_TAG_const_type
    2667                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$273)
    2668              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2669                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2670                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2671                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2672              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2673                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2674                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2675                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2676              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2677                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2678                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2679                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2680              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2681                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2682                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2683                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2684              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2685                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2686                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2687                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2688              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2689                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2690                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2691                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2692              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2693                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2694                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2695              $C$DW$274       .dwtag  DW_TAG_TI_far_type
    2696                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
