TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:26 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1625611                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Mon Aug 03 18:20:26 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/drivers/clk/src/32b/f28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.2.3\bin\opt2000.exe C:\\Users\\a0220341\\AppData\\Local\\Te

    2734              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Osc2Src_e")
    2735                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2736                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2737              $C$DW$243       .dwtag  DW_TAG_TI_far_type
    2738                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$43)
    2739              $C$DW$T$44      .dwtag  DW_TAG_const_type
    2740                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$243)
    2741              
    2742              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    2743                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2744              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio38"), DW_AT_const_value(0x00)
    2745              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio19"), DW_AT_const_value(0x40)
    2746                      .dwendtag $C$DW$T$45
    2747              
    2748              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_XClkInSrc_e")
    2749                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2750                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2751              $C$DW$246       .dwtag  DW_TAG_TI_far_type
    2752                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$46)
    2753              $C$DW$T$47      .dwtag  DW_TAG_const_type
    2754                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$246)
    2755              
    2756              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2757                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2758              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_1"), DW_AT_const_value(0x00)
    2759              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_2"), DW_AT_const_value(0x20)
    2760              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_4"), DW_AT_const_value(0x40)
    2761              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_8"), DW_AT_const_value(0x60)
    2762              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_16"), DW_AT_const_value(0x80)
    2763                      .dwendtag $C$DW$T$48
    2764              
    2765              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2PreScaler_e")
    2766                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2767                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2768              $C$DW$252       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:26 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1625611                         PAGE   52

    2769                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$49)
    2770              $C$DW$T$50      .dwtag  DW_TAG_const_type
    2771                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$252)
    2772              
    2773              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    2774                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2775              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_SysClk"), DW_AT_const_value(0x00)
    2776              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_ExtOsc"), DW_AT_const_value(0x08)
    2777              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc1"), DW_AT_const_value(0x10)
    2778              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc2"), DW_AT_const_value(0x18)
    2779                      .dwendtag $C$DW$T$51
    2780              
    2781              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2Src_e")
    2782                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2783                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2784              $C$DW$257       .dwtag  DW_TAG_TI_far_type
    2785                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$52)
    2786              $C$DW$T$53      .dwtag  DW_TAG_const_type
    2787                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$257)
    2788              
    2789              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    2790                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    2791              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_IntOsc1"), DW_AT_const_value(0x00)
    2792              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_ExtOscOrIntOsc2"), DW_AT_const_value(0x04
    2793                      .dwendtag $C$DW$T$54
    2794              
    2795              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_WdClkSrc_e")
    2796                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2797                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2798              $C$DW$260       .dwtag  DW_TAG_TI_far_type
    2799                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$55)
    2800              $C$DW$T$56      .dwtag  DW_TAG_const_type
    2801                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$260)
    2802              
    2803              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2804                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_Obj_")
    2805                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x11)
    2806              $C$DW$261       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2808                      .dwattr $C$DW$261, DW_AT_name("XCLK")
    2809                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_XCLK")
    2810                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2812              $C$DW$262       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2814                      .dwattr $C$DW$262, DW_AT_name("rsvd_1")
    2815                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_1")
    2816                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2817                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2818              $C$DW$263       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2820                      .dwattr $C$DW$263, DW_AT_name("CLKCTL")
    2821                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_CLKCTL")
    2822                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2823                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:26 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1625611                         PAGE   53

    2824              $C$DW$264       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
    2826                      .dwattr $C$DW$264, DW_AT_name("rsvd_2")
    2827                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd_2")
    2828                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2829                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2830              $C$DW$265       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2832                      .dwattr $C$DW$265, DW_AT_name("LOSPCP")
    2833                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_LOSPCP")
    2834                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2835                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2836              $C$DW$266       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2838                      .dwattr $C$DW$266, DW_AT_name("PCLKCR0")
    2839                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PCLKCR0")
    2840                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2841                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2842              $C$DW$267       .dwtag  DW_TAG_member
    2843                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2844                      .dwattr $C$DW$267, DW_AT_name("PCLKCR1")
    2845                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_PCLKCR1")
    2846                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2847                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2848              $C$DW$268       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$22)
    2850                      .dwattr $C$DW$268, DW_AT_name("rsvd_3")
    2851                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd_3")
    2852                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2853                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2854              $C$DW$269       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2856                      .dwattr $C$DW$269, DW_AT_name("PCLKCR3")
    2857                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_PCLKCR3")
    2858                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2859                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2860                      .dwendtag $C$DW$T$23
    2861              
    2862              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Obj")
    2863                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$23)
    2864                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2865              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2866                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    2867                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    2868              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    2869                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2870                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2871              $C$DW$270       .dwtag  DW_TAG_TI_far_type
    2872                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$59)
    2873              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2874                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$270)
    2875              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2876                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2877              $C$DW$271       .dwtag  DW_TAG_TI_far_type
    2878                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$3)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:26 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1625611                         PAGE   54

    2879              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2880                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$271)
    2881              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2882                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2883                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2884                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2885              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2886                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2887                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2888                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2889              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2890                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2891                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2892                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2893              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2894                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2895                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2896                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2897              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2898                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2899                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2900                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2901              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2902                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2903                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2904                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2905              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2906                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2907                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2908              $C$DW$272       .dwtag  DW_TAG_TI_far_type
    2909                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
