TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Mon Aug 03 18:20:29 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/ctrl/src/32b/ct
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    3292              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    3293              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    3294              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    3295              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    3296              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    3297              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    3298              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    3299              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    3300              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    3301              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    3302              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    3303              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    3304              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    3305              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    3306              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    3307              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    3308              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    3309              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    3310              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    3311              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    3312              $C$DW$366       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    3313              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    3314              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    3315              $C$DW$369       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    3316              $C$DW$370       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    3317              $C$DW$371       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    3318              $C$DW$372       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    3319              $C$DW$373       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    3320              $C$DW$374       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    3321                      .dwendtag $C$DW$T$73
    3322              
    3323              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    3324                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3325                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3326              
    3327              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3328                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3329              $C$DW$375       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3330              $C$DW$376       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3331              $C$DW$377       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3332                      .dwendtag $C$DW$T$82
    3333              
    3334              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3335                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3336                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3337              $C$DW$378       .dwtag  DW_TAG_TI_far_type
    3338                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$83)
    3339              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3340                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$378)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   64

    3341              
    3342              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3343                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3344                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3345              $C$DW$379       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    3347                      .dwattr $C$DW$379, DW_AT_name("alpha_sf")
    3348                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_alpha_sf")
    3349                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3350                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3351              $C$DW$380       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    3353                      .dwattr $C$DW$380, DW_AT_name("beta_sf")
    3354                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_beta_sf")
    3355                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3356                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3357              $C$DW$381       .dwtag  DW_TAG_member
    3358                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$22)
    3359                      .dwattr $C$DW$381, DW_AT_name("numSensors")
    3360                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_numSensors")
    3361                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3362                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3363                      .dwendtag $C$DW$T$23
    3364              
    3365              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3366                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3367                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3368              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3369                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$31)
    3370                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    3371              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3372                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3373                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    3374              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3375                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3376                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3377              
    3378              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3379                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3380                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x110)
    3381              $C$DW$382       .dwtag  DW_TAG_member
    3382                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$24)
    3383                      .dwattr $C$DW$382, DW_AT_name("version")
    3384                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_version")
    3385                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3386                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3387              $C$DW$383       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$26)
    3389                      .dwattr $C$DW$383, DW_AT_name("state")
    3390                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_state")
    3391                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3392                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3393              $C$DW$384       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$26)
    3395                      .dwattr $C$DW$384, DW_AT_name("prevState")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   65

    3396                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_prevState")
    3397                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3398                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3399              $C$DW$385       .dwtag  DW_TAG_member
    3400                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$28)
    3401                      .dwattr $C$DW$385, DW_AT_name("errorCode")
    3402                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_errorCode")
    3403                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3404                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3405              $C$DW$386       .dwtag  DW_TAG_member
    3406                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$30)
    3407                      .dwattr $C$DW$386, DW_AT_name("clarkeHandle_I")
    3408                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3409                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3410                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3411              $C$DW$387       .dwtag  DW_TAG_member
    3412                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$31)
    3413                      .dwattr $C$DW$387, DW_AT_name("clarke_I")
    3414                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_clarke_I")
    3415                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3416                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3417              $C$DW$388       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$30)
    3419                      .dwattr $C$DW$388, DW_AT_name("clarkeHandle_V")
    3420                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3421                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3422                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3423              $C$DW$389       .dwtag  DW_TAG_member
    3424                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$31)
    3425                      .dwattr $C$DW$389, DW_AT_name("clarke_V")
    3426                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_clarke_V")
    3427                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3428                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3429              $C$DW$390       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$33)
    3431                      .dwattr $C$DW$390, DW_AT_name("estHandle")
    3432                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_estHandle")
    3433                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3434                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3435              $C$DW$391       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$35)
    3437                      .dwattr $C$DW$391, DW_AT_name("parkHandle")
    3438                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_parkHandle")
    3439                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3440                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3441              $C$DW$392       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$36)
    3443                      .dwattr $C$DW$392, DW_AT_name("park")
    3444                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_park")
    3445                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3446                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3447              $C$DW$393       .dwtag  DW_TAG_member
    3448                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$38)
    3449                      .dwattr $C$DW$393, DW_AT_name("pidHandle_Id")
    3450                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_pidHandle_Id")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   66

    3451                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3452                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3453              $C$DW$394       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$39)
    3455                      .dwattr $C$DW$394, DW_AT_name("pid_Id")
    3456                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_pid_Id")
    3457                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3458                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3459              $C$DW$395       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$38)
    3461                      .dwattr $C$DW$395, DW_AT_name("pidHandle_Iq")
    3462                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3463                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3464                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3465              $C$DW$396       .dwtag  DW_TAG_member
    3466                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$39)
    3467                      .dwattr $C$DW$396, DW_AT_name("pid_Iq")
    3468                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_pid_Iq")
    3469                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3470                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3471              $C$DW$397       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$38)
    3473                      .dwattr $C$DW$397, DW_AT_name("pidHandle_spd")
    3474                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_pidHandle_spd")
    3475                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3476                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3477              $C$DW$398       .dwtag  DW_TAG_member
    3478                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$39)
    3479                      .dwattr $C$DW$398, DW_AT_name("pid_spd")
    3480                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_pid_spd")
    3481                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3482                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3483              $C$DW$399       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$41)
    3485                      .dwattr $C$DW$399, DW_AT_name("iparkHandle")
    3486                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_iparkHandle")
    3487                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3488                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3489              $C$DW$400       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$42)
    3491                      .dwattr $C$DW$400, DW_AT_name("ipark")
    3492                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_ipark")
    3493                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3494                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3495              $C$DW$401       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$44)
    3497                      .dwattr $C$DW$401, DW_AT_name("svgenHandle")
    3498                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_svgenHandle")
    3499                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3500                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3501              $C$DW$402       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$45)
    3503                      .dwattr $C$DW$402, DW_AT_name("svgen")
    3504                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_svgen")
    3505                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   67

    3506                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3507              $C$DW$403       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$47)
    3509                      .dwattr $C$DW$403, DW_AT_name("trajHandle_Id")
    3510                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_trajHandle_Id")
    3511                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3512                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3513              $C$DW$404       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$48)
    3515                      .dwattr $C$DW$404, DW_AT_name("traj_Id")
    3516                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_traj_Id")
    3517                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3518                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3519              $C$DW$405       .dwtag  DW_TAG_member
    3520                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$47)
    3521                      .dwattr $C$DW$405, DW_AT_name("trajHandle_spd")
    3522                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_trajHandle_spd")
    3523                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3524                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3525              $C$DW$406       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$48)
    3527                      .dwattr $C$DW$406, DW_AT_name("traj_spd")
    3528                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_traj_spd")
    3529                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3530                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3531              $C$DW$407       .dwtag  DW_TAG_member
    3532                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$47)
    3533                      .dwattr $C$DW$407, DW_AT_name("trajHandle_spdMax")
    3534                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3535                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3536                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3537              $C$DW$408       .dwtag  DW_TAG_member
    3538                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$48)
    3539                      .dwattr $C$DW$408, DW_AT_name("traj_spdMax")
    3540                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_traj_spdMax")
    3541                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3542                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3543              $C$DW$409       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$49)
    3545                      .dwattr $C$DW$409, DW_AT_name("motorParams")
    3546                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_motorParams")
    3547                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3548                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3549              $C$DW$410       .dwtag  DW_TAG_member
    3550                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$52)
    3551                      .dwattr $C$DW$410, DW_AT_name("waitTimes")
    3552                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_waitTimes")
    3553                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3554                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3555              $C$DW$411       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$51)
    3557                      .dwattr $C$DW$411, DW_AT_name("counter_state")
    3558                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_counter_state")
    3559                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3560                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   68

    3561              $C$DW$412       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$53)
    3563                      .dwattr $C$DW$412, DW_AT_name("numIsrTicksPerCtrlTick")
    3564                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3565                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3566                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3567              $C$DW$413       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$53)
    3569                      .dwattr $C$DW$413, DW_AT_name("numCtrlTicksPerCurrentTick")
    3570                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3571                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xa1]
    3572                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$414       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$53)
    3575                      .dwattr $C$DW$414, DW_AT_name("numCtrlTicksPerSpeedTick")
    3576                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3577                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3578                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$415       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$53)
    3581                      .dwattr $C$DW$415, DW_AT_name("numCtrlTicksPerTrajTick")
    3582                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3583                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xa3]
    3584                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$416       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$51)
    3587                      .dwattr $C$DW$416, DW_AT_name("ctrlFreq_Hz")
    3588                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3589                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3590                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$417       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$51)
    3593                      .dwattr $C$DW$417, DW_AT_name("trajFreq_Hz")
    3594                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3595                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3596                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$418       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3599                      .dwattr $C$DW$418, DW_AT_name("trajPeriod_sec")
    3600                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3601                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3602                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$419       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$54)
    3605                      .dwattr $C$DW$419, DW_AT_name("ctrlPeriod_sec")
    3606                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3607                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3608                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$420       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3611                      .dwattr $C$DW$420, DW_AT_name("maxVsMag_pu")
    3612                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3613                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    3614                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3615              $C$DW$421       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   69

    3616                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$55)
    3617                      .dwattr $C$DW$421, DW_AT_name("Iab_in")
    3618                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Iab_in")
    3619                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3620                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3621              $C$DW$422       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$55)
    3623                      .dwattr $C$DW$422, DW_AT_name("Iab_filt")
    3624                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Iab_filt")
    3625                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3626                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3627              $C$DW$423       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$55)
    3629                      .dwattr $C$DW$423, DW_AT_name("Idq_in")
    3630                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Idq_in")
    3631                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3632                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3633              $C$DW$424       .dwtag  DW_TAG_member
    3634                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$55)
    3635                      .dwattr $C$DW$424, DW_AT_name("Vab_in")
    3636                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Vab_in")
    3637                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3638                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3639              $C$DW$425       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3641                      .dwattr $C$DW$425, DW_AT_name("spd_out")
    3642                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_spd_out")
    3643                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    3644                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3645              $C$DW$426       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$55)
    3647                      .dwattr $C$DW$426, DW_AT_name("Vab_out")
    3648                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Vab_out")
    3649                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3650                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3651              $C$DW$427       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$55)
    3653                      .dwattr $C$DW$427, DW_AT_name("Vdq_out")
    3654                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Vdq_out")
    3655                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3656                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3657              $C$DW$428       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$54)
    3659                      .dwattr $C$DW$428, DW_AT_name("Rhf")
    3660                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Rhf")
    3661                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3662                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3663              $C$DW$429       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$54)
    3665                      .dwattr $C$DW$429, DW_AT_name("Lhf")
    3666                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Lhf")
    3667                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3668                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$430       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   70

    3671                      .dwattr $C$DW$430, DW_AT_name("RoverL")
    3672                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_RoverL")
    3673                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3674                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$431       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3677                      .dwattr $C$DW$431, DW_AT_name("Kp_Id")
    3678                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_Kp_Id")
    3679                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3680                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$432       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3683                      .dwattr $C$DW$432, DW_AT_name("Kp_Iq")
    3684                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Kp_Iq")
    3685                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3686                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3687              $C$DW$433       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3689                      .dwattr $C$DW$433, DW_AT_name("Kp_spd")
    3690                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Kp_spd")
    3691                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3692                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$434       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    3695                      .dwattr $C$DW$434, DW_AT_name("Ki_Id")
    3696                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Ki_Id")
    3697                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3698                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3699              $C$DW$435       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    3701                      .dwattr $C$DW$435, DW_AT_name("Ki_Iq")
    3702                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Ki_Iq")
    3703                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3704                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3705              $C$DW$436       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    3707                      .dwattr $C$DW$436, DW_AT_name("Ki_spd")
    3708                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_Ki_spd")
    3709                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3710                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3711              $C$DW$437       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    3713                      .dwattr $C$DW$437, DW_AT_name("Kd_Id")
    3714                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_Kd_Id")
    3715                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3716                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3717              $C$DW$438       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    3719                      .dwattr $C$DW$438, DW_AT_name("Kd_Iq")
    3720                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_Kd_Iq")
    3721                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3722                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3723              $C$DW$439       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    3725                      .dwattr $C$DW$439, DW_AT_name("Kd_spd")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   71

    3726                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_Kd_spd")
    3727                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3728                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3729              $C$DW$440       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    3731                      .dwattr $C$DW$440, DW_AT_name("Ui_Id")
    3732                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_Ui_Id")
    3733                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3734                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3735              $C$DW$441       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    3737                      .dwattr $C$DW$441, DW_AT_name("Ui_Iq")
    3738                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_Ui_Iq")
    3739                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3740                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3741              $C$DW$442       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    3743                      .dwattr $C$DW$442, DW_AT_name("Ui_spd")
    3744                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Ui_spd")
    3745                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3746                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$443       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$55)
    3749                      .dwattr $C$DW$443, DW_AT_name("Idq_ref")
    3750                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Idq_ref")
    3751                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3752                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3753              $C$DW$444       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$20)
    3755                      .dwattr $C$DW$444, DW_AT_name("IdRated")
    3756                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_IdRated")
    3757                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3758                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$445       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    3761                      .dwattr $C$DW$445, DW_AT_name("spd_ref")
    3762                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_spd_ref")
    3763                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3764                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$446       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    3767                      .dwattr $C$DW$446, DW_AT_name("spd_max")
    3768                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_spd_max")
    3769                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3770                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$447       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$53)
    3773                      .dwattr $C$DW$447, DW_AT_name("counter_current")
    3774                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_counter_current")
    3775                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3776                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3777              $C$DW$448       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$53)
    3779                      .dwattr $C$DW$448, DW_AT_name("counter_isr")
    3780                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_counter_isr")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   72

    3781                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3782                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3783              $C$DW$449       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$51)
    3785                      .dwattr $C$DW$449, DW_AT_name("counter_forceangle")
    3786                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_counter_forceangle")
    3787                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3788                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$450       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$51)
    3791                      .dwattr $C$DW$450, DW_AT_name("counter_calibration")
    3792                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_counter_calibration")
    3793                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3794                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$451       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$53)
    3797                      .dwattr $C$DW$451, DW_AT_name("counter_speed")
    3798                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_counter_speed")
    3799                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3800                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3801              $C$DW$452       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$53)
    3803                      .dwattr $C$DW$452, DW_AT_name("counter_traj")
    3804                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_counter_traj")
    3805                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xf7]
    3806                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$453       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$56)
    3809                      .dwattr $C$DW$453, DW_AT_name("flag_enableCtrl")
    3810                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3811                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3812                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$454       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$56)
    3815                      .dwattr $C$DW$454, DW_AT_name("flag_enableDcBusComp")
    3816                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3817                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xf9]
    3818                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$455       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$56)
    3821                      .dwattr $C$DW$455, DW_AT_name("flag_enablePowerWarp")
    3822                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3823                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3824                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$456       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$56)
    3827                      .dwattr $C$DW$456, DW_AT_name("flag_enableOffset")
    3828                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_flag_enableOffset")
    3829                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb]
    3830                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3831              $C$DW$457       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$56)
    3833                      .dwattr $C$DW$457, DW_AT_name("flag_enableSpeedCtrl")
    3834                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3835                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   73

    3836                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$458       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$56)
    3839                      .dwattr $C$DW$458, DW_AT_name("flag_enableUserMotorParams")
    3840                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3841                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd]
    3842                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$459       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$55)
    3845                      .dwattr $C$DW$459, DW_AT_name("Idq_offset_pu")
    3846                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3847                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3848                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$460       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$55)
    3851                      .dwattr $C$DW$460, DW_AT_name("Vdq_offset_pu")
    3852                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3853                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3854                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3855              $C$DW$461       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    3857                      .dwattr $C$DW$461, DW_AT_name("angle_pu")
    3858                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_angle_pu")
    3859                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3860                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$462       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    3863                      .dwattr $C$DW$462, DW_AT_name("speed_ref_pu")
    3864                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_speed_ref_pu")
    3865                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3866                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$463       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    3869                      .dwattr $C$DW$463, DW_AT_name("speed_fb_pu")
    3870                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_speed_fb_pu")
    3871                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    3872                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3873              $C$DW$464       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    3875                      .dwattr $C$DW$464, DW_AT_name("speed_outMax_pu")
    3876                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3877                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3878                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$465       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$56)
    3881                      .dwattr $C$DW$465, DW_AT_name("flag_enableCurrentCtrl")
    3882                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3883                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    3884                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3885                      .dwendtag $C$DW$T$57
    3886              
    3887              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3888                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3889                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3890              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   74

    3891                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$57)
    3892                      .dwattr $C$DW$T$77, DW_AT_address_class(0x16)
    3893              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3894                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    3895                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3896              $C$DW$466       .dwtag  DW_TAG_TI_far_type
    3897                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$78)
    3898              $C$DW$T$87      .dwtag  DW_TAG_const_type
    3899                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$466)
    3900              
    3901              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3902                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3903                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3904              $C$DW$467       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$21)
    3906                      .dwattr $C$DW$467, DW_AT_name("rsvd")
    3907                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_rsvd")
    3908                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3909                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3910              $C$DW$468       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$59)
    3912                      .dwattr $C$DW$468, DW_AT_name("targetProc")
    3913                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_targetProc")
    3914                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3915                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3916              $C$DW$469       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$21)
    3918                      .dwattr $C$DW$469, DW_AT_name("major")
    3919                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_major")
    3920                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3921                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3922              $C$DW$470       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$21)
    3924                      .dwattr $C$DW$470, DW_AT_name("minor")
    3925                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_minor")
    3926                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3927                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3928                      .dwendtag $C$DW$T$60
    3929              
    3930              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3931                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3932                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3933              
    3934              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3935                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3936                      .dwattr $C$DW$T$19, DW_AT_declaration
    3937                      .dwendtag $C$DW$T$19
    3938              
    3939              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3940                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3941                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3942              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3943                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3944                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3945              
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   75

    3946              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3947                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3948                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3949              $C$DW$471       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    3951                      .dwattr $C$DW$471, DW_AT_name("sinTh")
    3952                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_sinTh")
    3953                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3954                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3955              $C$DW$472       .dwtag  DW_TAG_member
    3956                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3957                      .dwattr $C$DW$472, DW_AT_name("cosTh")
    3958                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_cosTh")
    3959                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3960                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3961                      .dwendtag $C$DW$T$61
    3962              
    3963              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3964                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3965                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3966              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3967                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3968                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3969              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3970                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3971                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3972              
    3973              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3974                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3975                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3976              $C$DW$473       .dwtag  DW_TAG_member
    3977                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$62)
    3978                      .dwattr $C$DW$473, DW_AT_name("value")
    3979                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_value")
    3980                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3981                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3982                      .dwendtag $C$DW$T$63
    3983              
    3984              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3985                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3986                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3987              $C$DW$474       .dwtag  DW_TAG_TI_far_type
    3988                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$55)
    3989              $C$DW$T$89      .dwtag  DW_TAG_const_type
    3990                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$474)
    3991              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    3992                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3993                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    3994              $C$DW$475       .dwtag  DW_TAG_TI_far_type
    3995                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$90)
    3996              $C$DW$T$91      .dwtag  DW_TAG_const_type
    3997                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$475)
    3998              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    3999                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$55)
    4000                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   76

    4001              $C$DW$476       .dwtag  DW_TAG_TI_far_type
    4002                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$92)
    4003              $C$DW$T$93      .dwtag  DW_TAG_const_type
    4004                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$476)
    4005              
    4006              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4007                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4008                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4009              $C$DW$477       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$65)
    4011                      .dwattr $C$DW$477, DW_AT_name("type")
    4012                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_type")
    4013                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4014                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4015              $C$DW$478       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$53)
    4017                      .dwattr $C$DW$478, DW_AT_name("numPolePairs")
    4018                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_numPolePairs")
    4019                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4020                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4021              $C$DW$479       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$54)
    4023                      .dwattr $C$DW$479, DW_AT_name("Lr_H")
    4024                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_Lr_H")
    4025                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4026                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$480       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$54)
    4029                      .dwattr $C$DW$480, DW_AT_name("Ls_d_H")
    4030                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_Ls_d_H")
    4031                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4032                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$481       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$54)
    4035                      .dwattr $C$DW$481, DW_AT_name("Ls_q_H")
    4036                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_Ls_q_H")
    4037                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4038                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$482       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4041                      .dwattr $C$DW$482, DW_AT_name("Rr_Ohm")
    4042                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_Rr_Ohm")
    4043                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4044                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$483       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4047                      .dwattr $C$DW$483, DW_AT_name("Rs_Ohm")
    4048                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_Rs_Ohm")
    4049                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4050                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$484       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4053                      .dwattr $C$DW$484, DW_AT_name("ratedFlux_VpHz")
    4054                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4055                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   77

    4056                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4057                      .dwendtag $C$DW$T$66
    4058              
    4059              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    4060                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4061                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4062              
    4063              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4064                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4065                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4066              $C$DW$485       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    4068                      .dwattr $C$DW$485, DW_AT_name("sinTh")
    4069                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_sinTh")
    4070                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4071                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4072              $C$DW$486       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    4074                      .dwattr $C$DW$486, DW_AT_name("cosTh")
    4075                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_cosTh")
    4076                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4077                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4078                      .dwendtag $C$DW$T$67
    4079              
    4080              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    4081                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    4082                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4083              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4084                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4085                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    4086              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    4087                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4088                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4089              
    4090              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4091                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4092                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4093              $C$DW$487       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    4095                      .dwattr $C$DW$487, DW_AT_name("Kp")
    4096                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_Kp")
    4097                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4098                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$488       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
    4101                      .dwattr $C$DW$488, DW_AT_name("Ki")
    4102                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_Ki")
    4103                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4104                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$489       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$20)
    4107                      .dwattr $C$DW$489, DW_AT_name("Kd")
    4108                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_Kd")
    4109                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4110                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   78

    4111              $C$DW$490       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    4113                      .dwattr $C$DW$490, DW_AT_name("Ui")
    4114                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_Ui")
    4115                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4116                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$491       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
    4119                      .dwattr $C$DW$491, DW_AT_name("refValue")
    4120                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_refValue")
    4121                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4122                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$492       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
    4125                      .dwattr $C$DW$492, DW_AT_name("fbackValue")
    4126                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_fbackValue")
    4127                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4128                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$493       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
    4131                      .dwattr $C$DW$493, DW_AT_name("outMin")
    4132                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_outMin")
    4133                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4134                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$494       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
    4137                      .dwattr $C$DW$494, DW_AT_name("outMax")
    4138                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_outMax")
    4139                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4140                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4141                      .dwendtag $C$DW$T$68
    4142              
    4143              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    4144                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4145                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4146              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    4147                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$39)
    4148                      .dwattr $C$DW$T$99, DW_AT_address_class(0x16)
    4149              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4150                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4151                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    4152              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    4153                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4154                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4155              
    4156              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4157                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4158                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4159              $C$DW$495       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    4161                      .dwattr $C$DW$495, DW_AT_name("maxModulation")
    4162                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_maxModulation")
    4163                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4164                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4165                      .dwendtag $C$DW$T$69
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   79

    4166              
    4167              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    4168                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4169                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4170              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4171                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4172                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    4173              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    4174                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4175                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4176              
    4177              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4178                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    4179                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4180              $C$DW$496       .dwtag  DW_TAG_member
    4181                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$20)
    4182                      .dwattr $C$DW$496, DW_AT_name("targetValue")
    4183                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_targetValue")
    4184                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4185                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4186              $C$DW$497       .dwtag  DW_TAG_member
    4187                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
    4188                      .dwattr $C$DW$497, DW_AT_name("intValue")
    4189                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_intValue")
    4190                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4191                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4192              $C$DW$498       .dwtag  DW_TAG_member
    4193                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
    4194                      .dwattr $C$DW$498, DW_AT_name("minValue")
    4195                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_minValue")
    4196                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4197                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4198              $C$DW$499       .dwtag  DW_TAG_member
    4199                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
    4200                      .dwattr $C$DW$499, DW_AT_name("maxValue")
    4201                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_maxValue")
    4202                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4203                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4204              $C$DW$500       .dwtag  DW_TAG_member
    4205                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
    4206                      .dwattr $C$DW$500, DW_AT_name("maxDelta")
    4207                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_maxDelta")
    4208                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4209                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4210                      .dwendtag $C$DW$T$70
    4211              
    4212              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    4213                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4214                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4215              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4216                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4217                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    4218              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    4219                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4220                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   80

    4221              
    4222              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4223                      .dwattr $C$DW$T$75, DW_AT_name("_USER_Params_")
    4224                      .dwattr $C$DW$T$75, DW_AT_byte_size(0xb0)
    4225              $C$DW$501       .dwtag  DW_TAG_member
    4226                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    4227                      .dwattr $C$DW$501, DW_AT_name("iqFullScaleCurrent_A")
    4228                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4229                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4230                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4231              $C$DW$502       .dwtag  DW_TAG_member
    4232                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    4233                      .dwattr $C$DW$502, DW_AT_name("iqFullScaleVoltage_V")
    4234                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4235                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4236                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4237              $C$DW$503       .dwtag  DW_TAG_member
    4238                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    4239                      .dwattr $C$DW$503, DW_AT_name("iqFullScaleFreq_Hz")
    4240                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4241                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4242                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4243              $C$DW$504       .dwtag  DW_TAG_member
    4244                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$53)
    4245                      .dwattr $C$DW$504, DW_AT_name("numIsrTicksPerCtrlTick")
    4246                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4247                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4248                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4249              $C$DW$505       .dwtag  DW_TAG_member
    4250                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$53)
    4251                      .dwattr $C$DW$505, DW_AT_name("numCtrlTicksPerCurrentTick")
    4252                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4253                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4254                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4255              $C$DW$506       .dwtag  DW_TAG_member
    4256                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$53)
    4257                      .dwattr $C$DW$506, DW_AT_name("numCtrlTicksPerEstTick")
    4258                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4259                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4260                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4261              $C$DW$507       .dwtag  DW_TAG_member
    4262                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$53)
    4263                      .dwattr $C$DW$507, DW_AT_name("numCtrlTicksPerSpeedTick")
    4264                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4265                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4266                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4267              $C$DW$508       .dwtag  DW_TAG_member
    4268                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$53)
    4269                      .dwattr $C$DW$508, DW_AT_name("numCtrlTicksPerTrajTick")
    4270                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4271                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4272                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4273              $C$DW$509       .dwtag  DW_TAG_member
    4274                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$22)
    4275                      .dwattr $C$DW$509, DW_AT_name("numCurrentSensors")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   81

    4276                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_numCurrentSensors")
    4277                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4278                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    4279              $C$DW$510       .dwtag  DW_TAG_member
    4280                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$22)
    4281                      .dwattr $C$DW$510, DW_AT_name("numVoltageSensors")
    4282                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_numVoltageSensors")
    4283                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4284                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    4285              $C$DW$511       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    4287                      .dwattr $C$DW$511, DW_AT_name("offsetPole_rps")
    4288                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_offsetPole_rps")
    4289                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4290                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4291              $C$DW$512       .dwtag  DW_TAG_member
    4292                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$54)
    4293                      .dwattr $C$DW$512, DW_AT_name("fluxPole_rps")
    4294                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_fluxPole_rps")
    4295                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4296                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4297              $C$DW$513       .dwtag  DW_TAG_member
    4298                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$54)
    4299                      .dwattr $C$DW$513, DW_AT_name("zeroSpeedLimit")
    4300                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4301                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4302                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4303              $C$DW$514       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    4305                      .dwattr $C$DW$514, DW_AT_name("forceAngleFreq_Hz")
    4306                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4307                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4308                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4309              $C$DW$515       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    4311                      .dwattr $C$DW$515, DW_AT_name("maxAccel_Hzps")
    4312                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4313                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4314                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    4315              $C$DW$516       .dwtag  DW_TAG_member
    4316                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    4317                      .dwattr $C$DW$516, DW_AT_name("maxAccel_est_Hzps")
    4318                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4319                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4320                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4321              $C$DW$517       .dwtag  DW_TAG_member
    4322                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$54)
    4323                      .dwattr $C$DW$517, DW_AT_name("directionPole_rps")
    4324                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_directionPole_rps")
    4325                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4326                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4327              $C$DW$518       .dwtag  DW_TAG_member
    4328                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$54)
    4329                      .dwattr $C$DW$518, DW_AT_name("speedPole_rps")
    4330                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_speedPole_rps")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   82

    4331                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4332                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4333              $C$DW$519       .dwtag  DW_TAG_member
    4334                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    4335                      .dwattr $C$DW$519, DW_AT_name("dcBusPole_rps")
    4336                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4337                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4338                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4339              $C$DW$520       .dwtag  DW_TAG_member
    4340                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4341                      .dwattr $C$DW$520, DW_AT_name("fluxFraction")
    4342                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_fluxFraction")
    4343                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4344                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4345              $C$DW$521       .dwtag  DW_TAG_member
    4346                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4347                      .dwattr $C$DW$521, DW_AT_name("indEst_speedMaxFraction")
    4348                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4349                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4350                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4351              $C$DW$522       .dwtag  DW_TAG_member
    4352                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4353                      .dwattr $C$DW$522, DW_AT_name("powerWarpGain")
    4354                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_powerWarpGain")
    4355                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4356                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4357              $C$DW$523       .dwtag  DW_TAG_member
    4358                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$53)
    4359                      .dwattr $C$DW$523, DW_AT_name("systemFreq_MHz")
    4360                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4361                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4362                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4363              $C$DW$524       .dwtag  DW_TAG_member
    4364                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
    4365                      .dwattr $C$DW$524, DW_AT_name("pwmPeriod_usec")
    4366                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4367                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4368                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4369              $C$DW$525       .dwtag  DW_TAG_member
    4370                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4371                      .dwattr $C$DW$525, DW_AT_name("voltage_sf")
    4372                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_voltage_sf")
    4373                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4374                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4375              $C$DW$526       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4377                      .dwattr $C$DW$526, DW_AT_name("current_sf")
    4378                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_current_sf")
    4379                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4380                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4381              $C$DW$527       .dwtag  DW_TAG_member
    4382                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4383                      .dwattr $C$DW$527, DW_AT_name("voltageFilterPole_rps")
    4384                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4385                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   83

    4386                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4387              $C$DW$528       .dwtag  DW_TAG_member
    4388                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4389                      .dwattr $C$DW$528, DW_AT_name("maxVsMag_pu")
    4390                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4391                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4392                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4393              $C$DW$529       .dwtag  DW_TAG_member
    4394                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$54)
    4395                      .dwattr $C$DW$529, DW_AT_name("estKappa")
    4396                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_estKappa")
    4397                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4398                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4399              $C$DW$530       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$65)
    4401                      .dwattr $C$DW$530, DW_AT_name("motor_type")
    4402                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_motor_type")
    4403                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4404                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4405              $C$DW$531       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$53)
    4407                      .dwattr $C$DW$531, DW_AT_name("motor_numPolePairs")
    4408                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4409                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4410                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4411              $C$DW$532       .dwtag  DW_TAG_member
    4412                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$54)
    4413                      .dwattr $C$DW$532, DW_AT_name("motor_ratedFlux")
    4414                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4415                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4416                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4417              $C$DW$533       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$54)
    4419                      .dwattr $C$DW$533, DW_AT_name("motor_Rr")
    4420                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_motor_Rr")
    4421                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4422                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4423              $C$DW$534       .dwtag  DW_TAG_member
    4424                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$54)
    4425                      .dwattr $C$DW$534, DW_AT_name("motor_Rs")
    4426                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_motor_Rs")
    4427                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4428                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4429              $C$DW$535       .dwtag  DW_TAG_member
    4430                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$54)
    4431                      .dwattr $C$DW$535, DW_AT_name("motor_Ls_d")
    4432                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_motor_Ls_d")
    4433                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4434                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4435              $C$DW$536       .dwtag  DW_TAG_member
    4436                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$54)
    4437                      .dwattr $C$DW$536, DW_AT_name("motor_Ls_q")
    4438                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_motor_Ls_q")
    4439                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4440                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:29 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\2788410                         PAGE   84

    4441              $C$DW$537       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$54)
    4443                      .dwattr $C$DW$537, DW_AT_name("maxCurrent")
    4444                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_maxCurrent")
    4445                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4446                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4447              $C$DW$538       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$54)
    4449                      .dwattr $C$DW$538, DW_AT_name("maxCurrent_resEst")
    4450                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4451                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4452                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4453              $C$DW$539       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$54)
    4455                      .dwattr $C$DW$539, DW_AT_name("maxCurrent_indEst")
    4456                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4457                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4458                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$540       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$54)
    4461                      .dwattr $C$DW$540, DW_AT_name("maxCurrentSlope")
    4462                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4463                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4464                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4465              $C$DW$541       .dwtag  DW_TAG_member
    4466                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$54)
