TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Mon Aug 03 18:20:30 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/drivers/drvic/drv8301/s
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3371              $C$DW$374       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_1_Word"), DW_AT_const_value(0x100)
    3372              $C$DW$375       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_2_Words"), DW_AT_const_value(0x200)
    3373              $C$DW$376       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_3_Words"), DW_AT_const_value(0x300)
    3374              $C$DW$377       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_4_Words"), DW_AT_const_value(0x400)
    3375                      .dwendtag $C$DW$T$97
    3376              
    3377              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoStatus_e")
    3378                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    3379                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3380              $C$DW$378       .dwtag  DW_TAG_TI_far_type
    3381                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$98)
    3382              $C$DW$T$99      .dwtag  DW_TAG_volatile_type
    3383                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$378)
    3384              
    3385              $C$DW$T$103     .dwtag  DW_TAG_enumeration_type
    3386                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
    3387              $C$DW$379       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_CtrlMode_Read"), DW_AT_const_value(-32768)
    3388              $C$DW$380       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_CtrlMode_Write"), DW_AT_const_value(0x00)
    3389                      .dwendtag $C$DW$T$103
    3390              
    3391              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_CtrlMode_e")
    3392                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    3393                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3394              
    3395              $C$DW$T$106     .dwtag  DW_TAG_enumeration_type
    3396                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    3397              $C$DW$381       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Status_1"), DW_AT_const_value(0x00)
    3398              $C$DW$382       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Status_2"), DW_AT_const_value(0x800)
    3399              $C$DW$383       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Control_1"), DW_AT_const_value(0x1000)
    3400              $C$DW$384       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Control_2"), DW_AT_const_value(0x1800)
    3401                      .dwendtag $C$DW$T$106
    3402              
    3403              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_RegName_e")
    3404                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    3405                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3406              $C$DW$385       .dwtag  DW_TAG_TI_far_type
    3407                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$107)
    3408              $C$DW$T$108     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   66

    3409                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$385)
    3410              
    3411              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    3412                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    3413              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_NoFault"), DW_AT_const_value(0x00)
    3414              $C$DW$387       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETLC_OC"), DW_AT_const_value(0x01)
    3415              $C$DW$388       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETHC_OC"), DW_AT_const_value(0x02)
    3416              $C$DW$389       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETLB_OC"), DW_AT_const_value(0x04)
    3417              $C$DW$390       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETHB_OC"), DW_AT_const_value(0x08)
    3418              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETLA_OC"), DW_AT_const_value(0x10)
    3419              $C$DW$392       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETHA_OC"), DW_AT_const_value(0x20)
    3420              $C$DW$393       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_OTW"), DW_AT_const_value(0x40)
    3421              $C$DW$394       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_OTSD"), DW_AT_const_value(0x80)
    3422              $C$DW$395       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_PVDD_UV"), DW_AT_const_value(0x100)
    3423              $C$DW$396       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_GVDD_UV"), DW_AT_const_value(0x200)
    3424              $C$DW$397       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_GVDD_OV"), DW_AT_const_value(0x400)
    3425                      .dwendtag $C$DW$T$109
    3426              
    3427              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_FaultType_e")
    3428                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    3429                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3430              
    3431              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3432                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8301_Obj_")
    3433                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    3434              $C$DW$398       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    3436                      .dwattr $C$DW$398, DW_AT_name("spiHandle")
    3437                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_spiHandle")
    3438                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3439                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$399       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$22)
    3442                      .dwattr $C$DW$399, DW_AT_name("gpioHandle")
    3443                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_gpioHandle")
    3444                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3445                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3446              $C$DW$400       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
    3448                      .dwattr $C$DW$400, DW_AT_name("gpioNumber")
    3449                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_gpioNumber")
    3450                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3451                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3452              $C$DW$401       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    3454                      .dwattr $C$DW$401, DW_AT_name("RxTimeOut")
    3455                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_RxTimeOut")
    3456                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3457                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3458              $C$DW$402       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    3460                      .dwattr $C$DW$402, DW_AT_name("enableTimeOut")
    3461                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_enableTimeOut")
    3462                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3463                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   67

    3464                      .dwendtag $C$DW$T$26
    3465              
    3466              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    3467                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$26)
    3468                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3469              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    3470                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    3471                      .dwattr $C$DW$T$69, DW_AT_address_class(0x16)
    3472              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    3473                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    3474                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3475              $C$DW$403       .dwtag  DW_TAG_TI_far_type
    3476                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$70)
    3477              $C$DW$T$114     .dwtag  DW_TAG_const_type
    3478                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$403)
    3479              
    3480              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3481                      .dwattr $C$DW$T$37, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    3482                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x05)
    3483              $C$DW$404       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$28)
    3485                      .dwattr $C$DW$404, DW_AT_name("DRV8301_CURRENT")
    3486                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    3487                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3488                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3489              $C$DW$405       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$30)
    3491                      .dwattr $C$DW$405, DW_AT_name("DRV8301_RESET")
    3492                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_DRV8301_RESET")
    3493                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3494                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3495              $C$DW$406       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$32)
    3497                      .dwattr $C$DW$406, DW_AT_name("PWM_MODE")
    3498                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_PWM_MODE")
    3499                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3500                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3501              $C$DW$407       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$34)
    3503                      .dwattr $C$DW$407, DW_AT_name("OC_MODE")
    3504                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_OC_MODE")
    3505                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3506                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3507              $C$DW$408       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$36)
    3509                      .dwattr $C$DW$408, DW_AT_name("OC_ADJ_SET")
    3510                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    3511                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3512                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3513                      .dwendtag $C$DW$T$37
    3514              
    3515              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    3516                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$37)
    3517                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3518              
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   68

    3519              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3520                      .dwattr $C$DW$T$46, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    3521                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    3522              $C$DW$409       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$39)
    3524                      .dwattr $C$DW$409, DW_AT_name("OCTW_SET")
    3525                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_OCTW_SET")
    3526                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3527                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$410       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$41)
    3530                      .dwattr $C$DW$410, DW_AT_name("GAIN")
    3531                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GAIN")
    3532                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3533                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$411       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$43)
    3536                      .dwattr $C$DW$411, DW_AT_name("DC_CAL_CH1p2")
    3537                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    3538                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3539                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$412       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$45)
    3542                      .dwattr $C$DW$412, DW_AT_name("OC_TOFF")
    3543                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_OC_TOFF")
    3544                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3545                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3546                      .dwendtag $C$DW$T$46
    3547              
    3548              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    3549                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$46)
    3550                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3551              
    3552              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3553                      .dwattr $C$DW$T$47, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    3554                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0b)
    3555              $C$DW$413       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$25)
    3557                      .dwattr $C$DW$413, DW_AT_name("FAULT")
    3558                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_FAULT")
    3559                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3560                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3561              $C$DW$414       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    3563                      .dwattr $C$DW$414, DW_AT_name("GVDD_UV")
    3564                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GVDD_UV")
    3565                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3566                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3567              $C$DW$415       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
    3569                      .dwattr $C$DW$415, DW_AT_name("PVDD_UV")
    3570                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_PVDD_UV")
    3571                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3572                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$416       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   69

    3574                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$25)
    3575                      .dwattr $C$DW$416, DW_AT_name("OTSD")
    3576                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_OTSD")
    3577                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3578                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$417       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$25)
    3581                      .dwattr $C$DW$417, DW_AT_name("OTW")
    3582                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_OTW")
    3583                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3584                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$418       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
    3587                      .dwattr $C$DW$418, DW_AT_name("FETHA_OC")
    3588                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_FETHA_OC")
    3589                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3590                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$419       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$25)
    3593                      .dwattr $C$DW$419, DW_AT_name("FETLA_OC")
    3594                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_FETLA_OC")
    3595                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3596                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$420       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
    3599                      .dwattr $C$DW$420, DW_AT_name("FETHB_OC")
    3600                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_FETHB_OC")
    3601                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3602                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$421       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$25)
    3605                      .dwattr $C$DW$421, DW_AT_name("FETLB_OC")
    3606                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_FETLB_OC")
    3607                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3608                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$422       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
    3611                      .dwattr $C$DW$422, DW_AT_name("FETHC_OC")
    3612                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_FETHC_OC")
    3613                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3614                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3615              $C$DW$423       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$25)
    3617                      .dwattr $C$DW$423, DW_AT_name("FETLC_OC")
    3618                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_FETLC_OC")
    3619                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3620                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3621                      .dwendtag $C$DW$T$47
    3622              
    3623              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    3624                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$47)
    3625                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3626              
    3627              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3628                      .dwattr $C$DW$T$49, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   70

    3629                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3630              $C$DW$424       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$25)
    3632                      .dwattr $C$DW$424, DW_AT_name("GVDD_OV")
    3633                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_GVDD_OV")
    3634                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3635                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$425       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$48)
    3638                      .dwattr $C$DW$425, DW_AT_name("DeviceID")
    3639                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DeviceID")
    3640                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3641                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3642                      .dwendtag $C$DW$T$49
    3643              
    3644              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    3645                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    3646                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3647              
    3648              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3649                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    3650                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x18)
    3651              $C$DW$426       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$50)
    3653                      .dwattr $C$DW$426, DW_AT_name("Stat_Reg_1")
    3654                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Stat_Reg_1")
    3655                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3656                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3657              $C$DW$427       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$51)
    3659                      .dwattr $C$DW$427, DW_AT_name("Stat_Reg_2")
    3660                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Stat_Reg_2")
    3661                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3662                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3663              $C$DW$428       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$52)
    3665                      .dwattr $C$DW$428, DW_AT_name("Ctrl_Reg_1")
    3666                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    3667                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3668                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$429       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$53)
    3671                      .dwattr $C$DW$429, DW_AT_name("Ctrl_Reg_2")
    3672                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    3673                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3674                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$430       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$25)
    3677                      .dwattr $C$DW$430, DW_AT_name("SndCmd")
    3678                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_SndCmd")
    3679                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3680                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$431       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$25)
    3683                      .dwattr $C$DW$431, DW_AT_name("RcvCmd")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   71

    3684                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_RcvCmd")
    3685                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3686                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3687                      .dwendtag $C$DW$T$54
    3688              
    3689              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    3690                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$54)
    3691                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3692              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    3693                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3694                      .dwattr $C$DW$T$121, DW_AT_address_class(0x16)
    3695              $C$DW$432       .dwtag  DW_TAG_TI_far_type
    3696                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$121)
    3697              $C$DW$T$122     .dwtag  DW_TAG_const_type
    3698                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$432)
    3699              
    3700              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    3701                      .dwattr $C$DW$T$64, DW_AT_name("_GPIO_Obj_")
    3702                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6a)
    3703              $C$DW$433       .dwtag  DW_TAG_member
    3704                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$56)
    3705                      .dwattr $C$DW$433, DW_AT_name("GPACTRL")
    3706                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_GPACTRL")
    3707                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3708                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3709              $C$DW$434       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$56)
    3711                      .dwattr $C$DW$434, DW_AT_name("GPAQSEL1")
    3712                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_GPAQSEL1")
    3713                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3714                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3715              $C$DW$435       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$56)
    3717                      .dwattr $C$DW$435, DW_AT_name("GPAQSEL2")
    3718                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_GPAQSEL2")
    3719                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3720                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3721              $C$DW$436       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$56)
    3723                      .dwattr $C$DW$436, DW_AT_name("GPAMUX1")
    3724                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_GPAMUX1")
    3725                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3726                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3727              $C$DW$437       .dwtag  DW_TAG_member
    3728                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$56)
    3729                      .dwattr $C$DW$437, DW_AT_name("GPAMUX2")
    3730                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPAMUX2")
    3731                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3732                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3733              $C$DW$438       .dwtag  DW_TAG_member
    3734                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    3735                      .dwattr $C$DW$438, DW_AT_name("GPADIR")
    3736                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GPADIR")
    3737                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3738                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   72

    3739              $C$DW$439       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    3741                      .dwattr $C$DW$439, DW_AT_name("GPAPUD")
    3742                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GPAPUD")
    3743                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3744                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3745              $C$DW$440       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$58)
    3747                      .dwattr $C$DW$440, DW_AT_name("rsvd_1")
    3748                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd_1")
    3749                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3750                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$441       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    3753                      .dwattr $C$DW$441, DW_AT_name("GPBCTRL")
    3754                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_GPBCTRL")
    3755                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3756                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$442       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    3759                      .dwattr $C$DW$442, DW_AT_name("GPBQSEL1")
    3760                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_GPBQSEL1")
    3761                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3762                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$443       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$58)
    3765                      .dwattr $C$DW$443, DW_AT_name("rsvd_2")
    3766                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_rsvd_2")
    3767                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3768                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3769              $C$DW$444       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    3771                      .dwattr $C$DW$444, DW_AT_name("GPBMUX1")
    3772                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_GPBMUX1")
    3773                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3774                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3775              $C$DW$445       .dwtag  DW_TAG_member
    3776                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$58)
    3777                      .dwattr $C$DW$445, DW_AT_name("rsvd_3")
    3778                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_rsvd_3")
    3779                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3780                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3781              $C$DW$446       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    3783                      .dwattr $C$DW$446, DW_AT_name("GPBDIR")
    3784                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_GPBDIR")
    3785                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3786                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3787              $C$DW$447       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    3789                      .dwattr $C$DW$447, DW_AT_name("GPBPUD")
    3790                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_GPBPUD")
    3791                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3792                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3793              $C$DW$448       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   73

    3794                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$59)
    3795                      .dwattr $C$DW$448, DW_AT_name("rsvd_4")
    3796                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_rsvd_4")
    3797                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3798                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$449       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$56)
    3801                      .dwattr $C$DW$449, DW_AT_name("AIOMUX1")
    3802                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_AIOMUX1")
    3803                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3804                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3805              $C$DW$450       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$58)
    3807                      .dwattr $C$DW$450, DW_AT_name("rsvd_5")
    3808                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_rsvd_5")
    3809                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3810                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3811              $C$DW$451       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$56)
    3813                      .dwattr $C$DW$451, DW_AT_name("AIODIR")
    3814                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_AIODIR")
    3815                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3816                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$452       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$60)
    3819                      .dwattr $C$DW$452, DW_AT_name("rsvd_6")
    3820                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd_6")
    3821                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3822                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3823              $C$DW$453       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$56)
    3825                      .dwattr $C$DW$453, DW_AT_name("GPADAT")
    3826                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_GPADAT")
    3827                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3828                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$454       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$56)
    3831                      .dwattr $C$DW$454, DW_AT_name("GPASET")
    3832                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_GPASET")
    3833                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3834                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$455       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$56)
    3837                      .dwattr $C$DW$455, DW_AT_name("GPACLEAR")
    3838                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_GPACLEAR")
    3839                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3840                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$456       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$56)
    3843                      .dwattr $C$DW$456, DW_AT_name("GPATOGGLE")
    3844                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_GPATOGGLE")
    3845                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3846                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$457       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   74

    3849                      .dwattr $C$DW$457, DW_AT_name("GPBDAT")
    3850                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_GPBDAT")
    3851                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3852                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$458       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$56)
    3855                      .dwattr $C$DW$458, DW_AT_name("GPBSET")
    3856                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_GPBSET")
    3857                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3858                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3859              $C$DW$459       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$56)
    3861                      .dwattr $C$DW$459, DW_AT_name("GPBCLEAR")
    3862                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_GPBCLEAR")
    3863                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3864                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3865              $C$DW$460       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$56)
    3867                      .dwattr $C$DW$460, DW_AT_name("GPBTOGGLE")
    3868                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_GPBTOGGLE")
    3869                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3870                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3871              $C$DW$461       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$61)
    3873                      .dwattr $C$DW$461, DW_AT_name("rsvd_7")
    3874                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_rsvd_7")
    3875                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3876                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3877              $C$DW$462       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$56)
    3879                      .dwattr $C$DW$462, DW_AT_name("AIODAT")
    3880                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_AIODAT")
    3881                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3882                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$463       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$56)
    3885                      .dwattr $C$DW$463, DW_AT_name("AIOSET")
    3886                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_AIOSET")
    3887                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    3888                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3889              $C$DW$464       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$56)
    3891                      .dwattr $C$DW$464, DW_AT_name("AIOCLEAR")
    3892                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_AIOCLEAR")
    3893                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3894                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3895              $C$DW$465       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$56)
    3897                      .dwattr $C$DW$465, DW_AT_name("AIOTOGGLE")
    3898                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_AIOTOGGLE")
    3899                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3900                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3901              $C$DW$466       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$62)
    3903                      .dwattr $C$DW$466, DW_AT_name("GPIOXINTnSEL")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   75

    3904                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    3905                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3906                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3907              $C$DW$467       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$63)
    3909                      .dwattr $C$DW$467, DW_AT_name("rsvd_8")
    3910                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_rsvd_8")
    3911                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    3912                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3913              $C$DW$468       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$56)
    3915                      .dwattr $C$DW$468, DW_AT_name("GPIOLPMSEL")
    3916                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    3917                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3918                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3919                      .dwendtag $C$DW$T$64
    3920              
    3921              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    3922                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$64)
    3923                      .dwattr $C$DW$T$21, DW_AT_address_class(0x16)
    3924              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    3925                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3926                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3927              $C$DW$469       .dwtag  DW_TAG_TI_far_type
    3928                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$22)
    3929              $C$DW$T$125     .dwtag  DW_TAG_const_type
    3930                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$469)
    3931              
    3932              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3933                      .dwattr $C$DW$T$65, DW_AT_name("_SPI_Obj_")
    3934                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    3935              $C$DW$470       .dwtag  DW_TAG_member
    3936                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$57)
    3937                      .dwattr $C$DW$470, DW_AT_name("SPICCR")
    3938                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SPICCR")
    3939                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3940                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3941              $C$DW$471       .dwtag  DW_TAG_member
    3942                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$57)
    3943                      .dwattr $C$DW$471, DW_AT_name("SPICTL")
    3944                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_SPICTL")
    3945                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3946                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3947              $C$DW$472       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$57)
    3949                      .dwattr $C$DW$472, DW_AT_name("SPIST")
    3950                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_SPIST")
    3951                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3952                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3953              $C$DW$473       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$57)
    3955                      .dwattr $C$DW$473, DW_AT_name("rsvd_1")
    3956                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd_1")
    3957                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3958                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   76

    3959              $C$DW$474       .dwtag  DW_TAG_member
    3960                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$57)
    3961                      .dwattr $C$DW$474, DW_AT_name("SPIBRR")
    3962                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_SPIBRR")
    3963                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3964                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3965              $C$DW$475       .dwtag  DW_TAG_member
    3966                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$57)
    3967                      .dwattr $C$DW$475, DW_AT_name("rsvd_2")
    3968                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_rsvd_2")
    3969                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3970                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3971              $C$DW$476       .dwtag  DW_TAG_member
    3972                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$57)
    3973                      .dwattr $C$DW$476, DW_AT_name("SPIEMU")
    3974                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_SPIEMU")
    3975                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3976                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3977              $C$DW$477       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$57)
    3979                      .dwattr $C$DW$477, DW_AT_name("SPIRXBUF")
    3980                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_SPIRXBUF")
    3981                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3982                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3983              $C$DW$478       .dwtag  DW_TAG_member
    3984                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$57)
    3985                      .dwattr $C$DW$478, DW_AT_name("SPITXBUF")
    3986                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_SPITXBUF")
    3987                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3988                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3989              $C$DW$479       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$57)
    3991                      .dwattr $C$DW$479, DW_AT_name("SPIDAT")
    3992                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_SPIDAT")
    3993                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3994                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$480       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$57)
    3997                      .dwattr $C$DW$480, DW_AT_name("SPIFFTX")
    3998                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_SPIFFTX")
    3999                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4000                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$481       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$57)
    4003                      .dwattr $C$DW$481, DW_AT_name("SPIFFRX")
    4004                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_SPIFFRX")
    4005                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4006                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4007              $C$DW$482       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$57)
    4009                      .dwattr $C$DW$482, DW_AT_name("SPIFFCT")
    4010                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_SPIFFCT")
    4011                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4012                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4013              $C$DW$483       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   77

    4014                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$58)
    4015                      .dwattr $C$DW$483, DW_AT_name("rsvd_3")
    4016                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_rsvd_3")
    4017                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4018                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4019              $C$DW$484       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$57)
    4021                      .dwattr $C$DW$484, DW_AT_name("SPIPRI")
    4022                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_SPIPRI")
    4023                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4024                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4025                      .dwendtag $C$DW$T$65
    4026              
    4027              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
    4028                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$65)
    4029                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4030              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4031                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$65)
    4032                      .dwattr $C$DW$T$19, DW_AT_address_class(0x16)
    4033              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
    4034                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4035                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4036              $C$DW$485       .dwtag  DW_TAG_TI_far_type
    4037                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    4038              $C$DW$T$128     .dwtag  DW_TAG_const_type
    4039                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$485)
    4040              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4041                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    4042              $C$DW$486       .dwtag  DW_TAG_TI_far_type
    4043                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$3)
    4044              $C$DW$T$130     .dwtag  DW_TAG_const_type
    4045                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$486)
    4046              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4047                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4048                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4049                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4050              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4051                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4052                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4053                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4054              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4055                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4056                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4057                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4058              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4059                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4060                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4061                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4062              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4063                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4064                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4065                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4066              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4067                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4068                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:31 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\0548811                         PAGE   78

    4069                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4070              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    4071                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$9)
    4072                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4073              $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Word_t")
    4074                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$48)
