TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Mon Aug 03 18:20:50 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/drivers/pwm/src/32b/f28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.2.3\bin\opt2000.exe C:\\Users\\a0220341\\AppData\\Local\\Te

    7281                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$776)
    7282              
    7283              $C$DW$T$114     .dwtag  DW_TAG_enumeration_type
    7284                      .dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
    7285              $C$DW$777       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_ShadowMode_Shadow"), DW_AT_const_value(0x00)
    7286              $C$DW$778       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_ShadowMode_Immediate"), DW_AT_const_value(0x01)
    7287                      .dwendtag $C$DW$T$114
    7288              
    7289              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_ShadowMode_e")
    7290                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    7291                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    7292              $C$DW$779       .dwtag  DW_TAG_TI_far_type
    7293                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$115)
    7294              $C$DW$T$116     .dwtag  DW_TAG_const_type
    7295                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$779)
    7296              
    7297              $C$DW$T$117     .dwtag  DW_TAG_enumeration_type
    7298                      .dwattr $C$DW$T$117, DW_AT_byte_size(0x01)
    7299              $C$DW$780       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_EPWMxSYNC"), DW_AT_const_value(0x00)
    7300              $C$DW$781       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_CounterEqualZero"), DW_AT_const_value(0x1
    7301              $C$DW$782       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_CounterEqualCounterCompareZero"), DW_AT_c
    7302              $C$DW$783       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_Disable"), DW_AT_const_value(0x30)
    7303                      .dwendtag $C$DW$T$117
    7304              
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  136

    7305              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SyncMode_e")
    7306                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    7307                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    7308              $C$DW$784       .dwtag  DW_TAG_TI_far_type
    7309                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$118)
    7310              $C$DW$T$119     .dwtag  DW_TAG_const_type
    7311                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$784)
    7312              
    7313              $C$DW$T$120     .dwtag  DW_TAG_enumeration_type
    7314                      .dwattr $C$DW$T$120, DW_AT_byte_size(0x01)
    7315              $C$DW$785       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_Disabled"), DW_AT_const_value(0
    7316              $C$DW$786       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLX"), DW_AT_const_valu
    7317              $C$DW$787       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHH_DCxLX"), DW_AT_const_valu
    7318              $C$DW$788       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLL"), DW_AT_const_valu
    7319              $C$DW$789       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLH"), DW_AT_const_valu
    7320              $C$DW$790       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLH"), DW_AT_const_valu
    7321                      .dwendtag $C$DW$T$120
    7322              
    7323              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_TripZoneDCEventSel_e")
    7324                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    7325                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    7326              $C$DW$791       .dwtag  DW_TAG_TI_far_type
    7327                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$121)
    7328              $C$DW$T$122     .dwtag  DW_TAG_const_type
    7329                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$791)
    7330              
    7331              $C$DW$T$123     .dwtag  DW_TAG_enumeration_type
    7332                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x01)
    7333              $C$DW$792       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_HighImp"), DW_AT_const_value(0x00)
    7334              $C$DW$793       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_EPWM_High"), DW_AT_const_value(0x01)
    7335              $C$DW$794       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_EPWM_Low"), DW_AT_const_value(0x02)
    7336              $C$DW$795       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_DoNothing"), DW_AT_const_value(0x03)
    7337                      .dwendtag $C$DW$T$123
    7338              
    7339              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_TripZoneState_e")
    7340                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    7341                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    7342              $C$DW$796       .dwtag  DW_TAG_TI_far_type
    7343                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$124)
    7344              $C$DW$T$125     .dwtag  DW_TAG_const_type
    7345                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$796)
    7346              
    7347              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7348                      .dwattr $C$DW$T$23, DW_AT_name("_PWM_Obj_")
    7349                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x3a)
    7350              $C$DW$797       .dwtag  DW_TAG_member
    7351                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$20)
    7352                      .dwattr $C$DW$797, DW_AT_name("TBCTL")
    7353                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_TBCTL")
    7354                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7355                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7356              $C$DW$798       .dwtag  DW_TAG_member
    7357                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$20)
    7358                      .dwattr $C$DW$798, DW_AT_name("TBSTS")
    7359                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_TBSTS")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  137

    7360                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7361                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7362              $C$DW$799       .dwtag  DW_TAG_member
    7363                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$20)
    7364                      .dwattr $C$DW$799, DW_AT_name("TBPHSHR")
    7365                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_TBPHSHR")
    7366                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7367                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7368              $C$DW$800       .dwtag  DW_TAG_member
    7369                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$20)
    7370                      .dwattr $C$DW$800, DW_AT_name("TBPHS")
    7371                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_TBPHS")
    7372                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7373                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7374              $C$DW$801       .dwtag  DW_TAG_member
    7375                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$20)
    7376                      .dwattr $C$DW$801, DW_AT_name("TBCTR")
    7377                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_TBCTR")
    7378                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7379                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7380              $C$DW$802       .dwtag  DW_TAG_member
    7381                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
    7382                      .dwattr $C$DW$802, DW_AT_name("TBPRD")
    7383                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_TBPRD")
    7384                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7385                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7386              $C$DW$803       .dwtag  DW_TAG_member
    7387                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
    7388                      .dwattr $C$DW$803, DW_AT_name("TBPRDHR")
    7389                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_TBPRDHR")
    7390                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7391                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7392              $C$DW$804       .dwtag  DW_TAG_member
    7393                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$20)
    7394                      .dwattr $C$DW$804, DW_AT_name("CMPCTL")
    7395                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_CMPCTL")
    7396                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7397                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7398              $C$DW$805       .dwtag  DW_TAG_member
    7399                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
    7400                      .dwattr $C$DW$805, DW_AT_name("CMPAHR")
    7401                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_CMPAHR")
    7402                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7403                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7404              $C$DW$806       .dwtag  DW_TAG_member
    7405                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
    7406                      .dwattr $C$DW$806, DW_AT_name("CMPA")
    7407                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_CMPA")
    7408                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7409                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7410              $C$DW$807       .dwtag  DW_TAG_member
    7411                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$20)
    7412                      .dwattr $C$DW$807, DW_AT_name("CMPB")
    7413                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_CMPB")
    7414                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  138

    7415                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7416              $C$DW$808       .dwtag  DW_TAG_member
    7417                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$20)
    7418                      .dwattr $C$DW$808, DW_AT_name("AQCTLA")
    7419                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_AQCTLA")
    7420                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7421                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7422              $C$DW$809       .dwtag  DW_TAG_member
    7423                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$20)
    7424                      .dwattr $C$DW$809, DW_AT_name("AQCTLB")
    7425                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_AQCTLB")
    7426                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7427                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7428              $C$DW$810       .dwtag  DW_TAG_member
    7429                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
    7430                      .dwattr $C$DW$810, DW_AT_name("AQSFRC")
    7431                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_AQSFRC")
    7432                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7433                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7434              $C$DW$811       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
    7436                      .dwattr $C$DW$811, DW_AT_name("AQCSFRC")
    7437                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_AQCSFRC")
    7438                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7439                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7440              $C$DW$812       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$20)
    7442                      .dwattr $C$DW$812, DW_AT_name("DBCTL")
    7443                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_DBCTL")
    7444                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7445                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7446              $C$DW$813       .dwtag  DW_TAG_member
    7447                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$20)
    7448                      .dwattr $C$DW$813, DW_AT_name("DBRED")
    7449                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_DBRED")
    7450                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7451                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7452              $C$DW$814       .dwtag  DW_TAG_member
    7453                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$20)
    7454                      .dwattr $C$DW$814, DW_AT_name("DBFED")
    7455                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_DBFED")
    7456                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7457                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7458              $C$DW$815       .dwtag  DW_TAG_member
    7459                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
    7460                      .dwattr $C$DW$815, DW_AT_name("TZSEL")
    7461                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_TZSEL")
    7462                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7463                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7464              $C$DW$816       .dwtag  DW_TAG_member
    7465                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$20)
    7466                      .dwattr $C$DW$816, DW_AT_name("TZDCSEL")
    7467                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_TZDCSEL")
    7468                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7469                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  139

    7470              $C$DW$817       .dwtag  DW_TAG_member
    7471                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
    7472                      .dwattr $C$DW$817, DW_AT_name("TZCTL")
    7473                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_TZCTL")
    7474                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7475                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7476              $C$DW$818       .dwtag  DW_TAG_member
    7477                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$20)
    7478                      .dwattr $C$DW$818, DW_AT_name("TZEINT")
    7479                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_TZEINT")
    7480                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7481                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7482              $C$DW$819       .dwtag  DW_TAG_member
    7483                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$20)
    7484                      .dwattr $C$DW$819, DW_AT_name("TZFLG")
    7485                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_TZFLG")
    7486                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7487                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7488              $C$DW$820       .dwtag  DW_TAG_member
    7489                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$20)
    7490                      .dwattr $C$DW$820, DW_AT_name("TZCLR")
    7491                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_TZCLR")
    7492                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7493                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7494              $C$DW$821       .dwtag  DW_TAG_member
    7495                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$20)
    7496                      .dwattr $C$DW$821, DW_AT_name("TZFRC")
    7497                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_TZFRC")
    7498                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7499                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7500              $C$DW$822       .dwtag  DW_TAG_member
    7501                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$20)
    7502                      .dwattr $C$DW$822, DW_AT_name("ETSEL")
    7503                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_ETSEL")
    7504                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    7505                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7506              $C$DW$823       .dwtag  DW_TAG_member
    7507                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$20)
    7508                      .dwattr $C$DW$823, DW_AT_name("ETPS")
    7509                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_ETPS")
    7510                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7511                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7512              $C$DW$824       .dwtag  DW_TAG_member
    7513                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$20)
    7514                      .dwattr $C$DW$824, DW_AT_name("ETFLG")
    7515                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_ETFLG")
    7516                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    7517                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7518              $C$DW$825       .dwtag  DW_TAG_member
    7519                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$20)
    7520                      .dwattr $C$DW$825, DW_AT_name("ETCLR")
    7521                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_ETCLR")
    7522                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7523                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7524              $C$DW$826       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  140

    7525                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$20)
    7526                      .dwattr $C$DW$826, DW_AT_name("ETFRC")
    7527                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_ETFRC")
    7528                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7529                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7530              $C$DW$827       .dwtag  DW_TAG_member
    7531                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$20)
    7532                      .dwattr $C$DW$827, DW_AT_name("PCCTL")
    7533                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_PCCTL")
    7534                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7535                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7536              $C$DW$828       .dwtag  DW_TAG_member
    7537                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$20)
    7538                      .dwattr $C$DW$828, DW_AT_name("rsvd_1")
    7539                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_rsvd_1")
    7540                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7541                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7542              $C$DW$829       .dwtag  DW_TAG_member
    7543                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$20)
    7544                      .dwattr $C$DW$829, DW_AT_name("HRCNFG")
    7545                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_HRCNFG")
    7546                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7547                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7548              $C$DW$830       .dwtag  DW_TAG_member
    7549                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$20)
    7550                      .dwattr $C$DW$830, DW_AT_name("HRPWR")
    7551                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_HRPWR")
    7552                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7553                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7554              $C$DW$831       .dwtag  DW_TAG_member
    7555                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$21)
    7556                      .dwattr $C$DW$831, DW_AT_name("rsvd_2")
    7557                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_rsvd_2")
    7558                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7559                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7560              $C$DW$832       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$20)
    7562                      .dwattr $C$DW$832, DW_AT_name("HRMSTEP")
    7563                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_HRMSTEP")
    7564                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7565                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7566              $C$DW$833       .dwtag  DW_TAG_member
    7567                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$20)
    7568                      .dwattr $C$DW$833, DW_AT_name("rsvd_3")
    7569                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_rsvd_3")
    7570                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7571                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7572              $C$DW$834       .dwtag  DW_TAG_member
    7573                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$20)
    7574                      .dwattr $C$DW$834, DW_AT_name("HRPCTL")
    7575                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_HRPCTL")
    7576                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7577                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    7578              $C$DW$835       .dwtag  DW_TAG_member
    7579                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  141

    7580                      .dwattr $C$DW$835, DW_AT_name("rsvd_4")
    7581                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_rsvd_4")
    7582                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    7583                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7584              $C$DW$836       .dwtag  DW_TAG_member
    7585                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$20)
    7586                      .dwattr $C$DW$836, DW_AT_name("TBPRDHRM")
    7587                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_TBPRDHRM")
    7588                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7589                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7590              $C$DW$837       .dwtag  DW_TAG_member
    7591                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$20)
    7592                      .dwattr $C$DW$837, DW_AT_name("TBPRDM")
    7593                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_TBPRDM")
    7594                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    7595                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    7596              $C$DW$838       .dwtag  DW_TAG_member
    7597                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$20)
    7598                      .dwattr $C$DW$838, DW_AT_name("CMPAHRM")
    7599                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_CMPAHRM")
    7600                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7601                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7602              $C$DW$839       .dwtag  DW_TAG_member
    7603                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$20)
    7604                      .dwattr $C$DW$839, DW_AT_name("CMPAM")
    7605                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_CMPAM")
    7606                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    7607                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7608              $C$DW$840       .dwtag  DW_TAG_member
    7609                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$22)
    7610                      .dwattr $C$DW$840, DW_AT_name("rsvd_5")
    7611                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_rsvd_5")
    7612                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7613                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7614              $C$DW$841       .dwtag  DW_TAG_member
    7615                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$20)
    7616                      .dwattr $C$DW$841, DW_AT_name("DCTRIPSEL")
    7617                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_DCTRIPSEL")
    7618                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7619                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7620              $C$DW$842       .dwtag  DW_TAG_member
    7621                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$20)
    7622                      .dwattr $C$DW$842, DW_AT_name("DCACTL")
    7623                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_DCACTL")
    7624                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    7625                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7626              $C$DW$843       .dwtag  DW_TAG_member
    7627                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$20)
    7628                      .dwattr $C$DW$843, DW_AT_name("DCBCTL")
    7629                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_DCBCTL")
    7630                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7631                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7632              $C$DW$844       .dwtag  DW_TAG_member
    7633                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$20)
    7634                      .dwattr $C$DW$844, DW_AT_name("DCFCTL")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  142

    7635                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_DCFCTL")
    7636                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    7637                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7638              $C$DW$845       .dwtag  DW_TAG_member
    7639                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$20)
    7640                      .dwattr $C$DW$845, DW_AT_name("DCCAPCTL")
    7641                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_DCCAPCTL")
    7642                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7643                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7644              $C$DW$846       .dwtag  DW_TAG_member
    7645                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$20)
    7646                      .dwattr $C$DW$846, DW_AT_name("DCFOFFSET")
    7647                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_DCFOFFSET")
    7648                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7649                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7650              $C$DW$847       .dwtag  DW_TAG_member
    7651                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$20)
    7652                      .dwattr $C$DW$847, DW_AT_name("DCFOFFSETCNT")
    7653                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_DCFOFFSETCNT")
    7654                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7655                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7656              $C$DW$848       .dwtag  DW_TAG_member
    7657                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$20)
    7658                      .dwattr $C$DW$848, DW_AT_name("DCFWINDOW")
    7659                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_DCFWINDOW")
    7660                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    7661                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7662              $C$DW$849       .dwtag  DW_TAG_member
    7663                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$20)
    7664                      .dwattr $C$DW$849, DW_AT_name("DCFWINDOWCNT")
    7665                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_DCFWINDOWCNT")
    7666                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7667                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    7668              $C$DW$850       .dwtag  DW_TAG_member
    7669                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$20)
    7670                      .dwattr $C$DW$850, DW_AT_name("DCCAP")
    7671                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_DCCAP")
    7672                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    7673                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    7674                      .dwendtag $C$DW$T$23
    7675              
    7676              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Obj")
    7677                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$23)
    7678                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    7679              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    7680                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    7681                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    7682              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Handle")
    7683                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    7684                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7685              $C$DW$851       .dwtag  DW_TAG_TI_far_type
    7686                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$33)
    7687              $C$DW$T$127     .dwtag  DW_TAG_const_type
    7688                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$851)
    7689              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:20:51 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\3112010                         PAGE  143

    7690                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    7691              $C$DW$852       .dwtag  DW_TAG_TI_far_type
    7692                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$3)
    7693              $C$DW$T$133     .dwtag  DW_TAG_const_type
    7694                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$852)
    7695              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7696                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7697                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7698                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7699              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7700                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7701                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7702                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7703              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7704                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7705                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7706                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7707              $C$DW$T$7       .dwtag  DW_TAG_base_type
    7708                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7709                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7710                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    7711              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7712                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7713                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7714                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7715              $C$DW$T$9       .dwtag  DW_TAG_base_type
    7716                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    7717                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    7718                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    7719              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    7720                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    7721                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    7722              $C$DW$853       .dwtag  DW_TAG_TI_far_type
    7723                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$19)
