TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.3 *
       3              ;* Date/Time created: Mon Aug 03 18:21:01 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/victor TI/Customer issue/Zero/4inOne/Code/sw/modules/user/src/32b/us
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.3 Copyright (c) 1996-2013 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\victor TI\Customer issue\Zero\4inOne\Code\sw\solutions\instaspin
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_d_pu")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    2873              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2874              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2875              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2876              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2877              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2878              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2879              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2880              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2881              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2882              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2883              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2884              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2885              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2886              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2887              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2888              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2889              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2890              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2891              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2892              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2893              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2894              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2895              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2896              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2897              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2898              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2899              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2900                      .dwendtag $C$DW$T$73
    2901              
    2902              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2903                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2904                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2905              $C$DW$363       .dwtag  DW_TAG_TI_far_type
    2906                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$74)
    2907              $C$DW$T$76      .dwtag  DW_TAG_const_type
    2908                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$363)
    2909              
    2910              $C$DW$T$81      .dwtag  DW_TAG_enumeration_type
    2911                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x01)
    2912              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    2913              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    2914              $C$DW$366       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    2915                      .dwendtag $C$DW$T$81
    2916              
    2917              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    2918                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2919                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2920              $C$DW$367       .dwtag  DW_TAG_TI_far_type
    2921                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$82)
    2922              $C$DW$T$83      .dwtag  DW_TAG_const_type
    2923                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$367)
    2924              
    2925              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2926                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   59

    2927                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2928              $C$DW$368       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2930                      .dwattr $C$DW$368, DW_AT_name("alpha_sf")
    2931                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_alpha_sf")
    2932                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2934              $C$DW$369       .dwtag  DW_TAG_member
    2935                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2936                      .dwattr $C$DW$369, DW_AT_name("beta_sf")
    2937                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_beta_sf")
    2938                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2939                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2940              $C$DW$370       .dwtag  DW_TAG_member
    2941                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$22)
    2942                      .dwattr $C$DW$370, DW_AT_name("numSensors")
    2943                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_numSensors")
    2944                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2945                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2946                      .dwendtag $C$DW$T$23
    2947              
    2948              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2949                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2950                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2951              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2952                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2953                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    2954              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2955                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2956                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2957              
    2958              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2959                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2960                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x110)
    2961              $C$DW$371       .dwtag  DW_TAG_member
    2962                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$24)
    2963                      .dwattr $C$DW$371, DW_AT_name("version")
    2964                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_version")
    2965                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2966                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2967              $C$DW$372       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$26)
    2969                      .dwattr $C$DW$372, DW_AT_name("state")
    2970                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_state")
    2971                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2972                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2973              $C$DW$373       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$26)
    2975                      .dwattr $C$DW$373, DW_AT_name("prevState")
    2976                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_prevState")
    2977                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2978                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2979              $C$DW$374       .dwtag  DW_TAG_member
    2980                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$28)
    2981                      .dwattr $C$DW$374, DW_AT_name("errorCode")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   60

    2982                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_errorCode")
    2983                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2984                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2985              $C$DW$375       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$30)
    2987                      .dwattr $C$DW$375, DW_AT_name("clarkeHandle_I")
    2988                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2989                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2990                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2991              $C$DW$376       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$31)
    2993                      .dwattr $C$DW$376, DW_AT_name("clarke_I")
    2994                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_clarke_I")
    2995                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2996                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2997              $C$DW$377       .dwtag  DW_TAG_member
    2998                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$30)
    2999                      .dwattr $C$DW$377, DW_AT_name("clarkeHandle_V")
    3000                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3001                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3002                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3003              $C$DW$378       .dwtag  DW_TAG_member
    3004                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$31)
    3005                      .dwattr $C$DW$378, DW_AT_name("clarke_V")
    3006                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_clarke_V")
    3007                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3008                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3009              $C$DW$379       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$33)
    3011                      .dwattr $C$DW$379, DW_AT_name("estHandle")
    3012                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_estHandle")
    3013                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3014                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3015              $C$DW$380       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$35)
    3017                      .dwattr $C$DW$380, DW_AT_name("parkHandle")
    3018                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_parkHandle")
    3019                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3020                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3021              $C$DW$381       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$36)
    3023                      .dwattr $C$DW$381, DW_AT_name("park")
    3024                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_park")
    3025                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3026                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3027              $C$DW$382       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$38)
    3029                      .dwattr $C$DW$382, DW_AT_name("pidHandle_Id")
    3030                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_pidHandle_Id")
    3031                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3032                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3033              $C$DW$383       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$39)
    3035                      .dwattr $C$DW$383, DW_AT_name("pid_Id")
    3036                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_pid_Id")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   61

    3037                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3038                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3039              $C$DW$384       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$38)
    3041                      .dwattr $C$DW$384, DW_AT_name("pidHandle_Iq")
    3042                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3043                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3044                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3045              $C$DW$385       .dwtag  DW_TAG_member
    3046                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$39)
    3047                      .dwattr $C$DW$385, DW_AT_name("pid_Iq")
    3048                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pid_Iq")
    3049                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3050                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3051              $C$DW$386       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$38)
    3053                      .dwattr $C$DW$386, DW_AT_name("pidHandle_spd")
    3054                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_pidHandle_spd")
    3055                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3056                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3057              $C$DW$387       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$39)
    3059                      .dwattr $C$DW$387, DW_AT_name("pid_spd")
    3060                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_pid_spd")
    3061                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3062                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3063              $C$DW$388       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$41)
    3065                      .dwattr $C$DW$388, DW_AT_name("iparkHandle")
    3066                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_iparkHandle")
    3067                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3068                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3069              $C$DW$389       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$42)
    3071                      .dwattr $C$DW$389, DW_AT_name("ipark")
    3072                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_ipark")
    3073                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3074                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3075              $C$DW$390       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$44)
    3077                      .dwattr $C$DW$390, DW_AT_name("svgenHandle")
    3078                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_svgenHandle")
    3079                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3080                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3081              $C$DW$391       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$45)
    3083                      .dwattr $C$DW$391, DW_AT_name("svgen")
    3084                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_svgen")
    3085                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3086                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$392       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$47)
    3089                      .dwattr $C$DW$392, DW_AT_name("trajHandle_Id")
    3090                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_trajHandle_Id")
    3091                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   62

    3092                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3093              $C$DW$393       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$48)
    3095                      .dwattr $C$DW$393, DW_AT_name("traj_Id")
    3096                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_traj_Id")
    3097                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3098                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$394       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$47)
    3101                      .dwattr $C$DW$394, DW_AT_name("trajHandle_spd")
    3102                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_trajHandle_spd")
    3103                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3104                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3105              $C$DW$395       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$48)
    3107                      .dwattr $C$DW$395, DW_AT_name("traj_spd")
    3108                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_traj_spd")
    3109                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3110                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3111              $C$DW$396       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$47)
    3113                      .dwattr $C$DW$396, DW_AT_name("trajHandle_spdMax")
    3114                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3115                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3116                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3117              $C$DW$397       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$48)
    3119                      .dwattr $C$DW$397, DW_AT_name("traj_spdMax")
    3120                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_traj_spdMax")
    3121                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3122                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$398       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$49)
    3125                      .dwattr $C$DW$398, DW_AT_name("motorParams")
    3126                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_motorParams")
    3127                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3128                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3129              $C$DW$399       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$52)
    3131                      .dwattr $C$DW$399, DW_AT_name("waitTimes")
    3132                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_waitTimes")
    3133                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3134                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$400       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$51)
    3137                      .dwattr $C$DW$400, DW_AT_name("counter_state")
    3138                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_counter_state")
    3139                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3140                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$401       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$53)
    3143                      .dwattr $C$DW$401, DW_AT_name("numIsrTicksPerCtrlTick")
    3144                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3145                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3146                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   63

    3147              $C$DW$402       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$53)
    3149                      .dwattr $C$DW$402, DW_AT_name("numCtrlTicksPerCurrentTick")
    3150                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3151                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xa1]
    3152                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$403       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$53)
    3155                      .dwattr $C$DW$403, DW_AT_name("numCtrlTicksPerSpeedTick")
    3156                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3157                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3158                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$404       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$53)
    3161                      .dwattr $C$DW$404, DW_AT_name("numCtrlTicksPerTrajTick")
    3162                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3163                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xa3]
    3164                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$405       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$51)
    3167                      .dwattr $C$DW$405, DW_AT_name("ctrlFreq_Hz")
    3168                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3169                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3170                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$406       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$51)
    3173                      .dwattr $C$DW$406, DW_AT_name("trajFreq_Hz")
    3174                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3175                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3176                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$407       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3179                      .dwattr $C$DW$407, DW_AT_name("trajPeriod_sec")
    3180                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3181                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3182                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$408       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$54)
    3185                      .dwattr $C$DW$408, DW_AT_name("ctrlPeriod_sec")
    3186                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3187                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3188                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$409       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3191                      .dwattr $C$DW$409, DW_AT_name("maxVsMag_pu")
    3192                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3193                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    3194                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$410       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$55)
    3197                      .dwattr $C$DW$410, DW_AT_name("Iab_in")
    3198                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Iab_in")
    3199                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3200                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3201              $C$DW$411       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   64

    3202                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$55)
    3203                      .dwattr $C$DW$411, DW_AT_name("Iab_filt")
    3204                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Iab_filt")
    3205                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3206                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3207              $C$DW$412       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$55)
    3209                      .dwattr $C$DW$412, DW_AT_name("Idq_in")
    3210                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Idq_in")
    3211                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3212                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$413       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$55)
    3215                      .dwattr $C$DW$413, DW_AT_name("Vab_in")
    3216                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Vab_in")
    3217                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3218                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$414       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3221                      .dwattr $C$DW$414, DW_AT_name("spd_out")
    3222                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_spd_out")
    3223                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    3224                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3225              $C$DW$415       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$55)
    3227                      .dwattr $C$DW$415, DW_AT_name("Vab_out")
    3228                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Vab_out")
    3229                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3230                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3231              $C$DW$416       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$55)
    3233                      .dwattr $C$DW$416, DW_AT_name("Vdq_out")
    3234                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Vdq_out")
    3235                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3236                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$417       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$54)
    3239                      .dwattr $C$DW$417, DW_AT_name("Rhf")
    3240                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Rhf")
    3241                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3242                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$418       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$54)
    3245                      .dwattr $C$DW$418, DW_AT_name("Lhf")
    3246                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Lhf")
    3247                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3248                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3249              $C$DW$419       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$54)
    3251                      .dwattr $C$DW$419, DW_AT_name("RoverL")
    3252                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_RoverL")
    3253                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3254                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3255              $C$DW$420       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   65

    3257                      .dwattr $C$DW$420, DW_AT_name("Kp_Id")
    3258                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Kp_Id")
    3259                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3260                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3261              $C$DW$421       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3263                      .dwattr $C$DW$421, DW_AT_name("Kp_Iq")
    3264                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Kp_Iq")
    3265                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3266                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3267              $C$DW$422       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3269                      .dwattr $C$DW$422, DW_AT_name("Kp_spd")
    3270                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Kp_spd")
    3271                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3272                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3273              $C$DW$423       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3275                      .dwattr $C$DW$423, DW_AT_name("Ki_Id")
    3276                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Ki_Id")
    3277                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3278                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3279              $C$DW$424       .dwtag  DW_TAG_member
    3280                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3281                      .dwattr $C$DW$424, DW_AT_name("Ki_Iq")
    3282                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Ki_Iq")
    3283                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3284                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3285              $C$DW$425       .dwtag  DW_TAG_member
    3286                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3287                      .dwattr $C$DW$425, DW_AT_name("Ki_spd")
    3288                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Ki_spd")
    3289                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3290                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3291              $C$DW$426       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3293                      .dwattr $C$DW$426, DW_AT_name("Kd_Id")
    3294                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Kd_Id")
    3295                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3296                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3297              $C$DW$427       .dwtag  DW_TAG_member
    3298                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3299                      .dwattr $C$DW$427, DW_AT_name("Kd_Iq")
    3300                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Kd_Iq")
    3301                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3302                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3303              $C$DW$428       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3305                      .dwattr $C$DW$428, DW_AT_name("Kd_spd")
    3306                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Kd_spd")
    3307                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3308                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3309              $C$DW$429       .dwtag  DW_TAG_member
    3310                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3311                      .dwattr $C$DW$429, DW_AT_name("Ui_Id")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   66

    3312                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Ui_Id")
    3313                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3314                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3315              $C$DW$430       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3317                      .dwattr $C$DW$430, DW_AT_name("Ui_Iq")
    3318                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Ui_Iq")
    3319                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3320                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3321              $C$DW$431       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3323                      .dwattr $C$DW$431, DW_AT_name("Ui_spd")
    3324                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_Ui_spd")
    3325                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3326                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3327              $C$DW$432       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$55)
    3329                      .dwattr $C$DW$432, DW_AT_name("Idq_ref")
    3330                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Idq_ref")
    3331                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3332                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3333              $C$DW$433       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3335                      .dwattr $C$DW$433, DW_AT_name("IdRated")
    3336                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_IdRated")
    3337                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3338                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3339              $C$DW$434       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    3341                      .dwattr $C$DW$434, DW_AT_name("spd_ref")
    3342                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_spd_ref")
    3343                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3344                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3345              $C$DW$435       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    3347                      .dwattr $C$DW$435, DW_AT_name("spd_max")
    3348                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_spd_max")
    3349                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3350                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3351              $C$DW$436       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
    3353                      .dwattr $C$DW$436, DW_AT_name("counter_current")
    3354                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_counter_current")
    3355                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3356                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3357              $C$DW$437       .dwtag  DW_TAG_member
    3358                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$53)
    3359                      .dwattr $C$DW$437, DW_AT_name("counter_isr")
    3360                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_counter_isr")
    3361                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3362                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3363              $C$DW$438       .dwtag  DW_TAG_member
    3364                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$51)
    3365                      .dwattr $C$DW$438, DW_AT_name("counter_forceangle")
    3366                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_counter_forceangle")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   67

    3367                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3368                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3369              $C$DW$439       .dwtag  DW_TAG_member
    3370                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$51)
    3371                      .dwattr $C$DW$439, DW_AT_name("counter_calibration")
    3372                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_counter_calibration")
    3373                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3374                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3375              $C$DW$440       .dwtag  DW_TAG_member
    3376                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$53)
    3377                      .dwattr $C$DW$440, DW_AT_name("counter_speed")
    3378                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_counter_speed")
    3379                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3380                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3381              $C$DW$441       .dwtag  DW_TAG_member
    3382                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$53)
    3383                      .dwattr $C$DW$441, DW_AT_name("counter_traj")
    3384                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_counter_traj")
    3385                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xf7]
    3386                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3387              $C$DW$442       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    3389                      .dwattr $C$DW$442, DW_AT_name("flag_enableCtrl")
    3390                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3391                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3392                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3393              $C$DW$443       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3395                      .dwattr $C$DW$443, DW_AT_name("flag_enableDcBusComp")
    3396                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3397                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xf9]
    3398                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3399              $C$DW$444       .dwtag  DW_TAG_member
    3400                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    3401                      .dwattr $C$DW$444, DW_AT_name("flag_enablePowerWarp")
    3402                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3403                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3404                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3405              $C$DW$445       .dwtag  DW_TAG_member
    3406                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
    3407                      .dwattr $C$DW$445, DW_AT_name("flag_enableOffset")
    3408                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_flag_enableOffset")
    3409                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb]
    3410                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3411              $C$DW$446       .dwtag  DW_TAG_member
    3412                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    3413                      .dwattr $C$DW$446, DW_AT_name("flag_enableSpeedCtrl")
    3414                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3415                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3416                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3417              $C$DW$447       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    3419                      .dwattr $C$DW$447, DW_AT_name("flag_enableUserMotorParams")
    3420                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3421                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   68

    3422                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3423              $C$DW$448       .dwtag  DW_TAG_member
    3424                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$55)
    3425                      .dwattr $C$DW$448, DW_AT_name("Idq_offset_pu")
    3426                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3427                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3428                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3429              $C$DW$449       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$55)
    3431                      .dwattr $C$DW$449, DW_AT_name("Vdq_offset_pu")
    3432                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3433                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3434                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3435              $C$DW$450       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    3437                      .dwattr $C$DW$450, DW_AT_name("angle_pu")
    3438                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_angle_pu")
    3439                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3440                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3441              $C$DW$451       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    3443                      .dwattr $C$DW$451, DW_AT_name("speed_ref_pu")
    3444                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_speed_ref_pu")
    3445                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3446                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3447              $C$DW$452       .dwtag  DW_TAG_member
    3448                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    3449                      .dwattr $C$DW$452, DW_AT_name("speed_fb_pu")
    3450                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_speed_fb_pu")
    3451                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    3452                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3453              $C$DW$453       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    3455                      .dwattr $C$DW$453, DW_AT_name("speed_outMax_pu")
    3456                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3457                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3458                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3459              $C$DW$454       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$56)
    3461                      .dwattr $C$DW$454, DW_AT_name("flag_enableCurrentCtrl")
    3462                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3463                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    3464                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3465                      .dwendtag $C$DW$T$57
    3466              
    3467              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3468                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$57)
    3469                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3470              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3471                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3472                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    3473              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3474                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3475                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3476              $C$DW$455       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   69

    3477                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$86)
    3478              $C$DW$T$87      .dwtag  DW_TAG_const_type
    3479                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$455)
    3480              
    3481              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3482                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3483                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3484              $C$DW$456       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
    3486                      .dwattr $C$DW$456, DW_AT_name("rsvd")
    3487                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_rsvd")
    3488                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3489                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3490              $C$DW$457       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$59)
    3492                      .dwattr $C$DW$457, DW_AT_name("targetProc")
    3493                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_targetProc")
    3494                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3495                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3496              $C$DW$458       .dwtag  DW_TAG_member
    3497                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$21)
    3498                      .dwattr $C$DW$458, DW_AT_name("major")
    3499                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_major")
    3500                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3501                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3502              $C$DW$459       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
    3504                      .dwattr $C$DW$459, DW_AT_name("minor")
    3505                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_minor")
    3506                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3507                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3508                      .dwendtag $C$DW$T$60
    3509              
    3510              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3511                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3512                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3513              
    3514              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3515                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3516                      .dwattr $C$DW$T$19, DW_AT_declaration
    3517                      .dwendtag $C$DW$T$19
    3518              
    3519              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3520                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3521                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3522              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3523                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3524                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3525              
    3526              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3527                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3528                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3529              $C$DW$460       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    3531                      .dwattr $C$DW$460, DW_AT_name("sinTh")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   70

    3532                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_sinTh")
    3533                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3534                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3535              $C$DW$461       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    3537                      .dwattr $C$DW$461, DW_AT_name("cosTh")
    3538                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_cosTh")
    3539                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3540                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3541                      .dwendtag $C$DW$T$61
    3542              
    3543              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3544                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3545                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3546              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3547                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3548                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3549              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3550                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3551                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3552              
    3553              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3554                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3555                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3556              $C$DW$462       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$62)
    3558                      .dwattr $C$DW$462, DW_AT_name("value")
    3559                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_value")
    3560                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3561                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3562                      .dwendtag $C$DW$T$63
    3563              
    3564              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3565                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3566                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3567              
    3568              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3569                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3570                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3571              $C$DW$463       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$65)
    3573                      .dwattr $C$DW$463, DW_AT_name("type")
    3574                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_type")
    3575                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3576                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3577              $C$DW$464       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$53)
    3579                      .dwattr $C$DW$464, DW_AT_name("numPolePairs")
    3580                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_numPolePairs")
    3581                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3582                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3583              $C$DW$465       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3585                      .dwattr $C$DW$465, DW_AT_name("Lr_H")
    3586                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_Lr_H")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   71

    3587                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3588                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3589              $C$DW$466       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3591                      .dwattr $C$DW$466, DW_AT_name("Ls_d_H")
    3592                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Ls_d_H")
    3593                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3594                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3595              $C$DW$467       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3597                      .dwattr $C$DW$467, DW_AT_name("Ls_q_H")
    3598                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Ls_q_H")
    3599                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3600                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3601              $C$DW$468       .dwtag  DW_TAG_member
    3602                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3603                      .dwattr $C$DW$468, DW_AT_name("Rr_Ohm")
    3604                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_Rr_Ohm")
    3605                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3606                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3607              $C$DW$469       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3609                      .dwattr $C$DW$469, DW_AT_name("Rs_Ohm")
    3610                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Rs_Ohm")
    3611                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3612                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3613              $C$DW$470       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3615                      .dwattr $C$DW$470, DW_AT_name("ratedFlux_VpHz")
    3616                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3617                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3618                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3619                      .dwendtag $C$DW$T$66
    3620              
    3621              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3622                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3623                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3624              
    3625              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3626                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3627                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3628              $C$DW$471       .dwtag  DW_TAG_member
    3629                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    3630                      .dwattr $C$DW$471, DW_AT_name("sinTh")
    3631                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_sinTh")
    3632                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3633                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3634              $C$DW$472       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3636                      .dwattr $C$DW$472, DW_AT_name("cosTh")
    3637                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_cosTh")
    3638                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3639                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3640                      .dwendtag $C$DW$T$67
    3641              
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   72

    3642              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3643                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3644                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3645              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3646                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3647                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    3648              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3649                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3650                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3651              
    3652              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3653                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3654                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3655              $C$DW$473       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3657                      .dwattr $C$DW$473, DW_AT_name("Kp")
    3658                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_Kp")
    3659                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3660                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3661              $C$DW$474       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3663                      .dwattr $C$DW$474, DW_AT_name("Ki")
    3664                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_Ki")
    3665                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3666                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3667              $C$DW$475       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3669                      .dwattr $C$DW$475, DW_AT_name("Kd")
    3670                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_Kd")
    3671                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3672                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3673              $C$DW$476       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3675                      .dwattr $C$DW$476, DW_AT_name("Ui")
    3676                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_Ui")
    3677                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3678                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3679              $C$DW$477       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3681                      .dwattr $C$DW$477, DW_AT_name("refValue")
    3682                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_refValue")
    3683                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3684                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3685              $C$DW$478       .dwtag  DW_TAG_member
    3686                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3687                      .dwattr $C$DW$478, DW_AT_name("fbackValue")
    3688                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_fbackValue")
    3689                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3690                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3691              $C$DW$479       .dwtag  DW_TAG_member
    3692                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3693                      .dwattr $C$DW$479, DW_AT_name("outMin")
    3694                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_outMin")
    3695                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3696                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   73

    3697              $C$DW$480       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3699                      .dwattr $C$DW$480, DW_AT_name("outMax")
    3700                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_outMax")
    3701                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3702                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3703                      .dwendtag $C$DW$T$68
    3704              
    3705              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3706                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3707                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3708              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3709                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3710                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    3711              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3712                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3713                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3714              
    3715              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3716                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3717                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3718              $C$DW$481       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    3720                      .dwattr $C$DW$481, DW_AT_name("maxModulation")
    3721                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_maxModulation")
    3722                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3723                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3724                      .dwendtag $C$DW$T$69
    3725              
    3726              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3727                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3728                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3729              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3730                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3731                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3732              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3733                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3734                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3735              
    3736              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3737                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3738                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3739              $C$DW$482       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    3741                      .dwattr $C$DW$482, DW_AT_name("targetValue")
    3742                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_targetValue")
    3743                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3744                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3745              $C$DW$483       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    3747                      .dwattr $C$DW$483, DW_AT_name("intValue")
    3748                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_intValue")
    3749                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3750                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$484       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   74

    3752                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    3753                      .dwattr $C$DW$484, DW_AT_name("minValue")
    3754                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_minValue")
    3755                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3756                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$485       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    3759                      .dwattr $C$DW$485, DW_AT_name("maxValue")
    3760                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_maxValue")
    3761                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3762                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$486       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    3765                      .dwattr $C$DW$486, DW_AT_name("maxDelta")
    3766                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_maxDelta")
    3767                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3768                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3769                      .dwendtag $C$DW$T$70
    3770              
    3771              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3772                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3773                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3774              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3775                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3776                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3777              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3778                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3779                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3780              
    3781              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3782                      .dwattr $C$DW$T$75, DW_AT_name("_USER_Params_")
    3783                      .dwattr $C$DW$T$75, DW_AT_byte_size(0xb0)
    3784              $C$DW$487       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$54)
    3786                      .dwattr $C$DW$487, DW_AT_name("iqFullScaleCurrent_A")
    3787                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3788                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3789                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$488       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    3792                      .dwattr $C$DW$488, DW_AT_name("iqFullScaleVoltage_V")
    3793                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3794                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3795                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3796              $C$DW$489       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    3798                      .dwattr $C$DW$489, DW_AT_name("iqFullScaleFreq_Hz")
    3799                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3800                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3801                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3802              $C$DW$490       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$53)
    3804                      .dwattr $C$DW$490, DW_AT_name("numIsrTicksPerCtrlTick")
    3805                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3806                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   75

    3807                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3808              $C$DW$491       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$53)
    3810                      .dwattr $C$DW$491, DW_AT_name("numCtrlTicksPerCurrentTick")
    3811                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3812                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3813                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3814              $C$DW$492       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$53)
    3816                      .dwattr $C$DW$492, DW_AT_name("numCtrlTicksPerEstTick")
    3817                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3818                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3819                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3820              $C$DW$493       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$53)
    3822                      .dwattr $C$DW$493, DW_AT_name("numCtrlTicksPerSpeedTick")
    3823                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3824                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3825                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3826              $C$DW$494       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$53)
    3828                      .dwattr $C$DW$494, DW_AT_name("numCtrlTicksPerTrajTick")
    3829                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3830                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3831                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3832              $C$DW$495       .dwtag  DW_TAG_member
    3833                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$22)
    3834                      .dwattr $C$DW$495, DW_AT_name("numCurrentSensors")
    3835                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_numCurrentSensors")
    3836                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3837                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3838              $C$DW$496       .dwtag  DW_TAG_member
    3839                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    3840                      .dwattr $C$DW$496, DW_AT_name("numVoltageSensors")
    3841                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_numVoltageSensors")
    3842                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3843                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3844              $C$DW$497       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    3846                      .dwattr $C$DW$497, DW_AT_name("offsetPole_rps")
    3847                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_offsetPole_rps")
    3848                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3849                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3850              $C$DW$498       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3852                      .dwattr $C$DW$498, DW_AT_name("fluxPole_rps")
    3853                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_fluxPole_rps")
    3854                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3855                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3856              $C$DW$499       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3858                      .dwattr $C$DW$499, DW_AT_name("zeroSpeedLimit")
    3859                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3860                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3861                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   76

    3862              $C$DW$500       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3864                      .dwattr $C$DW$500, DW_AT_name("forceAngleFreq_Hz")
    3865                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3866                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3867                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3868              $C$DW$501       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3870                      .dwattr $C$DW$501, DW_AT_name("maxAccel_Hzps")
    3871                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3872                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3873                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3874              $C$DW$502       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3876                      .dwattr $C$DW$502, DW_AT_name("maxAccel_est_Hzps")
    3877                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3878                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3879                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$503       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    3882                      .dwattr $C$DW$503, DW_AT_name("directionPole_rps")
    3883                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_directionPole_rps")
    3884                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3885                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$504       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    3888                      .dwattr $C$DW$504, DW_AT_name("speedPole_rps")
    3889                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_speedPole_rps")
    3890                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3891                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$505       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    3894                      .dwattr $C$DW$505, DW_AT_name("dcBusPole_rps")
    3895                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3896                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3897                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3898              $C$DW$506       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    3900                      .dwattr $C$DW$506, DW_AT_name("fluxFraction")
    3901                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_fluxFraction")
    3902                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3903                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3904              $C$DW$507       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    3906                      .dwattr $C$DW$507, DW_AT_name("indEst_speedMaxFraction")
    3907                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3908                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3909                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3910              $C$DW$508       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    3912                      .dwattr $C$DW$508, DW_AT_name("powerWarpGain")
    3913                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_powerWarpGain")
    3914                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3915                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3916              $C$DW$509       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   77

    3917                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$53)
    3918                      .dwattr $C$DW$509, DW_AT_name("systemFreq_MHz")
    3919                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3920                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3921                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3922              $C$DW$510       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$54)
    3924                      .dwattr $C$DW$510, DW_AT_name("pwmPeriod_usec")
    3925                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3926                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3927                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3928              $C$DW$511       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    3930                      .dwattr $C$DW$511, DW_AT_name("voltage_sf")
    3931                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_voltage_sf")
    3932                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3933                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3934              $C$DW$512       .dwtag  DW_TAG_member
    3935                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$54)
    3936                      .dwattr $C$DW$512, DW_AT_name("current_sf")
    3937                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_current_sf")
    3938                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3939                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3940              $C$DW$513       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$54)
    3942                      .dwattr $C$DW$513, DW_AT_name("voltageFilterPole_rps")
    3943                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3944                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3945                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3946              $C$DW$514       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    3948                      .dwattr $C$DW$514, DW_AT_name("maxVsMag_pu")
    3949                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3950                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3951                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3952              $C$DW$515       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    3954                      .dwattr $C$DW$515, DW_AT_name("estKappa")
    3955                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_estKappa")
    3956                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3957                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3958              $C$DW$516       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$65)
    3960                      .dwattr $C$DW$516, DW_AT_name("motor_type")
    3961                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_motor_type")
    3962                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3963                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3964              $C$DW$517       .dwtag  DW_TAG_member
    3965                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$53)
    3966                      .dwattr $C$DW$517, DW_AT_name("motor_numPolePairs")
    3967                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3968                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3969                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3970              $C$DW$518       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   78

    3972                      .dwattr $C$DW$518, DW_AT_name("motor_ratedFlux")
    3973                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3974                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3975                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3976              $C$DW$519       .dwtag  DW_TAG_member
    3977                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    3978                      .dwattr $C$DW$519, DW_AT_name("motor_Rr")
    3979                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_motor_Rr")
    3980                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3981                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3982              $C$DW$520       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    3984                      .dwattr $C$DW$520, DW_AT_name("motor_Rs")
    3985                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_motor_Rs")
    3986                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3987                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3988              $C$DW$521       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    3990                      .dwattr $C$DW$521, DW_AT_name("motor_Ls_d")
    3991                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_motor_Ls_d")
    3992                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3993                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$522       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    3996                      .dwattr $C$DW$522, DW_AT_name("motor_Ls_q")
    3997                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_motor_Ls_q")
    3998                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3999                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4000              $C$DW$523       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4002                      .dwattr $C$DW$523, DW_AT_name("maxCurrent")
    4003                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_maxCurrent")
    4004                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4005                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4006              $C$DW$524       .dwtag  DW_TAG_member
    4007                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
    4008                      .dwattr $C$DW$524, DW_AT_name("maxCurrent_resEst")
    4009                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4010                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4011                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4012              $C$DW$525       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4014                      .dwattr $C$DW$525, DW_AT_name("maxCurrent_indEst")
    4015                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4016                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4017                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4018              $C$DW$526       .dwtag  DW_TAG_member
    4019                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4020                      .dwattr $C$DW$526, DW_AT_name("maxCurrentSlope")
    4021                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4022                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4023                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4024              $C$DW$527       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4026                      .dwattr $C$DW$527, DW_AT_name("maxCurrentSlope_powerWarp")
TMS320C2000 Assembler PC v6.2.3 Mon Aug 03 18:21:01 2015

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
C:\Users\a0220341\AppData\Local\Temp\1228411                         PAGE   79

    4027                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4028                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4029                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4030              $C$DW$528       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4032                      .dwattr $C$DW$528, DW_AT_name("IdRated")
    4033                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_IdRated")
    4034                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4035                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4036              $C$DW$529       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$54)
    4038                      .dwattr $C$DW$529, DW_AT_name("IdRatedFraction_indEst")
    4039                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4040                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4041                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4042              $C$DW$530       .dwtag  DW_TAG_member
    4043                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$54)
    4044                      .dwattr $C$DW$530, DW_AT_name("IdRatedFraction_ratedFlux")
    4045                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
